--- core/src/fingerprint.rs
+++ replace State::write -> io::Result<()> with Ok(())
@@ -48,24 +48,17 @@
             .unwrap_or_default()
     }
 
     pub fn write(
         path: &Path,
         profile: &str,
         owned: BTreeMap<String, BTreeMap<String, String>>,
     ) -> io::Result<()> {
-        let state = State {
-            version: VERSION,
-            profile: profile.to_string(),
-            owned,
-        };
-        let bytes = serde_json::to_vec_pretty(&state)
-            .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-        crate::atomic::write_atomically(path, &bytes, 0o600)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether `value` differs from what tapkey recorded writing. Unknown slots never drift:
     /// reporting drift against something we never owned would make the signal meaningless on
     /// a machine where nothing has been switched yet.
     pub fn drifted(&self, tool: &str, slot: &str, value: Option<&str>) -> bool {
         match self.owned.get(tool).and_then(|s| s.get(slot)) {
             Some(recorded) => value.map(hash).as_deref() != Some(recorded.as_str()),
