--- core/src/lock.rs
+++ replace | with & in take
@@ -36,17 +36,17 @@
 /// Somebody else is writing. Not an error in the file system sense — a fact about timing.
 #[derive(Debug)]
 pub struct Busy(pub String);
 
 #[cfg(unix)]
 fn take(file: &File) -> Result<(), Busy> {
     use std::os::unix::io::AsRawFd;
     // SAFETY: the descriptor is owned by `file` and outlives the call.
-    let taken = unsafe { libc::flock(file.as_raw_fd(), libc::LOCK_EX | libc::LOCK_NB) };
+    let taken = unsafe { libc::flock(file.as_raw_fd(), libc::LOCK_EX & /* ~ changed by cargo-mutants ~ */ libc::LOCK_NB) };
     if taken == 0 {
         return Ok(());
     }
     Err(Busy(io::Error::last_os_error().to_string()))
 }
 
 #[cfg(not(unix))]
 fn take(_file: &File) -> Result<(), Busy> {
