*** core/src/adapters/claude.rs:126:5: replace scope_path -> Option<PathBuf> with None

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace scope_path -> Option<PathBuf> with None
@@ -118,23 +118,17 @@
         scope,
         value: None,
         observable: false,
         wins: false,
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
-    match scope {
-        "managed" => Some(env.managed().to_path_buf()),
-        "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
-        "project" => Some(env.project()?.join(".claude").join("settings.json")),
-        "user" => Some(env.home().join(".claude").join("settings.json")),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_settings(path: &Path) -> Result<Option<Document>, crate::json::Error> {
     match std::fs::read(path) {
         Ok(bytes) => Document::parse(&bytes).map(Some),
         // A file that is not there is not an error: installing Claude Code creates none.
         Err(_) => Ok(None),
     }

---- reports_the_endpoint_a_user_settings_file_sets stdout ----

thread 'reports_the_endpoint_a_user_settings_file_sets' (16534313) panicked at core/tests/effective_state.rs:23:5:
assertion `left == right` failed
  left: Null
 right: String("https://api.a6api.com")

---- the_chain_is_ordered_by_precedence_even_when_scopes_are_absent stdout ----

thread 'the_chain_is_ordered_by_precedence_even_when_scopes_are_absent' (16534315) panicked at core/tests/effective_state.rs:223:5:
assertion `left == right` failed: no managed or project file exists here, and the rest must keep their order
  left: ["command line", "shell", "cloud session"]
 right: ["command line", "user", "shell", "cloud session"]

---- a_settings_file_beats_a_shell_export stdout ----

thread 'a_settings_file_beats_a_shell_export' (16534309) panicked at core/tests/effective_state.rs:103:5:
assertion `left == right` failed
  left: String("https://shell.test")
 right: String("https://file.test")

failures:
    a_duplicate_key_refuses_the_whole_read
    a_project_config_outranks_the_user_file_and_the_chain_names_both
    a_settings_file_beats_a_shell_export
    managed_settings_outrank_everything_on_disk
    project_local_outranks_the_shared_project_file
    reports_the_endpoint_a_user_settings_file_sets
    the_chain_is_ordered_by_precedence_even_when_scopes_are_absent

test result: FAILED. 3 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
