*** core/src/adapters/claude.rs:126:5: replace scope_path -> Option<PathBuf> with Some(Default::default())

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace scope_path -> Option<PathBuf> with Some(Default::default())
@@ -118,23 +118,17 @@
         scope,
         value: None,
         observable: false,
         wins: false,
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
-    match scope {
-        "managed" => Some(env.managed().to_path_buf()),
-        "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
-        "project" => Some(env.project()?.join(".claude").join("settings.json")),
-        "user" => Some(env.home().join(".claude").join("settings.json")),
-        _ => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_settings(path: &Path) -> Result<Option<Document>, crate::json::Error> {
     match std::fs::read(path) {
         Ok(bytes) => Document::parse(&bytes).map(Some),
         // A file that is not there is not an error: installing Claude Code creates none.
         Err(_) => Ok(None),
     }

---- a_duplicate_key_refuses_the_whole_read stdout ----

thread 'a_duplicate_key_refuses_the_whole_read' (16534820) panicked at core/tests/effective_state.rs:170:5:
assertion `left == right` failed
  left: Bool(true)
 right: Bool(false)

---- a_project_config_outranks_the_user_file_and_the_chain_names_both stdout ----

thread 'a_project_config_outranks_the_user_file_and_the_chain_names_both' (16534821) panicked at core/tests/effective_state.rs:47:5:
assertion `left == right` failed
  left: Null
 right: String("https://project.test")

---- project_local_outranks_the_shared_project_file stdout ----

thread 'project_local_outranks_the_shared_project_file' (16534825) panicked at core/tests/effective_state.rs:68:5:
assertion `left == right` failed
  left: Null
 right: String("https://local.test")

failures:
    a_duplicate_key_refuses_the_whole_read
    a_project_config_outranks_the_user_file_and_the_chain_names_both
    a_settings_file_beats_a_shell_export
    managed_settings_outrank_everything_on_disk
    project_local_outranks_the_shared_project_file
    reports_the_endpoint_a_user_settings_file_sets
    the_chain_is_ordered_by_precedence_even_when_scopes_are_absent

test result: FAILED. 3 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
