*** core/src/adapters/claude.rs:129:9: delete match arm "project" in scope_path

*** mutation diff:
--- core/src/adapters/claude.rs
+++ delete match arm "project" in scope_path
@@ -121,17 +121,17 @@
         wins: false,
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
     match scope {
         "managed" => Some(env.managed().to_path_buf()),
         "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
-        "project" => Some(env.project()?.join(".claude").join("settings.json")),
+         /* ~ changed by cargo-mutants ~ */
         "user" => Some(env.home().join(".claude").join("settings.json")),
         _ => None,
     }
 }
 
 fn read_settings(path: &Path) -> Result<Option<Document>, crate::json::Error> {
     match std::fs::read(path) {
         Ok(bytes) => Document::parse(&bytes).map(Some),

---- a_project_config_outranks_the_user_file_and_the_chain_names_both stdout ----

thread 'a_project_config_outranks_the_user_file_and_the_chain_names_both' (16551586) panicked at core/tests/effective_state.rs:47:5:
assertion `left == right` failed
  left: String("https://user.test")
 right: String("https://project.test")

failures:
    a_project_config_outranks_the_user_file_and_the_chain_names_both

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
