*** core/src/adapters/claude.rs:224:9: delete match arm Source::Unseen{scope, why} in unseen_from

*** mutation diff:
--- core/src/adapters/claude.rs
+++ delete match arm Source::Unseen{scope, why} in unseen_from
@@ -216,17 +216,17 @@
         value: None,
         observable: false,
         wins: false,
     }
 }
 
 fn unseen_from(source: Source) -> Link {
     match source {
-        Source::Unseen { scope, why } => unseen(scope, why, ""),
+         /* ~ changed by cargo-mutants ~ */
         _ => unreachable!("only an Unseen source becomes an unseen link"),
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
     match scope {
         "managed" => Some(env.managed().to_path_buf()),
         "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),

---- advisor_fallback_and_model_overrides_are_observed_not_owned stdout ----

thread 'advisor_fallback_and_model_overrides_are_observed_not_owned' (17522379) panicked at core/src/adapters/claude.rs:225:14:
internal error: entered unreachable code: only an Unseen source becomes an unseen link

---- a_link_names_the_key_it_read_not_only_the_file stdout ----

thread 'a_link_names_the_key_it_read_not_only_the_file' (17522378) panicked at core/src/adapters/claude.rs:225:14:
internal error: entered unreachable code: only an Unseen source becomes an unseen link

---- anthropic_default_model_is_the_last_word_not_the_first stdout ----

thread 'anthropic_default_model_is_the_last_word_not_the_first' (17522380) panicked at core/src/adapters/claude.rs:225:14:
internal error: entered unreachable code: only an Unseen source becomes an unseen link

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_main_slots_unobservable_scopes_are_in_the_right_order
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 0 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
