*** core/src/adapters/claude.rs:234:9: delete match arm "user" in scope_path

*** mutation diff:
--- core/src/adapters/claude.rs
+++ delete match arm "user" in scope_path
@@ -226,17 +226,17 @@
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
     match scope {
         "managed" => Some(env.managed().to_path_buf()),
         "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
         "project" => Some(env.project()?.join(".claude").join("settings.json")),
-        "user" => Some(env.home().join(".claude").join("settings.json")),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 /// Paths are reported as the person would type them, so a chain reads like their filesystem.
 fn display_path(path: &Path, env: &Env) -> String {
     match path.strip_prefix(env.home()) {
         Ok(rest) => format!("~/{}", rest.display()),

---- the_deprecated_small_fast_variable_still_wins_the_utility_slot stdout ----

thread 'the_deprecated_small_fast_variable_still_wins_the_utility_slot' (17530379) panicked at core/tests/effective_slots.rs:88:5:
assertion `left == right` failed
  left: Null
 right: String("old/model")

---- the_main_slots_unobservable_scopes_are_in_the_right_order stdout ----

thread 'the_main_slots_unobservable_scopes_are_in_the_right_order' (17530381) panicked at core/tests/effective_slots.rs:171:5:
assertion `left == right` failed: session above the command line, then ANTHROPIC_MODEL, then the model key, then ANTHROPIC_DEFAULT_MODEL
  left: ["session", "command line", "shell", "shell", "cloud session"]
 right: ["session", "command line", "user", "shell", "user", "user", "shell", "cloud session"]

---- anthropic_default_model_is_the_last_word_not_the_first stdout ----

thread 'anthropic_default_model_is_the_last_word_not_the_first' (17530377) panicked at core/tests/effective_slots.rs:73:5:
assertion `left == right` failed
  left: Null
 right: String("sonnet")

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_main_slots_unobservable_scopes_are_in_the_right_order
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 0 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
