*** core/src/adapters/claude.rs:251:5: replace settle with ()

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace settle with ()
@@ -243,19 +243,17 @@
         Err(_) => path.display().to_string(),
     }
 }
 
 /// The highest-precedence entry that actually carries a value wins. Being consulted is not the
 /// same condition as having an opinion, and an unobservable scope can never be said to win: we
 /// do not know what is there, and claiming otherwise would be intent dressed as observation.
 fn settle(chain: &mut [Link]) {
-    if let Some(link) = chain.iter_mut().find(|l| l.observable && l.value.is_some()) {
-        link.wins = true;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn winning_value(chain: &[Link]) -> Option<String> {
     chain.iter().find(|l| l.wins).and_then(|l| l.value.clone())
 }
 
 // -------------------------------------------------------------------------------------------
 // Writing

---- the_deprecated_small_fast_variable_still_wins_the_utility_slot stdout ----

thread 'the_deprecated_small_fast_variable_still_wins_the_utility_slot' (17535803) panicked at core/tests/effective_slots.rs:88:5:
assertion `left == right` failed
  left: Null
 right: String("old/model")

---- anthropic_default_model_is_the_last_word_not_the_first stdout ----

thread 'anthropic_default_model_is_the_last_word_not_the_first' (17535801) panicked at core/tests/effective_slots.rs:73:5:
assertion `left == right` failed
  left: Null
 right: String("sonnet")

---- the_main_model_comes_from_the_environment_variable stdout ----

thread 'the_main_model_comes_from_the_environment_variable' (17535804) panicked at core/tests/effective_slots.rs:34:5:
assertion `left == right` failed
  left: Null
 right: String("deepseek/v3.2")

failures:
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 2 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
