*** core/src/adapters/claude.rs:289:5: replace plan_switch -> Result<Vec<Action>, JsonError> with Ok(vec![])

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace plan_switch -> Result<Vec<Action>, JsonError> with Ok(vec![])
@@ -281,53 +281,17 @@
 /// created: an unconditional write would leave tapkey's fingerprints where nobody asked.
 const DEPRECATED_UTILITY: &str = "ANTHROPIC_SMALL_FAST_MODEL";
 
 /// Turn one tool's assignment into the single write that applies it.
 ///
 /// Nothing is written here; the transaction owns that, so the all-or-nothing guarantee lives
 /// in one place.
 pub fn plan_switch(env: &Env, assignment: &ToolAssignment) -> Result<Vec<Action>, JsonError> {
-    let path = env.home().join(".claude").join("settings.json");
-    let existing = std::fs::read(&path).unwrap_or_else(|_| b"{}".to_vec());
-    let mut doc = Document::parse(&existing)?;
-
-    match &assignment.endpoint {
-        Some(url) => doc.set_string(&["env", ENDPOINT_VAR], url)?,
-        None => clear(&mut doc, env, ENDPOINT_VAR)?,
-    }
-
-    for (slot, var, has_companion) in OWNED {
-        match assignment.slots.get(*slot).and_then(|v| v.as_ref()) {
-            Some(model) => {
-                doc.set_string(&["env", var], model)?;
-                if *has_companion {
-                    // Without it the tool's own picker keeps announcing Opus 5 over somebody
-                    // else's model, which is making another interface lie.
-                    doc.set_string(&["env", &format!("{var}_NAME")], model)?;
-                }
-                if *slot == "utility" && doc.get_string(&["env", DEPRECATED_UTILITY]).is_some() {
-                    doc.set_string(&["env", DEPRECATED_UTILITY], model)?;
-                }
-            }
-            None => {
-                clear(&mut doc, env, var)?;
-                if *has_companion {
-                    clear(&mut doc, env, &format!("{var}_NAME"))?;
-                }
-            }
-        }
-    }
-
-    Ok(vec![Action::Write {
-        path,
-        bytes: doc.to_bytes(),
-        // A file that already exists keeps its mode; this is only for one tapkey creates.
-        mode: 0o600,
-    }])
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Remove what tapkey wrote, and neutralise an inherited export if there is one.
 ///
 /// A settings file can set a variable and cannot unset one, so an export is overridden with an
 /// empty value — measured to work, and only when an export exists: writing `""` unconditionally
 /// would leave tapkey's fingerprints in a file it claims to have cleaned.
 fn clear(doc: &mut Document, env: &Env, var: &str) -> Result<(), JsonError> {

---- a_switch_writes_the_endpoint_and_the_models_into_the_env_block stdout ----

thread 'a_switch_writes_the_endpoint_and_the_models_into_the_env_block' (17542472) panicked at core/tests/switching.rs:38:5:
{
  "theme": "dark"
}

---- no_assignment_removes_the_key_tapkey_wrote stdout ----

thread 'no_assignment_removes_the_key_tapkey_wrote' (17542476) panicked at core/tests/switching.rs:155:5:
assertion failed: !user_settings(&machine).contains("ANTHROPIC_MODEL")

---- a_pin_carries_its_display_name stdout ----

thread 'a_pin_carries_its_display_name' (17542471) panicked at core/tests/switching.rs:134:5:
{}

failures:
    a_pin_carries_its_display_name
    a_switch_writes_the_endpoint_and_the_models_into_the_env_block
    no_assignment_removes_the_key_tapkey_wrote
    no_assignment_writes_an_empty_value_only_when_a_shell_export_exists
    the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present

test result: FAILED. 6 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
