*** core/src/adapters/claude.rs:334:5: replace clear -> Result<(), JsonError> with Ok(())

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace clear -> Result<(), JsonError> with Ok(())
@@ -326,19 +326,15 @@
 }
 
 /// Remove what tapkey wrote, and neutralise an inherited export if there is one.
 ///
 /// A settings file can set a variable and cannot unset one, so an export is overridden with an
 /// empty value — measured to work, and only when an export exists: writing `""` unconditionally
 /// would leave tapkey's fingerprints in a file it claims to have cleaned.
 fn clear(doc: &mut Document, env: &Env, var: &str) -> Result<(), JsonError> {
-    doc.remove(&["env", var])?;
-    if env.shell_var(var).is_some() {
-        doc.set_string(&["env", var], "")?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Every file a switch to this profile would touch, so a backup covers what changed.
 pub fn files_touched(env: &Env) -> Vec<PathBuf> {
     vec![env.home().join(".claude").join("settings.json")]
 }

---- no_assignment_removes_the_key_tapkey_wrote stdout ----

thread 'no_assignment_removes_the_key_tapkey_wrote' (17544082) panicked at core/tests/switching.rs:155:5:
assertion failed: !user_settings(&machine).contains("ANTHROPIC_MODEL")

---- no_assignment_writes_an_empty_value_only_when_a_shell_export_exists stdout ----

thread 'no_assignment_writes_an_empty_value_only_when_a_shell_export_exists' (17544083) panicked at core/tests/switching.rs:179:5:
{"env":{"ANTHROPIC_BASE_URL":"https://x.test"}}

failures:
    no_assignment_removes_the_key_tapkey_wrote
    no_assignment_writes_an_empty_value_only_when_a_shell_export_exists

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
