*** core/src/adapters/claude.rs:343:5: replace files_touched -> Vec<PathBuf> with vec![Default::default()]

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace files_touched -> Vec<PathBuf> with vec![Default::default()]
@@ -335,10 +335,10 @@
     if env.shell_var(var).is_some() {
         doc.set_string(&["env", var], "")?;
     }
     Ok(())
 }
 
 /// Every file a switch to this profile would touch, so a backup covers what changed.
 pub fn files_touched(env: &Env) -> Vec<PathBuf> {
-    vec![env.home().join(".claude").join("settings.json")]
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
