*** core/src/env.rs:106:9: replace Env::shell_var -> Option<&ShellVar> with None

*** mutation diff:
--- core/src/env.rs
+++ replace Env::shell_var -> Option<&ShellVar> with None
@@ -98,11 +98,11 @@
     }
 
     pub fn managed(&self) -> &Path {
         &self.managed
     }
 
     /// What the login shell exports under `name`, if anything.
     pub fn shell_var(&self, name: &str) -> Option<&ShellVar> {
-        self.shell.get(name)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_shell_export_wins_when_no_file_has_an_opinion stdout ----

thread 'a_shell_export_wins_when_no_file_has_an_opinion' (16533193) panicked at core/tests/effective_state.rs:119:5:
assertion `left == right` failed
  left: Null
 right: String("https://shell.test")

---- a_settings_file_beats_a_shell_export stdout ----

thread 'a_settings_file_beats_a_shell_export' (16533192) panicked at core/tests/effective_state.rs:104:5:
the export is shown, so somebody who typed it learns why they see another provider

failures:
    a_settings_file_beats_a_shell_export
    a_shell_export_wins_when_no_file_has_an_opinion

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
