*** core/src/env.rs:97:9: replace Env::project -> Option<&Path> with None

*** mutation diff:
--- core/src/env.rs
+++ replace Env::project -> Option<&Path> with None
@@ -89,17 +89,17 @@
     }
 
     #[allow(dead_code)]
     pub fn store(&self) -> &Path {
         &self.store
     }
 
     pub fn project(&self) -> Option<&Path> {
-        self.project.as_deref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn managed(&self) -> &Path {
         &self.managed
     }
 
     /// What the login shell exports under `name`, if anything.
     pub fn shell_var(&self, name: &str) -> Option<&ShellVar> {

---- project_local_outranks_the_shared_project_file stdout ----

thread 'project_local_outranks_the_shared_project_file' (16532674) panicked at core/tests/effective_state.rs:68:5:
assertion `left == right` failed
  left: Null
 right: String("https://local.test")

---- a_project_config_outranks_the_user_file_and_the_chain_names_both stdout ----

thread 'a_project_config_outranks_the_user_file_and_the_chain_names_both' (16532670) panicked at core/tests/effective_state.rs:47:5:
assertion `left == right` failed
  left: String("https://user.test")
 right: String("https://project.test")

failures:
    a_project_config_outranks_the_user_file_and_the_chain_names_both
    project_local_outranks_the_shared_project_file

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
