*** core/src/fingerprint.rs:20:11: replace ^= with &= in hash

*** mutation diff:
--- core/src/fingerprint.rs
+++ replace ^= with &= in hash
@@ -12,17 +12,17 @@
 
 /// FNV-1a, 64-bit. Not a cryptographic hash and not asked to be one: the question is whether a
 /// value changed, the comparison is against a value we wrote ourselves, and there is no
 /// adversary choosing inputs. It is deterministic across builds and platforms, which
 /// `DefaultHasher` does not promise, and that matters for something written to disk.
 pub fn hash(value: &str) -> String {
     let mut h: u64 = 0xcbf2_9ce4_8422_2325;
     for byte in value.as_bytes() {
-        h ^= *byte as u64;
+        h &= /* ~ changed by cargo-mutants ~ */ *byte as u64;
         h = h.wrapping_mul(0x0000_0100_0000_01b3);
     }
     format!("fnv1a64:{h:016x}")
 }
 
 /// What tapkey owns right now, and what it put there.
 #[derive(Debug, Default, Serialize, Deserialize)]
 pub struct State {

*** result: Success
