*** core/src/fs.rs:113:9: replace <impl FileSystem for FailOnce>::read -> io::Result<Option<Vec<u8>>> with Ok(Some(vec![0]))

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for FailOnce>::read -> io::Result<Option<Vec<u8>>> with Ok(Some(vec![0]))
@@ -105,15 +105,15 @@
         self.attempted.push(path.to_path_buf());
         if self.should_fail() {
             return Err(io::Error::other("injected removal failure"));
         }
         self.real.remove(path)
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
-        self.real.read(path)
+        Ok(Some(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
 
     fn mode(&self, path: &Path) -> Option<u32> {
         self.real.mode(path)
     }
 }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17027081) panicked at core/tests/transaction.rs:177:5:
assertion `left == right` failed
  left: [0]
 right: [111, 114, 105, 103, 105, 110, 97, 108, 32, 97]

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17027074) panicked at core/tests/transaction.rs:104:5:
assertion `left == right` failed
  left: [0]
 right: [111, 114, 105, 103, 105, 110, 97, 108, 32, 97]

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17027082) panicked at core/tests/transaction.rs:87:5:
it did not exist before, so it must not exist after

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
