*** core/src/fs.rs:117:9: replace <impl FileSystem for FailOnce>::mode -> Option<u32> with None

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for FailOnce>::mode -> Option<u32> with None
@@ -109,11 +109,11 @@
         self.real.remove(path)
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         self.real.read(path)
     }
 
     fn mode(&self, path: &Path) -> Option<u32> {
-        self.real.mode(path)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17028442) panicked at core/tests/transaction.rs:173:5:
assertion `left == right` failed: 0o600 here would be tapkey tightening a file it does not own
  left: 384
 right: 420

failures:
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
