*** core/src/fs.rs:117:9: replace <impl FileSystem for FailOnce>::mode -> Option<u32> with Some(0)

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for FailOnce>::mode -> Option<u32> with Some(0)
@@ -109,11 +109,11 @@
         self.real.remove(path)
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         self.real.read(path)
     }
 
     fn mode(&self, path: &Path) -> Option<u32> {
-        self.real.mode(path)
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17029128) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 13, kind: PermissionDenied, message: "Permission denied" }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17029135) panicked at core/tests/transaction.rs:173:5:
assertion `left == right` failed: 0o600 here would be tapkey tightening a file it does not own
  left: 0
 right: 420

failures:
    a_delete_is_undone_by_putting_the_file_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
