*** core/src/fs.rs:23:9: replace <impl FileSystem for RealFs>::write -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for RealFs>::write -> io::Result<()> with Ok(())
@@ -15,17 +15,17 @@
     fn mode(&self, path: &Path) -> Option<u32>;
 }
 
 /// The real one. Every write goes through the atomic seam.
 pub struct RealFs;
 
 impl FileSystem for RealFs {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
-        write_atomically(path, bytes, mode)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
         match std::fs::remove_file(path) {
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
             other => other,
         }
     }

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17000311) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17000318) panicked at core/tests/transaction.rs:172:38:
stat: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- every_write_lands_when_nothing_fails stdout ----

thread 'every_write_lands_when_nothing_fails' (17000316) panicked at core/tests/transaction.rs:30:5:
assertion `left == right` failed
  left: [111, 108, 100, 32, 97]
 right: [110, 101, 119, 32, 97]

failures:
    a_delete_is_undone_by_putting_the_file_back
    every_write_lands_when_nothing_fails
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
