*** core/src/fs.rs:28:23: replace match guard e.kind() == io::ErrorKind::NotFound with true in <impl FileSystem for RealFs>::remove

*** mutation diff:
--- core/src/fs.rs
+++ replace match guard e.kind() == io::ErrorKind::NotFound with true in <impl FileSystem for RealFs>::remove
@@ -20,17 +20,17 @@
 
 impl FileSystem for RealFs {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
         write_atomically(path, bytes, mode)
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
         match std::fs::remove_file(path) {
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
+            Err(e) if true /* ~ changed by cargo-mutants ~ */ => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),

*** result: Success
