*** core/src/fs.rs:34:9: replace <impl FileSystem for RealFs>::read -> io::Result<Option<Vec<u8>>> with Ok(None)

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for RealFs>::read -> io::Result<Option<Vec<u8>>> with Ok(None)
@@ -26,21 +26,17 @@
     fn remove(&mut self, path: &Path) -> io::Result<()> {
         match std::fs::remove_file(path) {
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
-        match std::fs::read(path) {
-            Ok(bytes) => Ok(Some(bytes)),
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),
-            Err(e) => Err(e),
-        }
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(unix)]
     fn mode(&self, path: &Path) -> Option<u32> {
         use std::os::unix::fs::PermissionsExt;
         std::fs::metadata(path)
             .ok()
             .map(|m| m.permissions().mode() & 0o7777)

---- a_read_that_fails_for_any_other_reason_is_still_an_error stdout ----

thread 'a_read_that_fails_for_any_other_reason_is_still_an_error' (17005490) panicked at core/tests/transaction.rs:186:5:
a directory is not an absent file

---- capturing_records_contents_and_absence_alike stdout ----

thread 'capturing_records_contents_and_absence_alike' (17005492) panicked at core/tests/transaction.rs:121:5:
assertion `left == right` failed
  left: None
 right: Some([111, 114, 105, 103, 105, 110, 97, 108, 32, 97])

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17005488) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    a_read_that_fails_for_any_other_reason_is_still_an_error
    capturing_records_contents_and_absence_alike
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
