*** core/src/fs.rs:36:23: replace match guard e.kind() == io::ErrorKind::NotFound with true in <impl FileSystem for RealFs>::read

*** mutation diff:
--- core/src/fs.rs
+++ replace match guard e.kind() == io::ErrorKind::NotFound with true in <impl FileSystem for RealFs>::read
@@ -28,17 +28,17 @@
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),
+            Err(e) if true /* ~ changed by cargo-mutants ~ */ => Ok(None),
             Err(e) => Err(e),
         }
     }
 
     #[cfg(unix)]
     fn mode(&self, path: &Path) -> Option<u32> {
         use std::os::unix::fs::PermissionsExt;
         std::fs::metadata(path)

---- a_read_that_fails_for_any_other_reason_is_still_an_error stdout ----

thread 'a_read_that_fails_for_any_other_reason_is_still_an_error' (17009391) panicked at core/tests/transaction.rs:186:5:
a directory is not an absent file

failures:
    a_read_that_fails_for_any_other_reason_is_still_an_error

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
