*** core/src/fs.rs:36:32: replace == with != in <impl FileSystem for RealFs>::read

*** mutation diff:
--- core/src/fs.rs
+++ replace == with != in <impl FileSystem for RealFs>::read
@@ -28,17 +28,17 @@
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),
+            Err(e) if e.kind() != /* ~ changed by cargo-mutants ~ */ io::ErrorKind::NotFound => Ok(None),
             Err(e) => Err(e),
         }
     }
 
     #[cfg(unix)]
     fn mode(&self, path: &Path) -> Option<u32> {
         use std::os::unix::fs::PermissionsExt;
         std::fs::metadata(path)

---- a_read_that_fails_for_any_other_reason_is_still_an_error stdout ----

thread 'a_read_that_fails_for_any_other_reason_is_still_an_error' (17011064) panicked at core/tests/transaction.rs:186:5:
a directory is not an absent file

---- capturing_records_contents_and_absence_alike stdout ----

thread 'capturing_records_contents_and_absence_alike' (17011066) panicked at core/tests/transaction.rs:118:10:
capture: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- every_write_lands_when_nothing_fails stdout ----

thread 'every_write_lands_when_nothing_fails' (17011067) panicked at core/tests/transaction.rs:28:10:
apply: RolledBack { failed_at: "", reason: "could not read the files to be changed: No such file or directory (os error 2)", restored: 0 }

failures:
    a_read_that_fails_for_any_other_reason_is_still_an_error
    capturing_records_contents_and_absence_alike
    every_write_lands_when_nothing_fails

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
