*** core/src/fs.rs:81:9: replace FailOnce::should_fail -> bool with false

*** mutation diff:
--- core/src/fs.rs
+++ replace FailOnce::should_fail -> bool with false
@@ -73,27 +73,17 @@
             real: RealFs,
             countdown: Some(successes),
             attempted: Vec::new(),
         }
     }
 
     /// True once the injected failure has been delivered, so nothing further is refused.
     fn should_fail(&mut self) -> bool {
-        match self.countdown {
-            Some(0) => {
-                self.countdown = None;
-                true
-            }
-            Some(n) => {
-                self.countdown = Some(n - 1);
-                false
-            }
-            None => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FileSystem for FailOnce {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
         self.attempted.push(path.to_path_buf());
         if self.should_fail() {
             return Err(io::Error::other("injected write failure"));

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17020689) panicked at core/tests/transaction.rs:102:10:
the second action fails: ()

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17020696) panicked at core/tests/transaction.rs:170:10:
the second action fails: ()

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17020697) panicked at core/tests/transaction.rs:85:10:
the second write fails: ()

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
