*** core/src/fs.rs:87:41: replace - with / in FailOnce::should_fail

*** mutation diff:
--- core/src/fs.rs
+++ replace - with / in FailOnce::should_fail
@@ -79,17 +79,17 @@
     /// True once the injected failure has been delivered, so nothing further is refused.
     fn should_fail(&mut self) -> bool {
         match self.countdown {
             Some(0) => {
                 self.countdown = None;
                 true
             }
             Some(n) => {
-                self.countdown = Some(n - 1);
+                self.countdown = Some(n / /* ~ changed by cargo-mutants ~ */ 1);
                 false
             }
             None => false,
         }
     }
 }
 
 impl FileSystem for FailOnce {

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17022939) panicked at core/tests/transaction.rs:170:10:
the second action fails: ()

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17022932) panicked at core/tests/transaction.rs:102:10:
the second action fails: ()

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17022940) panicked at core/tests/transaction.rs:85:10:
the second write fails: ()

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
