*** core/src/fs.rs:97:9: replace <impl FileSystem for FailOnce>::write -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for FailOnce>::write -> io::Result<()> with Ok(())
@@ -89,21 +89,17 @@
             }
             None => false,
         }
     }
 }
 
 impl FileSystem for FailOnce {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
-        self.attempted.push(path.to_path_buf());
-        if self.should_fail() {
-            return Err(io::Error::other("injected write failure"));
-        }
-        self.real.write(path, bytes, mode)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
         self.attempted.push(path.to_path_buf());
         if self.should_fail() {
             return Err(io::Error::other("injected removal failure"));
         }
         self.real.remove(path)

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17023336) panicked at core/tests/transaction.rs:85:10:
the second write fails: ()

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17023335) panicked at core/tests/transaction.rs:170:10:
the second action fails: ()

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17023328) panicked at core/tests/transaction.rs:102:10:
the second action fails: ()

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
