*** core/src/instant.rs:13:5: replace format_utc -> String with String::new()

*** mutation diff:
--- core/src/instant.rs
+++ replace format_utc -> String with String::new()
@@ -5,34 +5,17 @@
 //! and the history list use comes from the manifest, but a name that also sorts makes a
 //! directory listing legible, which is worth thirty lines of civil-calendar arithmetic rather
 //! than a dependency.
 
 use std::time::{SystemTime, UNIX_EPOCH};
 
 /// `YYYYMMDDTHHMMSS.mmmZ`, always UTC.
 pub fn format_utc(t: SystemTime) -> String {
-    let ms = t
-        .duration_since(UNIX_EPOCH)
-        .map(|d| d.as_millis())
-        .unwrap_or(0);
-    let total_seconds = (ms / 1000) as i64;
-    let millis = (ms % 1000) as u32;
-
-    // Clamped above, so the calendar never sees a day before the epoch.
-    let days = (total_seconds.div_euclid(86_400)) as u64;
-    let secs_of_day = total_seconds.rem_euclid(86_400);
-    let (year, month, day) = civil_from_days(days);
-
-    format!(
-        "{year:04}{month:02}{day:02}T{:02}{:02}{:02}.{millis:03}Z",
-        secs_of_day / 3600,
-        (secs_of_day % 3600) / 60,
-        secs_of_day % 60,
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Howard Hinnant's `civil_from_days`: days since 1970-01-01 to a calendar date, with the year
 /// shifted so that leap days land at the end of the era. Copied deliberately rather than
 /// improvised — month lengths and leap years are exactly where a hand-rolled version is wrong
 /// once every four years, and the wrong backup would then be the one evicted.
 ///
 /// The original handles days before the epoch; `format_utc` clamps there, so that branch would

---- the_epoch_itself_is_the_first_possible_name stdout ----

thread 'the_epoch_itself_is_the_first_possible_name' (16656910) panicked at core/tests/instants.rs:39:5:
assertion `left == right` failed
  left: ""
 right: "19700101T000000.000Z"

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16656908) panicked at core/tests/instants.rs:29:9:
assertion `left == right` failed: at 1787866640123 ms
  left: ""
 right: "20260827T213720.123Z"

---- names_sort_in_the_order_the_instants_happened stdout ----

thread 'names_sort_in_the_order_the_instants_happened' (16656909) panicked at core/tests/instants.rs:62:5:
["", "", "", ""]

failures:
    formats_known_instants_compactly_and_in_utc
    names_sort_in_the_order_the_instants_happened
    the_epoch_itself_is_the_first_possible_name

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
