*** core/src/instant.rs:18:22: replace % with / in format_utc

*** mutation diff:
--- core/src/instant.rs
+++ replace % with / in format_utc
@@ -10,17 +10,17 @@
 
 /// `YYYYMMDDTHHMMSS.mmmZ`, always UTC.
 pub fn format_utc(t: SystemTime) -> String {
     let ms = t
         .duration_since(UNIX_EPOCH)
         .map(|d| d.as_millis())
         .unwrap_or(0);
     let total_seconds = (ms / 1000) as i64;
-    let millis = (ms % 1000) as u32;
+    let millis = (ms / /* ~ changed by cargo-mutants ~ */ 1000) as u32;
 
     // Clamped above, so the calendar never sees a day before the epoch.
     let days = (total_seconds.div_euclid(86_400)) as u64;
     let secs_of_day = total_seconds.rem_euclid(86_400);
     let (year, month, day) = civil_from_days(days);
 
     format!(
         "{year:04}{month:02}{day:02}T{:02}{:02}{:02}.{millis:03}Z",

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16659909) panicked at core/tests/instants.rs:29:9:
assertion `left == right` failed: at 1787866640123 ms
  left: "20260827T213720.1787866640Z"
 right: "20260827T213720.123Z"

failures:
    formats_known_instants_compactly_and_in_utc

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
