*** core/src/json.rs:104:9: replace Document::to_bytes -> Vec<u8> with vec![1]

*** mutation diff:
--- core/src/json.rs
+++ replace Document::to_bytes -> Vec<u8> with vec![1]
@@ -96,28 +96,17 @@
             _ => Err(Error::NotAString {
                 path: path.join("."),
             }),
         }
     }
 
     /// The document's bytes with every pending splice applied.
     pub fn to_bytes(&self) -> Vec<u8> {
-        let mut ordered: Vec<&Splice> = self.splices.iter().collect();
-        ordered.sort_by_key(|s| s.range.start);
-
-        let mut out = Vec::with_capacity(self.original.len());
-        let mut cursor = 0usize;
-        for splice in ordered {
-            out.extend_from_slice(&self.original[cursor..splice.range.start]);
-            out.extend_from_slice(&splice.replacement);
-            cursor = splice.range.end;
-        }
-        out.extend_from_slice(&self.original[cursor..]);
-        out
+        vec![1] /* ~ changed by cargo-mutants ~ */
     }
 
     fn record(&mut self, range: Range<usize>, replacement: Vec<u8>) {
         // Setting the same place twice replaces the earlier intent rather than stacking on it.
         self.splices.retain(|s| s.range != range);
         self.splices.push(Splice { range, replacement });
     }
 }

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (16457713) panicked at core/tests/json_document.rs:51:31:
range end index 3 out of range for slice of length 1

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16457721) panicked at core/tests/json_document.rs:162:5:
assertion `left == right` failed
  left: "\u{1}"
 right: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \"light\"\n}"

---- a_path_that_is_not_there_is_reported_rather_than_created stdout ----

thread 'a_path_that_is_not_there_is_reported_rather_than_created' (16457718) panicked at core/tests/json_document.rs:201:5:
assertion `left == right` failed: and nothing moved
  left: [1]
 right: [123, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 5 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
