*** core/src/json.rs:111:34: replace == with != in Document::remove

*** mutation diff:
--- core/src/json.rs
+++ replace == with != in Document::remove
@@ -103,17 +103,17 @@
         let Some((parent, m)) = parent_and_member(&self.root, path) else {
             return Ok(());
         };
         let Node::Object { members, span } = parent else {
             return Ok(());
         };
         let index = members
             .iter()
-            .position(|x| x.span == m.span)
+            .position(|x| x.span != /* ~ changed by cargo-mutants ~ */ m.span)
             .expect("the member came from these members");
 
         let range = if members.len() == 1 {
             // The only member: take everything between the braces, leaving `{}` as authored.
             span.start + 1..span.end - 1
         } else if index + 1 < members.len() {
             // Not the last: swallow forward to the next member's start, comma included.
             m.span.start..members[index + 1].span.start

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17242172) panicked at core/tests/json_document.rs:332:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\"\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\"\n  }\n}\n"

---- removing_the_first_of_several_keys_takes_its_trailing_comma stdout ----

thread 'removing_the_first_of_several_keys_takes_its_trailing_comma' (17242182) panicked at core/tests/json_document.rs:353:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 34, 49, 34, 44, 34, 98, 34, 58, 34, 50, 34, 125]
 right: [123, 34, 98, 34, 58, 34, 50, 34, 125]

---- removing_the_only_key_leaves_an_empty_object stdout ----

thread 'removing_the_only_key_leaves_an_empty_object' (17242183) panicked at core/src/json.rs:112:14:
the member came from these members

failures:
    adding_then_removing_a_key_leaves_the_file_byte_identical
    removing_the_first_of_several_keys_takes_its_trailing_comma
    removing_the_only_key_leaves_an_empty_object

test result: FAILED. 28 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
