*** core/src/json.rs:116:38: replace - with + in Document::remove

*** mutation diff:
--- core/src/json.rs
+++ replace - with + in Document::remove
@@ -108,17 +108,17 @@
         };
         let index = members
             .iter()
             .position(|x| x.span == m.span)
             .expect("the member came from these members");
 
         let range = if members.len() == 1 {
             // The only member: take everything between the braces, leaving `{}` as authored.
-            span.start + 1..span.end - 1
+            span.start + 1..span.end + /* ~ changed by cargo-mutants ~ */ 1
         } else if index + 1 < members.len() {
             // Not the last: swallow forward to the next member's start, comma included.
             m.span.start..members[index + 1].span.start
         } else {
             // The last: swallow backwards to the previous member's end.
             members[index - 1].span.end..m.span.end
         };
         self.splice(range, b"")

---- removing_the_only_key_leaves_an_empty_object stdout ----

thread 'removing_the_only_key_leaves_an_empty_object' (17247293) panicked at core/tests/json_document.rs:342:31:
remove: Syntax { offset: 8, message: "a key or a closing brace was expected" }

failures:
    removing_the_only_key_leaves_an_empty_object

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
