*** core/src/json.rs:119:41: replace + with * in Document::remove

*** mutation diff:
--- core/src/json.rs
+++ replace + with * in Document::remove
@@ -111,17 +111,17 @@
             .position(|x| x.span == m.span)
             .expect("the member came from these members");
 
         let range = if members.len() == 1 {
             // The only member: take everything between the braces, leaving `{}` as authored.
             span.start + 1..span.end - 1
         } else if index + 1 < members.len() {
             // Not the last: swallow forward to the next member's start, comma included.
-            m.span.start..members[index + 1].span.start
+            m.span.start..members[index * /* ~ changed by cargo-mutants ~ */ 1].span.start
         } else {
             // The last: swallow backwards to the previous member's end.
             members[index - 1].span.end..m.span.end
         };
         self.splice(range, b"")
     }
 
     /// The document's current bytes.

---- removing_the_first_of_several_keys_takes_its_trailing_comma stdout ----

thread 'removing_the_first_of_several_keys_takes_its_trailing_comma' (17254701) panicked at core/tests/json_document.rs:353:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 34, 49, 34, 44, 34, 98, 34, 58, 34, 50, 34, 125]
 right: [123, 34, 98, 34, 58, 34, 50, 34, 125]

failures:
    removing_the_first_of_several_keys_takes_its_trailing_comma

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
