*** core/src/json.rs:120:9: replace Document::record with ()

*** mutation diff:
--- core/src/json.rs
+++ replace Document::record with ()
@@ -112,18 +112,17 @@
             cursor = splice.range.end;
         }
         out.extend_from_slice(&self.original[cursor..]);
         out
     }
 
     fn record(&mut self, range: Range<usize>, replacement: Vec<u8>) {
         // Setting the same place twice replaces the earlier intent rather than stacking on it.
-        self.splices.retain(|s| s.range != range);
-        self.splices.push(Splice { range, replacement });
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn resolve<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Node> {
     let Some((head, rest)) = path.split_first() else {
         return Some(node);
     };
     let Node::Object { members, .. } = node else {

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16458135) panicked at core/tests/json_document.rs:183:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 34, 120, 34, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16458142) panicked at core/tests/json_document.rs:162:5:
assertion `left == right` failed
  left: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \"dark\"\n}"
 right: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \"light\"\n}"

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16458137) panicked at core/tests/json_document.rs:79:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 97, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 98, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

failures:
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    strings_holding_escapes_survive_untouched

test result: FAILED. 8 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
