*** core/src/json.rs:122:27: replace - with + in Document::remove

*** mutation diff:
--- core/src/json.rs
+++ replace - with + in Document::remove
@@ -114,17 +114,17 @@
         let range = if members.len() == 1 {
             // The only member: take everything between the braces, leaving `{}` as authored.
             span.start + 1..span.end - 1
         } else if index + 1 < members.len() {
             // Not the last: swallow forward to the next member's start, comma included.
             m.span.start..members[index + 1].span.start
         } else {
             // The last: swallow backwards to the previous member's end.
-            members[index - 1].span.end..m.span.end
+            members[index + /* ~ changed by cargo-mutants ~ */ 1].span.end..m.span.end
         };
         self.splice(range, b"")
     }
 
     /// The document's current bytes.
     pub fn to_bytes(&self) -> Vec<u8> {
         self.bytes.clone()
     }

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17256211) panicked at core/src/json.rs:122:20:
index out of bounds: the len is 2 but the index is 2

failures:
    adding_then_removing_a_key_leaves_the_file_byte_identical

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
