*** core/src/json.rs:129:9: replace Document::to_bytes -> Vec<u8> with vec![]

*** mutation diff:
--- core/src/json.rs
+++ replace Document::to_bytes -> Vec<u8> with vec![]
@@ -121,17 +121,17 @@
             // The last: swallow backwards to the previous member's end.
             members[index - 1].span.end..m.span.end
         };
         self.splice(range, b"")
     }
 
     /// The document's current bytes.
     pub fn to_bytes(&self) -> Vec<u8> {
-        self.bytes.clone()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn splice(&mut self, range: Range<usize>, replacement: &[u8]) -> Result<(), Error> {
         let mut next = Vec::with_capacity(self.bytes.len() + replacement.len());
         next.extend_from_slice(&self.bytes[..range.start]);
         next.extend_from_slice(replacement);
         next.extend_from_slice(&self.bytes[range.end..]);
         self.root = parse_root(&next)?;

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17258470) panicked at core/tests/json_document.rs:210:5:
assertion `left == right` failed
  left: []
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17258476) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
  left: ""
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (17258469) panicked at core/tests/json_document.rs:55:24:
range end index 3 out of range for slice of length 0

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key
    arrays_are_preserved_including_nested_ones

test result: FAILED. 7 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
