*** core/src/json.rs:129:9: replace Document::to_bytes -> Vec<u8> with vec![1]

*** mutation diff:
--- core/src/json.rs
+++ replace Document::to_bytes -> Vec<u8> with vec![1]
@@ -121,17 +121,17 @@
             // The last: swallow backwards to the previous member's end.
             members[index - 1].span.end..m.span.end
         };
         self.splice(range, b"")
     }
 
     /// The document's current bytes.
     pub fn to_bytes(&self) -> Vec<u8> {
-        self.bytes.clone()
+        vec![1] /* ~ changed by cargo-mutants ~ */
     }
 
     fn splice(&mut self, range: Range<usize>, replacement: &[u8]) -> Result<(), Error> {
         let mut next = Vec::with_capacity(self.bytes.len() + replacement.len());
         next.extend_from_slice(&self.bytes[..range.start]);
         next.extend_from_slice(replacement);
         next.extend_from_slice(&self.bytes[range.end..]);
         self.root = parse_root(&next)?;

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17258947) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "\u{1}"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17258948) panicked at core/tests/json_document.rs:287:5:
assertion `left == right` failed
  left: [1]
 right: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 32, 34, 98, 34, 58, 32, 34, 50, 34, 125]

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (17258949) panicked at core/tests/json_document.rs:91:5:
assertion `left == right` failed
  left: [1]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 98, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key
    arrays_are_preserved_including_nested_ones

test result: FAILED. 7 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
