*** core/src/json.rs:132:48: replace == with != in resolve

*** mutation diff:
--- core/src/json.rs
+++ replace == with != in resolve
@@ -124,17 +124,17 @@
 
 fn resolve<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Node> {
     let Some((head, rest)) = path.split_first() else {
         return Some(node);
     };
     let Node::Object { members, .. } = node else {
         return None;
     };
-    let member = members.iter().find(|m| m.key == *head)?;
+    let member = members.iter().find(|m| m.key != /* ~ changed by cargo-mutants ~ */ *head)?;
     resolve(&member.value, rest)
 }
 
 /// Only what the format requires: a value tapkey writes must not arrive in the file more
 /// escaped than the user's own values are.
 fn encode_string(value: &str) -> Vec<u8> {
     let mut out = Vec::with_capacity(value.len() + 2);
     out.push(b'"');

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (16459183) panicked at core/tests/json_document.rs:49:41:
set: Missing { path: "theme" }

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16459191) panicked at core/tests/json_document.rs:159:41:
set: NotAString { path: "theme" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16459186) panicked at core/tests/json_document.rs:77:54:
set: Missing { path: "env.ANTHROPIC_MODEL" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 5 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
