*** core/src/json.rs:148:18: replace match guard (c as u32) < 0x20 with true in encode_string

*** mutation diff:
--- core/src/json.rs
+++ replace match guard (c as u32) < 0x20 with true in encode_string
@@ -140,17 +140,17 @@
     out.push(b'"');
     for ch in value.chars() {
         match ch {
             '"' => out.extend_from_slice(b"\\\""),
             '\\' => out.extend_from_slice(b"\\\\"),
             '\n' => out.extend_from_slice(b"\\n"),
             '\r' => out.extend_from_slice(b"\\r"),
             '\t' => out.extend_from_slice(b"\\t"),
-            c if (c as u32) < 0x20 => {
+            c if true /* ~ changed by cargo-mutants ~ */ => {
                 out.extend_from_slice(format!("\\u{:04x}", c as u32).as_bytes())
             }
             c => {
                 let mut buf = [0u8; 4];
                 out.extend_from_slice(c.encode_utf8(&mut buf).as_bytes())
             }
         }
     }

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16460628) panicked at core/tests/json_document.rs:146:5:
assertion `left == right` failed
  left: [123, 34, 116, 114, 105, 99, 107, 121, 34, 58, 34, 125, 32, 44, 32, 123, 32, 92, 34, 32, 93, 34, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 92, 117, 48, 48, 54, 99, 92, 117, 48, 48, 54, 57, 92, 117, 48, 48, 54, 55, 92, 117, 48, 48, 54, 56, 92, 117, 48, 48, 55, 52, 34, 125]
 right: [123, 34, 116, 114, 105, 99, 107, 121, 34, 58, 34, 125, 32, 44, 32, 123, 32, 92, 34, 32, 93, 34, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 108, 105, 103, 104, 116, 34, 125]

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16460622) panicked at core/tests/json_document.rs:79:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 92, 117, 48, 48, 54, 50, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 98, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16460627) panicked at core/tests/json_document.rs:162:5:
assertion `left == right` failed
  left: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \"\\u006c\\u0069\\u0067\\u0068\\u0074\"\n}"
 right: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \"light\"\n}"

failures:
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    strings_holding_escapes_survive_untouched

test result: FAILED. 8 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
