*** core/src/json.rs:152:21: replace < with > in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace < with > in Document::plan_set
@@ -144,17 +144,17 @@
         // The whole path is already there: replace the value in place.
         if let Some(existing) = member(&self.root, path) {
             return Ok((existing.value.span(), encode_string(value)));
         }
 
         // Walk as far as the file goes, then build what is missing as one nested literal.
         let mut node = &self.root;
         let mut depth = 0;
-        while depth < path.len() {
+        while depth > /* ~ changed by cargo-mutants ~ */ path.len() {
             let Node::Object { members, .. } = node else {
                 return Err(Error::NotAnObject {
                     path: path[..depth].join("."),
                 });
             };
             match members.iter().find(|m| m.key == path[depth]) {
                 Some(m) => {
                     node = &m.value;

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17263775) panicked at core/tests/json_document.rs:273:40:
set: DuplicateKey { offset: 32, key: "env" }

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17263778) panicked at core/tests/json_document.rs:261:40:
set: DuplicateKey { offset: 47, key: "env" }

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17263780) panicked at core/tests/json_document.rs:325:44:
set: DuplicateKey { offset: 33, key: "env" }

failures:
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 27 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
