*** core/src/json.rs:152:21: replace < with <= in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace < with <= in Document::plan_set
@@ -144,17 +144,17 @@
         // The whole path is already there: replace the value in place.
         if let Some(existing) = member(&self.root, path) {
             return Ok((existing.value.span(), encode_string(value)));
         }
 
         // Walk as far as the file goes, then build what is missing as one nested literal.
         let mut node = &self.root;
         let mut depth = 0;
-        while depth < path.len() {
+        while depth <= /* ~ changed by cargo-mutants ~ */ path.len() {
             let Node::Object { members, .. } = node else {
                 return Err(Error::NotAnObject {
                     path: path[..depth].join("."),
                 });
             };
             match members.iter().find(|m| m.key == path[depth]) {
                 Some(m) => {
                     node = &m.value;

*** result: Success
