*** core/src/json.rs:158:49: replace == with != in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace == with != in Document::plan_set
@@ -150,17 +150,17 @@
         let mut node = &self.root;
         let mut depth = 0;
         while depth < path.len() {
             let Node::Object { members, .. } = node else {
                 return Err(Error::NotAnObject {
                     path: path[..depth].join("."),
                 });
             };
-            match members.iter().find(|m| m.key == path[depth]) {
+            match members.iter().find(|m| m.key != /* ~ changed by cargo-mutants ~ */ path[depth]) {
                 Some(m) => {
                     node = &m.value;
                     depth += 1;
                 }
                 None => break,
             }
         }
         let Node::Object { members, span } = node else {

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17264787) panicked at core/tests/json_document.rs:310:10:
set: NotAnObject { path: "env" }

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17264784) panicked at core/tests/json_document.rs:285:33:
set: NotAnObject { path: "b" }

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17264786) panicked at core/tests/json_document.rs:273:40:
set: NotAnObject { path: "env" }

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 23 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
