*** core/src/json.rs:161:27: replace += with -= in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Document::plan_set
@@ -153,17 +153,17 @@
             let Node::Object { members, .. } = node else {
                 return Err(Error::NotAnObject {
                     path: path[..depth].join("."),
                 });
             };
             match members.iter().find(|m| m.key == path[depth]) {
                 Some(m) => {
                     node = &m.value;
-                    depth += 1;
+                    depth -= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 None => break,
             }
         }
         let Node::Object { members, span } = node else {
             return Err(Error::NotAnObject {
                 path: path[..depth].join("."),
             });

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17266738) panicked at core/src/json.rs:161:21:
attempt to subtract with overflow

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17266735) panicked at core/src/json.rs:161:21:
attempt to subtract with overflow

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17266740) panicked at core/src/json.rs:161:21:
attempt to subtract with overflow

failures:
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key
    setting_a_key_whose_parent_is_not_an_object_is_refused

test result: FAILED. 26 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
