*** core/src/json.rs:161:27: replace += with *= in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Document::plan_set
@@ -153,17 +153,17 @@
             let Node::Object { members, .. } = node else {
                 return Err(Error::NotAnObject {
                     path: path[..depth].join("."),
                 });
             };
             match members.iter().find(|m| m.key == path[depth]) {
                 Some(m) => {
                     node = &m.value;
-                    depth += 1;
+                    depth *= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 None => break,
             }
         }
         let Node::Object { members, span } = node else {
             return Err(Error::NotAnObject {
                 path: path[..depth].join("."),
             });

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17267704) panicked at core/tests/json_document.rs:263:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\",\n    \"env\": {\n      \"C\": \"3\"\n    }\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\",\n    \"C\": \"3\"\n  }\n}\n"

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17267701) panicked at core/tests/json_document.rs:275:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 44, 34, 101, 110, 118, 34, 58, 123, 34, 66, 34, 58, 34, 50, 34, 125, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 44, 34, 66, 34, 58, 34, 50, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17267706) panicked at core/tests/json_document.rs:332:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"env\": {\n      \"B\": \"2\"\n    }\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\"\n  }\n}\n"

failures:
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 27 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
