*** core/src/json.rs:176:20: replace += with *= in Parser<'a>::skip_whitespace

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::skip_whitespace
@@ -168,17 +168,17 @@
         Error::Syntax {
             offset: self.i,
             message: message.to_string(),
         }
     }
 
     fn skip_whitespace(&mut self) {
         while matches!(self.b.get(self.i), Some(b' ' | b'\t' | b'\n' | b'\r')) {
-            self.i += 1;
+            self.i *= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
 
     fn value(&mut self) -> Result<Node, Error> {
         match self.b.get(self.i) {
             Some(b'{') => self.object(),
             Some(b'[') => self.array(),
             Some(b'"') => {

*** result: Timeout
