*** core/src/json.rs:220:25: replace match guard !opening.is_empty() with true in Style::of

*** mutation diff:
--- core/src/json.rs
+++ replace match guard !opening.is_empty() with true in Style::of
@@ -212,17 +212,17 @@
         if let Some(first) = members.first() {
             let colon = text(first.key_span.end..first.value.span().start);
             let opening = text(span.start + 1..first.span.start);
             // Two members show exactly what goes between them; one member can only be
             // inferred from. A file that writes `"a": 1` would write `, "b": 2`, and a
             // minified one would not.
             let lead = match members.get(1) {
                 Some(second) => text(first.span.end + 1..second.span.start),
-                None if !opening.is_empty() => opening.clone(),
+                None if true /* ~ changed by cargo-mutants ~ */ => opening.clone(),
                 None if colon.ends_with(' ') => " ".to_string(),
                 None => String::new(),
             };
             return Style {
                 lead,
                 colon,
                 // Only an object with no members needs a closing lead; this one has some.
                 close: String::new(),

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17273750) panicked at core/tests/json_document.rs:287:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 34, 98, 34, 58, 32, 34, 50, 34, 125]
 right: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 32, 34, 98, 34, 58, 32, 34, 50, 34, 125]

failures:
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
