*** core/src/json.rs:220:25: replace match guard !opening.is_empty() with false in Style::of

*** mutation diff:
--- core/src/json.rs
+++ replace match guard !opening.is_empty() with false in Style::of
@@ -212,17 +212,17 @@
         if let Some(first) = members.first() {
             let colon = text(first.key_span.end..first.value.span().start);
             let opening = text(span.start + 1..first.span.start);
             // Two members show exactly what goes between them; one member can only be
             // inferred from. A file that writes `"a": 1` would write `, "b": 2`, and a
             // minified one would not.
             let lead = match members.get(1) {
                 Some(second) => text(first.span.end + 1..second.span.start),
-                None if !opening.is_empty() => opening.clone(),
+                None if false /* ~ changed by cargo-mutants ~ */ => opening.clone(),
                 None if colon.ends_with(' ') => " ".to_string(),
                 None => String::new(),
             };
             return Style {
                 lead,
                 colon,
                 // Only an object with no members needs a closing lead; this one has some.
                 close: String::new(),

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17274696) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\", \"env\": { \"A\": \"1\" }\n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17274700) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
  left: "{\n  \"theme\": \"dark\", \"env\": { \"ANTHROPIC_BASE_URL\": \"https://x.test\" }\n}\n"
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

---- a_tab_indented_file_gets_tab_indented_insertions stdout ----

thread 'a_tab_indented_file_gets_tab_indented_insertions' (17274703) panicked at core/tests/json_document.rs:385:5:
assertion `left == right` failed
  left: "{\n\t\"theme\": \"dark\", \"env\": { \"A\": \"1\" }\n}\n"
 right: "{\n\t\"theme\": \"dark\",\n\t\"env\": {\n\t\t\"A\": \"1\"\n\t}\n}\n"

failures:
    a_four_space_file_gets_four_space_insertions
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_tab_indented_file_gets_tab_indented_insertions

test result: FAILED. 28 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
