*** core/src/json.rs:220:25: delete ! in Style::of

*** mutation diff:
--- core/src/json.rs
+++ delete ! in Style::of
@@ -212,17 +212,17 @@
         if let Some(first) = members.first() {
             let colon = text(first.key_span.end..first.value.span().start);
             let opening = text(span.start + 1..first.span.start);
             // Two members show exactly what goes between them; one member can only be
             // inferred from. A file that writes `"a": 1` would write `, "b": 2`, and a
             // minified one would not.
             let lead = match members.get(1) {
                 Some(second) => text(first.span.end + 1..second.span.start),
-                None if !opening.is_empty() => opening.clone(),
+                None if  /* ~ changed by cargo-mutants ~ */opening.is_empty() => opening.clone(),
                 None if colon.ends_with(' ') => " ".to_string(),
                 None => String::new(),
             };
             return Style {
                 lead,
                 colon,
                 // Only an object with no members needs a closing lead; this one has some.
                 close: String::new(),

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17279021) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\", \"env\": { \"A\": \"1\" }\n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17279022) panicked at core/tests/json_document.rs:287:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 34, 98, 34, 58, 32, 34, 50, 34, 125]
 right: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 32, 34, 98, 34, 58, 32, 34, 50, 34, 125]

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17279025) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
  left: "{\n  \"theme\": \"dark\", \"env\": { \"ANTHROPIC_BASE_URL\": \"https://x.test\" }\n}\n"
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_tab_indented_file_gets_tab_indented_insertions

test result: FAILED. 27 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
