*** core/src/json.rs:226:35: replace != with == in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ replace != with == in Parser<'a>::object
@@ -218,17 +218,17 @@
                 Some(b'"') => {}
                 _ => return Err(self.error("a key or a closing brace was expected")),
             }
             let key_start = self.i;
             let key = self.string()?;
             let key_span = key_start..self.i;
 
             self.skip_whitespace();
-            if self.b.get(self.i) != Some(&b':') {
+            if self.b.get(self.i) == /* ~ changed by cargo-mutants ~ */ Some(&b':') {
                 return Err(self.error("a colon was expected after a key"));
             }
             self.i += 1;
             self.skip_whitespace();
 
             if let Some(previous) = members.iter().find(|m: &&Member| m.key == key) {
                 let _ = previous;
                 return Err(Error::DuplicateKey {

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (16465575) panicked at core/tests/json_document.rs:47:44:
parse: Syntax { offset: 11, message: "a colon was expected after a key" }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16465576) panicked at core/tests/json_document.rs:179:55:
parse: Syntax { offset: 7, message: "a colon was expected after a key" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16465578) panicked at core/tests/json_document.rs:75:89:
parse: Syntax { offset: 6, message: "a colon was expected after a key" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
