*** core/src/json.rs:229:20: replace += with *= in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::object
@@ -221,17 +221,17 @@
             let key_start = self.i;
             let key = self.string()?;
             let key_span = key_start..self.i;
 
             self.skip_whitespace();
             if self.b.get(self.i) != Some(&b':') {
                 return Err(self.error("a colon was expected after a key"));
             }
-            self.i += 1;
+            self.i *= /* ~ changed by cargo-mutants ~ */ 1;
             self.skip_whitespace();
 
             if let Some(previous) = members.iter().find(|m: &&Member| m.key == key) {
                 let _ = previous;
                 return Err(Error::DuplicateKey {
                     offset: key_start,
                     key,
                 });

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16466309) panicked at core/tests/json_document.rs:179:55:
parse: Syntax { offset: 7, message: "\":\\\"x\\\"\" is not a JSON value" }

---- a_missing_trailing_newline_is_not_added stdout ----

thread 'a_missing_trailing_newline_is_not_added' (16466312) panicked at core/tests/json_document.rs:66:61:
parse: Syntax { offset: 8, message: "\":\" is not a JSON value" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16466311) panicked at core/tests/json_document.rs:75:89:
parse: Syntax { offset: 6, message: "\":{\\\"ANTHROPIC_MODEL\\\":\\\"a\\\"\" is not a JSON value" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
