*** core/src/json.rs:232:77: replace == with != in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ replace == with != in Parser<'a>::object
@@ -224,17 +224,17 @@
 
             self.skip_whitespace();
             if self.b.get(self.i) != Some(&b':') {
                 return Err(self.error("a colon was expected after a key"));
             }
             self.i += 1;
             self.skip_whitespace();
 
-            if let Some(previous) = members.iter().find(|m: &&Member| m.key == key) {
+            if let Some(previous) = members.iter().find(|m: &&Member| m.key != /* ~ changed by cargo-mutants ~ */ key) {
                 let _ = previous;
                 return Err(Error::DuplicateKey {
                     offset: key_start,
                     key,
                 });
             }
 
             let value = self.value()?;

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16466673) panicked at core/tests/json_document.rs:75:89:
parse: DuplicateKey { offset: 31, key: "theme" }

---- a_duplicate_key_is_refused stdout ----

thread 'a_duplicate_key_is_refused' (16466672) panicked at core/tests/json_document.rs:120:5:
we cannot know which one the tool reads

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16466679) panicked at core/tests/json_document.rs:142:43:
parse: DuplicateKey { offset: 23, key: "theme" }

failures:
    a_duplicate_key_is_refused
    a_minified_file_stays_minified
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    setting_the_same_value_twice_is_byte_identical
    strings_holding_escapes_survive_untouched

test result: FAILED. 11 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
