*** core/src/json.rs:249:38: replace += with -= in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Parser<'a>::object
@@ -241,17 +241,17 @@
             members.push(Member {
                 key,
                 key_span,
                 value,
             });
 
             self.skip_whitespace();
             match self.b.get(self.i) {
-                Some(b',') => self.i += 1,
+                Some(b',') => self.i -= /* ~ changed by cargo-mutants ~ */ 1,
                 Some(b'}') => {}
                 _ => return Err(self.error("a comma or a closing brace was expected")),
             }
         }
     }
 
     fn array(&mut self) -> Result<Node, Error> {
         let start = self.i;

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16468142) panicked at core/tests/json_document.rs:157:43:
parse: Syntax { offset: 72, message: "a colon was expected after a key" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16468137) panicked at core/tests/json_document.rs:75:89:
parse: Syntax { offset: 30, message: "trailing content after the top-level value" }

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16468143) panicked at core/tests/json_document.rs:142:43:
parse: Syntax { offset: 24, message: "a colon was expected after a key" }

failures:
    a_minified_file_stays_minified
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    setting_the_same_value_twice_is_byte_identical
    strings_holding_escapes_survive_untouched

test result: FAILED. 12 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
