*** core/src/json.rs:258:16: replace += with *= in Parser<'a>::array

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::array
@@ -250,17 +250,17 @@
                 Some(b'}') => {}
                 _ => return Err(self.error("a comma or a closing brace was expected")),
             }
         }
     }
 
     fn array(&mut self) -> Result<Node, Error> {
         let start = self.i;
-        self.i += 1; // '['
+        self.i *= /* ~ changed by cargo-mutants ~ */ 1; // '['
         loop {
             self.skip_whitespace();
             match self.b.get(self.i) {
                 Some(b']') => {
                     self.i += 1;
                     return Ok(Node::Opaque {
                         span: start..self.i,
                         is_string: false,

*** result: Failure(101)
