*** core/src/json.rs:275:38: replace += with *= in Parser<'a>::array

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::array
@@ -267,17 +267,17 @@
                     });
                 }
                 None => return Err(self.error("an unterminated array")),
                 _ => {}
             }
             self.value()?;
             self.skip_whitespace();
             match self.b.get(self.i) {
-                Some(b',') => self.i += 1,
+                Some(b',') => self.i *= /* ~ changed by cargo-mutants ~ */ 1,
                 Some(b']') => {}
                 _ => return Err(self.error("a comma or a closing bracket was expected")),
             }
         }
     }
 
     fn string(&mut self) -> Result<String, Error> {
         if self.b.get(self.i) != Some(&b'"') {

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16471797) panicked at core/tests/json_document.rs:157:43:
parse: Syntax { offset: 43, message: "a value was expected" }

failures:
    arrays_are_preserved_including_nested_ones

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
