*** core/src/json.rs:283:31: replace != with == in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace != with == in Parser<'a>::string
@@ -275,17 +275,17 @@
                 Some(b',') => self.i += 1,
                 Some(b']') => {}
                 _ => return Err(self.error("a comma or a closing bracket was expected")),
             }
         }
     }
 
     fn string(&mut self) -> Result<String, Error> {
-        if self.b.get(self.i) != Some(&b'"') {
+        if self.b.get(self.i) == /* ~ changed by cargo-mutants ~ */ Some(&b'"') {
             return Err(self.error("a string was expected"));
         }
         self.i += 1;
         let mut out = String::new();
         loop {
             match self.b.get(self.i) {
                 None => return Err(self.error("an unterminated string")),
                 Some(b'"') => {

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16472915) panicked at core/tests/json_document.rs:142:43:
parse: Syntax { offset: 1, message: "a string was expected" }

---- a_path_that_is_not_there_is_reported_rather_than_created stdout ----

thread 'a_path_that_is_not_there_is_reported_rather_than_created' (16472911) panicked at core/tests/json_document.rs:198:59:
parse: Syntax { offset: 1, message: "a string was expected" }

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (16472906) panicked at core/tests/json_document.rs:47:44:
parse: Syntax { offset: 4, message: "a string was expected" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
