*** core/src/json.rs:290:20: replace + with - in indentation_before

*** mutation diff:
--- core/src/json.rs
+++ replace + with - in indentation_before
@@ -282,17 +282,17 @@
     }
 }
 
 /// The whitespace run immediately before `offset`, back to the start of its line.
 fn indentation_before(bytes: &[u8], offset: usize) -> String {
     let line_start = bytes[..offset]
         .iter()
         .rposition(|b| *b == b'\n')
-        .map(|i| i + 1)
+        .map(|i| i - /* ~ changed by cargo-mutants ~ */ 1)
         .unwrap_or(0);
     let indent: Vec<u8> = bytes[line_start..offset]
         .iter()
         .take_while(|b| **b == b' ' || **b == b'\t')
         .copied()
         .collect();
     String::from_utf8_lossy(&indent).into_owned()
 }

---- an_empty_object_receives_its_first_key stdout ----

thread 'an_empty_object_receives_its_first_key' (17287503) panicked at core/tests/json_document.rs:296:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n  \"A\": \"1\"\n}\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\"\n  }\n}\n"

failures:
    an_empty_object_receives_its_first_key

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
