*** core/src/json.rs:305:25: delete match arm b'n' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b'n' in Parser<'a>::string
@@ -297,17 +297,17 @@
                     let escaped = *self.b.get(self.i).ok_or_else(|| self.error("a truncated escape"))?;
                     self.i += 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
-                        b'n' => out.push('\n'),
+                         /* ~ changed by cargo-mutants ~ */
                         b'r' => out.push('\r'),
                         b't' => out.push('\t'),
                         b'u' => {
                             let hex = self
                                 .b
                                 .get(self.i..self.i + 4)
                                 .ok_or_else(|| self.error("a truncated \\u escape"))?;
                             let code = u32::from_str_radix(

*** result: Success
