*** core/src/json.rs:306:25: delete match arm b'r' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b'r' in Parser<'a>::string
@@ -298,17 +298,17 @@
                     self.i += 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
-                        b'r' => out.push('\r'),
+                         /* ~ changed by cargo-mutants ~ */
                         b't' => out.push('\t'),
                         b'u' => {
                             let hex = self
                                 .b
                                 .get(self.i..self.i + 4)
                                 .ok_or_else(|| self.error("a truncated \\u escape"))?;
                             let code = u32::from_str_radix(
                                 std::str::from_utf8(hex).map_err(|_| self.error("a bad \\u escape"))?,

*** result: Success
