*** core/src/json.rs:308:25: delete match arm b'u' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b'u' in Parser<'a>::string
@@ -300,31 +300,17 @@
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),
                         b't' => out.push('\t'),
-                        b'u' => {
-                            let hex = self
-                                .b
-                                .get(self.i..self.i + 4)
-                                .ok_or_else(|| self.error("a truncated \\u escape"))?;
-                            let code = u32::from_str_radix(
-                                std::str::from_utf8(hex).map_err(|_| self.error("a bad \\u escape"))?,
-                                16,
-                            )
-                            .map_err(|_| self.error("a bad \\u escape"))?;
-                            self.i += 4;
-                            // A lone surrogate is kept as the replacement character: the key it
-                            // names still matches, and tapkey never writes this value back.
-                            out.push(char::from_u32(code).unwrap_or('\u{FFFD}'));
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         _ => return Err(self.error("an unknown escape")),
                     }
                 }
                 Some(&byte) => {
                     let start = self.i;
                     while matches!(self.b.get(self.i), Some(&c) if c != b'"' && c != b'\\') {
                         self.i += 1;
                     }

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (16479054) panicked at core/tests/json_document.rs:129:43:
parse: Syntax { offset: 61, message: "an unknown escape" }

failures:
    strings_holding_escapes_survive_untouched

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
