*** core/src/json.rs:329:32: replace += with -= in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Parser<'a>::string
@@ -321,17 +321,17 @@
                             out.push(char::from_u32(code).unwrap_or('\u{FFFD}'));
                         }
                         _ => return Err(self.error("an unknown escape")),
                     }
                 }
                 Some(&byte) => {
                     let start = self.i;
                     while matches!(self.b.get(self.i), Some(&c) if c != b'"' && c != b'\\') {
-                        self.i += 1;
+                        self.i -= /* ~ changed by cargo-mutants ~ */ 1;
                     }
                     let raw = &self.b[start..self.i];
                     out.push_str(std::str::from_utf8(raw).map_err(|_| Error::Syntax {
                         offset: start,
                         message: "a string holds bytes that are not UTF-8".to_string(),
                     })?);
                     let _ = byte;
                 }

---- a_missing_trailing_newline_is_not_added stdout ----

thread 'a_missing_trailing_newline_is_not_added' (16480833) panicked at core/src/json.rs:331:38:
slice index starts at 2 but ends at 1

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16480832) panicked at core/src/json.rs:331:38:
slice index starts at 2 but ends at 1

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16480837) panicked at core/src/json.rs:331:38:
slice index starts at 5 but ends at 4

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_duplicate_key_is_refused
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    an_array_missing_its_separator_is_a_syntax_error
    an_unterminated_array_is_a_syntax_error
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped

test result: FAILED. 1 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
