*** core/src/json.rs:348:20: replace += with -= in Parser<'a>::scalar

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Parser<'a>::scalar
@@ -340,17 +340,17 @@
     }
 
     fn scalar(&mut self) -> Result<(), Error> {
         let start = self.i;
         while matches!(
             self.b.get(self.i),
             Some(c) if !matches!(c, b',' | b'}' | b']' | b' ' | b'\t' | b'\n' | b'\r')
         ) {
-            self.i += 1;
+            self.i -= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if self.i == start {
             return Err(self.error("a value was expected"));
         }
         match &self.b[start..self.i] {
             b"true" | b"false" | b"null" => Ok(()),
             other => {
                 let text = std::str::from_utf8(other).map_err(|_| Error::Syntax {

---- an_unterminated_array_is_a_syntax_error stdout ----

thread 'an_unterminated_array_is_a_syntax_error' (16481725) panicked at core/src/json.rs:348:13:
attempt to subtract with overflow

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16481726) panicked at core/src/json.rs:353:22:
slice index starts at 81 but ends at 79

---- an_array_missing_its_separator_is_a_syntax_error stdout ----

thread 'an_array_missing_its_separator_is_a_syntax_error' (16481724) panicked at core/src/json.rs:348:13:
attempt to subtract with overflow

failures:
    an_array_missing_its_separator_is_a_syntax_error
    an_unterminated_array_is_a_syntax_error
    arrays_are_preserved_including_nested_ones
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 13 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
