*** core/src/json.rs:348:20: replace += with *= in Parser<'a>::scalar

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::scalar
@@ -340,17 +340,17 @@
     }
 
     fn scalar(&mut self) -> Result<(), Error> {
         let start = self.i;
         while matches!(
             self.b.get(self.i),
             Some(c) if !matches!(c, b',' | b'}' | b']' | b' ' | b'\t' | b'\n' | b'\r')
         ) {
-            self.i += 1;
+            self.i *= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if self.i == start {
             return Err(self.error("a value was expected"));
         }
         match &self.b[start..self.i] {
             b"true" | b"false" | b"null" => Ok(()),
             other => {
                 let text = std::str::from_utf8(other).map_err(|_| Error::Syntax {

*** result: Timeout
