*** core/src/json.rs:348:35: replace == with != in member

*** mutation diff:
--- core/src/json.rs
+++ replace == with != in member
@@ -340,17 +340,17 @@
 }
 
 fn member<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Member> {
     let (last, parents) = path.split_last()?;
     let parent = resolve(node, parents)?;
     let Node::Object { members, .. } = parent else {
         return None;
     };
-    members.iter().find(|m| m.key == *last)
+    members.iter().find(|m| m.key != /* ~ changed by cargo-mutants ~ */ *last)
 }
 
 fn parent_and_member<'a>(node: &'a Node, path: &[&str]) -> Option<(&'a Node, &'a Member)> {
     let (last, parents) = path.split_last()?;
     let parent = resolve(node, parents)?;
     let Node::Object { members, .. } = parent else {
         return None;
     };

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17302715) panicked at core/tests/json_document.rs:263:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"3\",\n    \"B\": \"2\"\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\",\n    \"C\": \"3\"\n  }\n}\n"

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (17302706) panicked at core/tests/json_document.rs:52:41:
set: NotAnObject { path: "theme" }

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17302712) panicked at core/tests/json_document.rs:275:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 50, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 44, 34, 66, 34, 58, 34, 50, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_trailing_newline_is_not_added
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    adding_then_removing_a_key_leaves_the_file_byte_identical
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped

test result: FAILED. 14 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
