*** core/src/json.rs:361:5: replace resolve -> Option<&'a Node> with None

*** mutation diff:
--- core/src/json.rs
+++ replace resolve -> Option<&'a Node> with None
@@ -353,24 +353,17 @@
     let parent = resolve(node, parents)?;
     let Node::Object { members, .. } = parent else {
         return None;
     };
     members.iter().find(|m| m.key == *last).map(|m| (parent, m))
 }
 
 fn resolve<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Node> {
-    let Some((head, rest)) = path.split_first() else {
-        return Some(node);
-    };
-    let Node::Object { members, .. } = node else {
-        return None;
-    };
-    let member = members.iter().find(|m| m.key == *head)?;
-    resolve(&member.value, rest)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Only what the format requires: a value tapkey writes must not arrive in the file more
 /// escaped than the user's own values are.
 fn encode_string(value: &str) -> Vec<u8> {
     let mut out = Vec::with_capacity(value.len() + 2);
     out.push(b'"');
     for ch in value.chars() {

---- the_deprecated_small_fast_variable_still_wins_the_utility_slot stdout ----

thread 'the_deprecated_small_fast_variable_still_wins_the_utility_slot' (17305520) panicked at core/tests/effective_slots.rs:88:5:
assertion `left == right` failed
  left: Null
 right: String("old/model")

---- anthropic_default_model_is_the_last_word_not_the_first stdout ----

thread 'anthropic_default_model_is_the_last_word_not_the_first' (17305518) panicked at core/tests/effective_slots.rs:73:5:
assertion `left == right` failed
  left: Null
 right: String("sonnet")

---- the_model_key_decides_when_no_variable_is_set stdout ----

thread 'the_model_key_decides_when_no_variable_is_set' (17305523) panicked at core/tests/effective_slots.rs:58:5:
assertion `left == right` failed
  left: Null
 right: String("sonnet")

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 1 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
