*** core/src/json.rs:411:20: replace += with -= in Parser<'a>::skip_whitespace

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Parser<'a>::skip_whitespace
@@ -403,17 +403,17 @@
         Error::Syntax {
             offset: self.i,
             message: message.to_string(),
         }
     }
 
     fn skip_whitespace(&mut self) {
         while matches!(self.b.get(self.i), Some(b' ' | b'\t' | b'\n' | b'\r')) {
-            self.i += 1;
+            self.i -= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
 
     fn value(&mut self) -> Result<Node, Error> {
         match self.b.get(self.i) {
             Some(b'{') => self.object(),
             Some(b'[') => self.array(),
             Some(b'"') => {

---- the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent stdout ----

thread 'the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent' (17314982) panicked at core/tests/effective_slots.rs:16:10:
tools

---- the_deprecated_small_fast_variable_still_wins_the_utility_slot stdout ----

thread 'the_deprecated_small_fast_variable_still_wins_the_utility_slot' (17314977) panicked at core/tests/effective_slots.rs:16:10:
tools

---- advisor_fallback_and_model_overrides_are_observed_not_owned stdout ----

thread 'advisor_fallback_and_model_overrides_are_observed_not_owned' (17314974) panicked at core/tests/effective_slots.rs:16:10:
tools

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_main_slots_unobservable_scopes_are_in_the_right_order
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 0 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
