*** core/src/json.rs:487:17: delete match arm Some(b'}') in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ delete match arm Some(b'}') in Parser<'a>::object
@@ -479,17 +479,17 @@
                 key_span: key_span.clone(),
                 span: key_span.start..member_end,
                 value,
             });
 
             self.skip_whitespace();
             match self.b.get(self.i) {
                 Some(b',') => self.i += 1,
-                Some(b'}') => {}
+                 /* ~ changed by cargo-mutants ~ */
                 _ => return Err(self.error("a comma or a closing brace was expected")),
             }
         }
     }
 
     fn array(&mut self) -> Result<Node, Error> {
         let start = self.i;
         self.i += 1; // '['

---- the_subagent_and_pin_slots_are_read stdout ----

thread 'the_subagent_and_pin_slots_are_read' (17327436) panicked at core/tests/effective_slots.rs:16:10:
tools

---- the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent stdout ----

thread 'the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent' (17327437) panicked at core/tests/effective_slots.rs:16:10:
tools

---- the_main_slots_unobservable_scopes_are_in_the_right_order stdout ----

thread 'the_main_slots_unobservable_scopes_are_in_the_right_order' (17327434) panicked at core/tests/effective_slots.rs:16:10:
tools

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_main_slots_unobservable_scopes_are_in_the_right_order
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 0 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
