*** core/src/json.rs:499:17: delete match arm Some(b']') in Parser<'a>::array

*** mutation diff:
--- core/src/json.rs
+++ delete match arm Some(b']') in Parser<'a>::array
@@ -491,23 +491,17 @@
     }
 
     fn array(&mut self) -> Result<Node, Error> {
         let start = self.i;
         self.i += 1; // '['
         loop {
             self.skip_whitespace();
             match self.b.get(self.i) {
-                Some(b']') => {
-                    self.i += 1;
-                    return Ok(Node::Opaque {
-                        span: start..self.i,
-                        text: None,
-                    });
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 // Reaching the end mid-array is caught by `value()` below in any case; this
                 // arm exists for the better message, which is why a mutation run reports it as
                 // survivable. Verified: with it removed, every truncated form still refuses.
                 None => return Err(self.error("an unterminated array")),
                 _ => {}
             }
             self.value()?;
             self.skip_whitespace();

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (17332575) panicked at core/tests/json_document.rs:183:43:
parse: Syntax { offset: 93, message: "a value was expected" }

failures:
    arrays_are_preserved_including_nested_ones

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
