*** core/src/json.rs:523:9: replace Parser<'a>::string -> Result<String, Error> with Ok("xyzzy".into())

*** mutation diff:
--- core/src/json.rs
+++ replace Parser<'a>::string -> Result<String, Error> with Ok("xyzzy".into())
@@ -515,77 +515,17 @@
                 Some(b',') => self.i += 1,
                 Some(b']') => {}
                 _ => return Err(self.error("a comma or a closing bracket was expected")),
             }
         }
     }
 
     fn string(&mut self) -> Result<String, Error> {
-        if self.b.get(self.i) != Some(&b'"') {
-            return Err(self.error("a string was expected"));
-        }
-        self.i += 1;
-        let mut out = String::new();
-        loop {
-            match self.b.get(self.i) {
-                None => return Err(self.error("an unterminated string")),
-                Some(b'"') => {
-                    self.i += 1;
-                    return Ok(out);
-                }
-                Some(b'\\') => {
-                    self.i += 1;
-                    let escaped = *self
-                        .b
-                        .get(self.i)
-                        .ok_or_else(|| self.error("a truncated escape"))?;
-                    self.i += 1;
-                    match escaped {
-                        b'"' => out.push('"'),
-                        b'\\' => out.push('\\'),
-                        b'/' => out.push('/'),
-                        b'b' => out.push('\u{8}'),
-                        b'f' => out.push('\u{c}'),
-                        b'n' => out.push('\n'),
-                        b'r' => out.push('\r'),
-                        b't' => out.push('\t'),
-                        b'u' => {
-                            let hex = self
-                                .b
-                                .get(self.i..self.i + 4)
-                                .ok_or_else(|| self.error("a truncated \\u escape"))?;
-                            let code = u32::from_str_radix(
-                                std::str::from_utf8(hex)
-                                    .map_err(|_| self.error("a bad \\u escape"))?,
-                                16,
-                            )
-                            .map_err(|_| self.error("a bad \\u escape"))?;
-                            self.i += 4;
-                            // A lone surrogate is kept as the replacement character: the key it
-                            // names still matches, and tapkey never writes this value back.
-                            out.push(char::from_u32(code).unwrap_or('\u{FFFD}'));
-                        }
-                        _ => return Err(self.error("an unknown escape")),
-                    }
-                }
-                Some(&byte) => {
-                    let start = self.i;
-                    while matches!(self.b.get(self.i), Some(&c) if c != b'"' && c != b'\\') {
-                        self.i += 1;
-                    }
-                    let raw = &self.b[start..self.i];
-                    out.push_str(std::str::from_utf8(raw).map_err(|_| Error::Syntax {
-                        offset: start,
-                        message: "a string holds bytes that are not UTF-8".to_string(),
-                    })?);
-                    let _ = byte;
-                }
-            }
-        }
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn scalar(&mut self) -> Result<(), Error> {
         let start = self.i;
         while matches!(
             self.b.get(self.i),
             Some(c) if !matches!(c, b',' | b'}' | b']' | b' ' | b'\t' | b'\n' | b'\r')
         ) {

---- the_main_slots_unobservable_scopes_are_in_the_right_order stdout ----

thread 'the_main_slots_unobservable_scopes_are_in_the_right_order' (17341068) panicked at core/tests/effective_slots.rs:16:10:
tools

---- the_deprecated_small_fast_variable_still_wins_the_utility_slot stdout ----

thread 'the_deprecated_small_fast_variable_still_wins_the_utility_slot' (17341066) panicked at core/tests/effective_slots.rs:16:10:
tools

---- the_subagent_and_pin_slots_are_read stdout ----

thread 'the_subagent_and_pin_slots_are_read' (17341070) panicked at core/tests/effective_slots.rs:16:10:
tools

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_main_slots_unobservable_scopes_are_in_the_right_order
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 0 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
