*** core/src/json.rs:541:28: replace += with -= in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Parser<'a>::string
@@ -533,17 +533,17 @@
                     return Ok(out);
                 }
                 Some(b'\\') => {
                     self.i += 1;
                     let escaped = *self
                         .b
                         .get(self.i)
                         .ok_or_else(|| self.error("a truncated escape"))?;
-                    self.i += 1;
+                    self.i -= /* ~ changed by cargo-mutants ~ */ 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),

*** result: Timeout
