*** core/src/json.rs:541:28: replace += with *= in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::string
@@ -533,17 +533,17 @@
                     return Ok(out);
                 }
                 Some(b'\\') => {
                     self.i += 1;
                     let escaped = *self
                         .b
                         .get(self.i)
                         .ok_or_else(|| self.error("a truncated escape"))?;
-                    self.i += 1;
+                    self.i *= /* ~ changed by cargo-mutants ~ */ 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17349738) panicked at core/tests/json_document.rs:208:46:
set: Syntax { offset: 13, message: "a bad \\u escape" }

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (17349753) panicked at core/tests/json_document.rs:165:43:
parse: Syntax { offset: 20, message: "a comma or a closing brace was expected" }

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (17349766) panicked at core/tests/json_document.rs:152:43:
parse: Syntax { offset: 10, message: "an unknown escape" }

failures:
    a_control_character_in_a_written_value_is_escaped
    braces_and_commas_inside_a_string_are_not_structure
    strings_holding_escapes_survive_untouched

test result: FAILED. 28 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
