*** core/src/json.rs:543:25: delete match arm b'"' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b'"' in Parser<'a>::string
@@ -535,17 +535,17 @@
                 Some(b'\\') => {
                     self.i += 1;
                     let escaped = *self
                         .b
                         .get(self.i)
                         .ok_or_else(|| self.error("a truncated escape"))?;
                     self.i += 1;
                     match escaped {
-                        b'"' => out.push('"'),
+                         /* ~ changed by cargo-mutants ~ */
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),
                         b't' => out.push('\t'),
                         b'u' => {

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (17350711) panicked at core/tests/json_document.rs:165:43:
parse: Syntax { offset: 19, message: "an unknown escape" }

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (17350724) panicked at core/tests/json_document.rs:152:43:
parse: Syntax { offset: 32, message: "an unknown escape" }

failures:
    braces_and_commas_inside_a_string_are_not_structure
    strings_holding_escapes_survive_untouched

test result: FAILED. 29 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
