*** core/src/json.rs:550:25: delete match arm b't' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b't' in Parser<'a>::string
@@ -542,17 +542,17 @@
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),
-                        b't' => out.push('\t'),
+                         /* ~ changed by cargo-mutants ~ */
                         b'u' => {
                             let hex = self
                                 .b
                                 .get(self.i..self.i + 4)
                                 .ok_or_else(|| self.error("a truncated \\u escape"))?;
                             let code = u32::from_str_radix(
                                 std::str::from_utf8(hex)
                                     .map_err(|_| self.error("a bad \\u escape"))?,

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (17357953) panicked at core/tests/json_document.rs:152:43:
parse: Syntax { offset: 48, message: "an unknown escape" }

failures:
    strings_holding_escapes_survive_untouched

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
