*** core/src/json.rs:554:53: replace + with * in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace + with * in Parser<'a>::string
@@ -546,17 +546,17 @@
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),
                         b't' => out.push('\t'),
                         b'u' => {
                             let hex = self
                                 .b
-                                .get(self.i..self.i + 4)
+                                .get(self.i..self.i * /* ~ changed by cargo-mutants ~ */ 4)
                                 .ok_or_else(|| self.error("a truncated \\u escape"))?;
                             let code = u32::from_str_radix(
                                 std::str::from_utf8(hex)
                                     .map_err(|_| self.error("a bad \\u escape"))?,
                                 16,
                             )
                             .map_err(|_| self.error("a bad \\u escape"))?;
                             self.i += 4;

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17361571) panicked at core/tests/json_document.rs:208:46:
set: Syntax { offset: 14, message: "a truncated \\u escape" }

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (17361599) panicked at core/tests/json_document.rs:152:43:
parse: Syntax { offset: 61, message: "a truncated \\u escape" }

failures:
    a_control_character_in_a_written_value_is_escaped
    strings_holding_escapes_survive_untouched

test result: FAILED. 29 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
