*** core/src/json.rs:573:32: replace += with *= in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::string
@@ -565,17 +565,17 @@
                             out.push(char::from_u32(code).unwrap_or('\u{FFFD}'));
                         }
                         _ => return Err(self.error("an unknown escape")),
                     }
                 }
                 Some(&byte) => {
                     let start = self.i;
                     while matches!(self.b.get(self.i), Some(&c) if c != b'"' && c != b'\\') {
-                        self.i += 1;
+                        self.i *= /* ~ changed by cargo-mutants ~ */ 1;
                     }
                     let raw = &self.b[start..self.i];
                     out.push_str(std::str::from_utf8(raw).map_err(|_| Error::Syntax {
                         offset: start,
                         message: "a string holds bytes that are not UTF-8".to_string(),
                     })?);
                     let _ = byte;
                 }

*** result: Timeout
