*** core/src/json.rs:587:9: replace Parser<'a>::scalar -> Result<(), Error> with Ok(())

*** mutation diff:
--- core/src/json.rs
+++ replace Parser<'a>::scalar -> Result<(), Error> with Ok(())
@@ -579,33 +579,11 @@
                     })?);
                     let _ = byte;
                 }
             }
         }
     }
 
     fn scalar(&mut self) -> Result<(), Error> {
-        let start = self.i;
-        while matches!(
-            self.b.get(self.i),
-            Some(c) if !matches!(c, b',' | b'}' | b']' | b' ' | b'\t' | b'\n' | b'\r')
-        ) {
-            self.i += 1;
-        }
-        if self.i == start {
-            return Err(self.error("a value was expected"));
-        }
-        match &self.b[start..self.i] {
-            b"true" | b"false" | b"null" => Ok(()),
-            other => {
-                let text = std::str::from_utf8(other).map_err(|_| Error::Syntax {
-                    offset: start,
-                    message: "a value that is not UTF-8".to_string(),
-                })?;
-                text.parse::<f64>().map(|_| ()).map_err(|_| Error::Syntax {
-                    offset: start,
-                    message: format!("{text:?} is not a JSON value"),
-                })
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (17364634) panicked at core/tests/json_document.rs:183:43:
parse: Syntax { offset: 81, message: "a comma or a closing bracket was expected" }

---- replaces_a_nested_value_and_leaves_every_other_byte_alone stdout ----

thread 'replaces_a_nested_value_and_leaves_every_other_byte_alone' (17364642) panicked at core/tests/json_document.rs:33:41:
parse: Syntax { offset: 278, message: "a comma or a closing brace was expected" }

---- setting_the_same_value_twice_is_byte_identical stdout ----

thread 'setting_the_same_value_twice_is_byte_identical' (17364646) panicked at core/tests/json_document.rs:109:45:
parse: Syntax { offset: 278, message: "a comma or a closing brace was expected" }

failures:
    arrays_are_preserved_including_nested_ones
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 28 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
