*** core/src/json.rs:68:9: replace Document::original -> &[u8] with Vec::leak(vec![0])

*** mutation diff:
--- core/src/json.rs
+++ replace Document::original -> &[u8] with Vec::leak(vec![0])
@@ -60,17 +60,17 @@
             original: bytes.to_vec(),
             bytes: bytes.to_vec(),
             root,
         })
     }
 
     /// The bytes this document was parsed from, before any edit.
     pub fn original(&self) -> &[u8] {
-        &self.original
+        Vec::leak(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The string at `path`, or `None` if there is nothing there or it is not a string.
     ///
     /// Reading goes through this reader rather than a general-purpose one so that the refusals
     /// apply on the read path too: a duplicate key means effective state cannot be promised,
     /// and promising it from a second parser that silently picks a winner would be worse than
     /// not answering.

---- the_original_bytes_and_a_members_extent_are_available_for_comparison stdout ----

thread 'the_original_bytes_and_a_members_extent_are_available_for_comparison' (17237499) panicked at core/tests/json_document.rs:401:5:
assertion `left == right` failed: the reading is kept, not overwritten
  left: [0]
 right: [123, 34, 97, 34, 58, 34, 49, 34, 44, 34, 98, 34, 58, 34, 50, 34, 125]

failures:
    the_original_bytes_and_a_members_extent_are_available_for_comparison

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
