*** core/src/json.rs:74:21: replace != with == in Document::parse

*** mutation diff:
--- core/src/json.rs
+++ replace != with == in Document::parse
@@ -66,17 +66,17 @@
 impl Document {
     /// Parse `bytes` as strict JSON.
     pub fn parse(bytes: &[u8]) -> Result<Self, Error> {
         let start = if bytes.starts_with(b"\xEF\xBB\xBF") { 3 } else { 0 };
         let mut parser = Parser { b: bytes, i: start };
         parser.skip_whitespace();
         let root = parser.value()?;
         parser.skip_whitespace();
-        if parser.i != bytes.len() {
+        if parser.i == /* ~ changed by cargo-mutants ~ */ bytes.len() {
             return Err(parser.error("trailing content after the top-level value"));
         }
         Ok(Document {
             original: bytes.to_vec(),
             root,
             splices: Vec::new(),
         })
     }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16456221) panicked at core/tests/json_document.rs:179:55:
parse: Syntax { offset: 12, message: "trailing content after the top-level value" }

---- carriage_returns_survive stdout ----

thread 'carriage_returns_survive' (16456230) panicked at core/tests/json_document.rs:57:43:
parse: Syntax { offset: 25, message: "trailing content after the top-level value" }

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (16456220) panicked at core/tests/json_document.rs:47:44:
parse: Syntax { offset: 20, message: "trailing content after the top-level value" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
