*** core/src/json.rs:78:9: replace Document::get_string -> Option<&str> with Some("")

*** mutation diff:
--- core/src/json.rs
+++ replace Document::get_string -> Option<&str> with Some("")
@@ -70,20 +70,17 @@
 
     /// The string at `path`, or `None` if there is nothing there or it is not a string.
     ///
     /// Reading goes through this reader rather than a general-purpose one so that the refusals
     /// apply on the read path too: a duplicate key means effective state cannot be promised,
     /// and promising it from a second parser that silently picks a winner would be worse than
     /// not answering.
     pub fn get_string(&self, path: &[&str]) -> Option<&str> {
-        match resolve(&self.root, path)? {
-            Node::Opaque { text, .. } => text.as_deref(),
-            Node::Object { .. } => None,
-        }
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 
     /// Key start through value end for `path`, excluding the separating comma. What a caller
     /// needs to excise the regions tapkey owns and compare everything else byte for byte.
     pub fn member_span(&self, path: &[&str]) -> Option<Range<usize>> {
         member(&self.root, path).map(|m| m.span.clone())
     }

---- a_link_names_the_key_it_read_not_only_the_file stdout ----

thread 'a_link_names_the_key_it_read_not_only_the_file' (17235423) panicked at core/tests/effective_slots.rs:152:5:
assertion `left == right` failed
  left: []
 right: ["model"]

---- the_deprecated_small_fast_variable_still_wins_the_utility_slot stdout ----

thread 'the_deprecated_small_fast_variable_still_wins_the_utility_slot' (17235427) panicked at core/tests/effective_slots.rs:88:5:
assertion `left == right` failed
  left: String("")
 right: String("old/model")

---- advisor_fallback_and_model_overrides_are_observed_not_owned stdout ----

thread 'advisor_fallback_and_model_overrides_are_observed_not_owned' (17235424) panicked at core/tests/effective_slots.rs:132:5:
assertion `left == right` failed
  left: String("")
 right: String("fable")

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 1 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
