*** core/src/json.rs:91:13: delete match arm Node::Opaque{span, is_string:true} in Document::set_string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm Node::Opaque{span, is_string:true} in Document::set_string
@@ -83,21 +83,17 @@
 
     /// Replace the string at `path`. Creates nothing: a path that is not already there is an
     /// error, because creating is a different decision with its own rules about placement.
     pub fn set_string(&mut self, path: &[&str], value: &str) -> Result<Range<usize>, Error> {
         let node = resolve(&self.root, path).ok_or_else(|| Error::Missing {
             path: path.join("."),
         })?;
         match node {
-            Node::Opaque { span, is_string: true } => {
-                let range = span.clone();
-                self.record(range.clone(), encode_string(value));
-                Ok(range)
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(Error::NotAString {
                 path: path.join("."),
             }),
         }
     }
 
     /// The document's bytes with every pending splice applied.
     pub fn to_bytes(&self) -> Vec<u8> {

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16456686) panicked at core/tests/json_document.rs:144:41:
set: NotAString { path: "theme" }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16456678) panicked at core/tests/json_document.rs:181:46:
set: NotAString { path: "note" }

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16456685) panicked at core/tests/json_document.rs:159:41:
set: NotAString { path: "theme" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 5 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
