*** core/src/json.rs:95:9: replace Document::set_string -> Result<(), Error> with Ok(())

*** mutation diff:
--- core/src/json.rs
+++ replace Document::set_string -> Result<(), Error> with Ok(())
@@ -87,18 +87,17 @@
         member(&self.root, path).map(|m| m.span.clone())
     }
 
     /// Set the string at `path`, creating whatever part of it is missing.
     ///
     /// A key that is not there yet is the ordinary case on a fresh machine, and a missing
     /// intermediate object is created in the file's own style, recursively.
     pub fn set_string(&mut self, path: &[&str], value: &str) -> Result<(), Error> {
-        let (range, replacement) = self.plan_set(path, value)?;
-        self.splice(range, &replacement)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Remove the key at `path`, taking the separator and whitespace its insertion added.
     /// Anything less and adding then removing the same key would leave a trail, so idempotence
     /// would hold only by luck. A path that is not there is a no-op, not a failure.
     pub fn remove(&mut self, path: &[&str]) -> Result<(), Error> {
         let Some((parent, m)) = parent_and_member(&self.root, path) else {
             return Ok(());

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17241451) panicked at core/tests/json_document.rs:263:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\"\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\",\n    \"C\": \"3\"\n  }\n}\n"

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17241446) panicked at core/tests/json_document.rs:287:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 32, 34, 49, 34, 125]
 right: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 32, 34, 98, 34, 58, 32, 34, 50, 34, 125]

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17241443) panicked at core/tests/json_document.rs:210:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 34, 120, 34, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

failures:
    a_control_character_in_a_written_value_is_escaped
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    an_empty_object_receives_its_first_key
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive

test result: FAILED. 13 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
