*** core/src/profile.rs:41:44: replace == with != in Profiles::find

*** mutation diff:
--- core/src/profile.rs
+++ replace == with != in Profiles::find
@@ -33,11 +33,11 @@
 
 impl Profiles {
     pub fn read(path: &Path) -> Result<Profiles, String> {
         let bytes = std::fs::read(path).map_err(|e| format!("{}: {e}", path.display()))?;
         serde_json::from_slice(&bytes).map_err(|e| format!("{}: {e}", path.display()))
     }
 
     pub fn find(&self, id: &str) -> Option<&Profile> {
-        self.profiles.iter().find(|p| p.id == id)
+        self.profiles.iter().find(|p| p.id != /* ~ changed by cargo-mutants ~ */ id)
     }
 }

---- the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup stdout ----

thread 'the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup' (17530917) panicked at core/tests/switching.rs:194:5:
assertion failed: machine.store().join("snapshot").join("manifest.json").exists()

---- no_assignment_removes_the_key_tapkey_wrote stdout ----

thread 'no_assignment_removes_the_key_tapkey_wrote' (17530913) panicked at core/tests/switching.rs:155:5:
assertion failed: !user_settings(&machine).contains("ANTHROPIC_MODEL")

---- a_switch_writes_the_endpoint_and_the_models_into_the_env_block stdout ----

thread 'a_switch_writes_the_endpoint_and_the_models_into_the_env_block' (17530909) panicked at core/tests/switching.rs:36:5:
assertion `left == right` failed: {"failure":{"detail":"no profile named \"zai\"","kind":"unknown_profile"},"ok":false}
  left: Null
 right: String("applied")

failures:
    a_pin_carries_its_display_name
    a_switch_writes_the_endpoint_and_the_models_into_the_env_block
    an_unknown_profile_is_refused_and_changes_nothing
    an_unparsable_settings_file_refuses_the_switch
    no_assignment_removes_the_key_tapkey_wrote
    no_assignment_writes_an_empty_value_only_when_a_shell_export_exists
    the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup
    the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present

test result: FAILED. 3 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
