*** core/src/profile.rs:41:9: replace Profiles::find -> Option<&Profile> with None

*** mutation diff:
--- core/src/profile.rs
+++ replace Profiles::find -> Option<&Profile> with None
@@ -33,11 +33,11 @@
 
 impl Profiles {
     pub fn read(path: &Path) -> Result<Profiles, String> {
         let bytes = std::fs::read(path).map_err(|e| format!("{}: {e}", path.display()))?;
         serde_json::from_slice(&bytes).map_err(|e| format!("{}: {e}", path.display()))
     }
 
     pub fn find(&self, id: &str) -> Option<&Profile> {
-        self.profiles.iter().find(|p| p.id == id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_pin_carries_its_display_name stdout ----

thread 'a_pin_carries_its_display_name' (17531811) panicked at core/tests/switching.rs:134:5:
{}

---- a_switch_writes_the_endpoint_and_the_models_into_the_env_block stdout ----

thread 'a_switch_writes_the_endpoint_and_the_models_into_the_env_block' (17531812) panicked at core/tests/switching.rs:36:5:
assertion `left == right` failed: {"failure":{"detail":"no profile named \"zai\"","kind":"unknown_profile"},"ok":false}
  left: Null
 right: String("applied")

---- an_unparsable_settings_file_refuses_the_switch stdout ----

thread 'an_unparsable_settings_file_refuses_the_switch' (17531814) panicked at core/tests/switching.rs:231:5:
assertion `left == right` failed
  left: String("unknown_profile")
 right: String("unparsable")

failures:
    a_pin_carries_its_display_name
    a_switch_writes_the_endpoint_and_the_models_into_the_env_block
    an_unparsable_settings_file_refuses_the_switch
    no_assignment_removes_the_key_tapkey_wrote
    no_assignment_writes_an_empty_value_only_when_a_shell_export_exists
    the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup
    the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present

test result: FAILED. 4 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
