*** core/src/store.rs:119:9: replace Store::has_snapshot -> bool with true

*** mutation diff:
--- core/src/store.rs
+++ replace Store::has_snapshot -> bool with true
@@ -111,17 +111,17 @@
         create_dir_closed(root)?;
         create_dir_closed(&root.join("backups"))?;
         Ok(Store {
             root: root.to_path_buf(),
         })
     }
 
     pub fn has_snapshot(&self) -> bool {
-        self.snapshot_dir().join("manifest.json").exists()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Record the configs as they were before tapkey first changed anything.
     pub fn take_snapshot(&self, files: &[Captured], at: SystemTime) -> io::Result<()> {
         let dir = self.snapshot_dir();
         write_group(&dir, files, at, "")?;
         Ok(())
     }

*** result: Success
