*** core/src/store.rs:119:9: replace Store::has_snapshot -> bool with false

*** mutation diff:
--- core/src/store.rs
+++ replace Store::has_snapshot -> bool with false
@@ -111,17 +111,17 @@
         create_dir_closed(root)?;
         create_dir_closed(&root.join("backups"))?;
         Ok(Store {
             root: root.to_path_buf(),
         })
     }
 
     pub fn has_snapshot(&self) -> bool {
-        self.snapshot_dir().join("manifest.json").exists()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Record the configs as they were before tapkey first changed anything.
     pub fn take_snapshot(&self, files: &[Captured], at: SystemTime) -> io::Result<()> {
         let dir = self.snapshot_dir();
         write_group(&dir, files, at, "")?;
         Ok(())
     }

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16799160) panicked at core/tests/store.rs:174:5:
the snapshot is the floor under every restore

failures:
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.65s

*** result: Failure(101)
