*** core/src/store.rs:124:9: replace Store::take_snapshot -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/store.rs
+++ replace Store::take_snapshot -> io::Result<()> with Ok(())
@@ -116,19 +116,17 @@
     }
 
     pub fn has_snapshot(&self) -> bool {
         self.snapshot_dir().join("manifest.json").exists()
     }
 
     /// Record the configs as they were before tapkey first changed anything.
     pub fn take_snapshot(&self, files: &[Captured], at: SystemTime) -> io::Result<()> {
-        let dir = self.snapshot_dir();
-        write_group(&dir, files, at, "")?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Save the files one change is about to touch.
     pub fn take_backup(
         &self,
         files: &[Captured],
         profile: &str,
         at: SystemTime,

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16799681) panicked at core/tests/store.rs:174:5:
the snapshot is the floor under every restore

failures:
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.94s

*** result: Failure(101)
