*** core/src/store.rs:143:9: replace Store::backups -> io::Result<Vec<BackupSummary>> with Ok(vec![])

*** mutation diff:
--- core/src/store.rs
+++ replace Store::backups -> io::Result<Vec<BackupSummary>> with Ok(vec![])
@@ -135,52 +135,17 @@
     ) -> io::Result<BackupId> {
         let id = BackupId(format_utc(at));
         write_group(&self.backups_dir().join(&id.0), files, at, profile)?;
         Ok(id)
     }
 
     /// Every readable backup, oldest first, sweeping away any interrupted write it finds.
     pub fn backups(&self) -> io::Result<Vec<BackupSummary>> {
-        let mut out = Vec::new();
-        let Ok(entries) = fs::read_dir(self.backups_dir()) else {
-            return Ok(out);
-        };
-        for entry in entries {
-            let path = entry?.path();
-            if !path.is_dir() {
-                continue;
-            }
-            let manifest_path = path.join("manifest.json");
-            if !manifest_path.exists() {
-                // No manifest means the write never committed. Ours, not theirs.
-                fs::remove_dir_all(&path)?;
-                continue;
-            }
-            let id = BackupId(file_name(&path));
-            out.push(match read_manifest(&manifest_path) {
-                Ok(m) => BackupSummary {
-                    profile: m.profile,
-                    instant: m.instant,
-                    restorable: m.files.iter().all(|e| match &e.stored {
-                        Some(name) => path.join("files").join(name).exists(),
-                        None => true,
-                    }),
-                    id,
-                },
-                Err(_) => BackupSummary {
-                    profile: String::new(),
-                    instant: id.0.clone(),
-                    restorable: false,
-                    id,
-                },
-            });
-        }
-        out.sort_by(|a, b| a.id.cmp(&b.id));
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// What going back to `target` would do to the filesystem.
     pub fn restore_plan(&self, target: Target) -> io::Result<Vec<RestoreAction>> {
         let dir = match target {
             Target::Snapshot => self.snapshot_dir(),
             Target::Backup(id) => self.backups_dir().join(&id.0),
         };

---- a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted stdout ----

thread 'a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted' (16801256) panicked at core/tests/store.rs:134:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16801255) panicked at core/tests/store.rs:37:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_without_a_manifest_is_swept_in_silence stdout ----

thread 'a_backup_without_a_manifest_is_swept_in_silence' (16801257) panicked at core/tests/store.rs:117:5:
assertion `left == right` failed: the torn one is not listed
  left: 0
 right: 1

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted
    a_backup_without_a_manifest_is_swept_in_silence
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.68s

*** result: Failure(101)
