*** core/src/store.rs:153:16: delete ! in Store::backups

*** mutation diff:
--- core/src/store.rs
+++ delete ! in Store::backups
@@ -145,17 +145,17 @@
             return Ok(out);
         };
         for entry in entries {
             let path = entry?.path();
             if !path.is_dir() {
                 continue;
             }
             let manifest_path = path.join("manifest.json");
-            if !manifest_path.exists() {
+            if  /* ~ changed by cargo-mutants ~ */manifest_path.exists() {
                 // No manifest means the write never committed. Ours, not theirs.
                 fs::remove_dir_all(&path)?;
                 continue;
             }
             let id = BackupId(file_name(&path));
             out.push(match read_manifest(&manifest_path) {
                 Ok(m) => BackupSummary {
                     profile: m.profile,

---- a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted stdout ----

thread 'a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted' (16803446) panicked at core/tests/store.rs:134:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16803445) panicked at core/tests/store.rs:37:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_without_a_manifest_is_swept_in_silence stdout ----

thread 'a_backup_without_a_manifest_is_swept_in_silence' (16803447) panicked at core/tests/store.rs:118:5:
and it is gone

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted
    a_backup_without_a_manifest_is_swept_in_silence
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.85s

*** result: Failure(101)
