*** core/src/store.rs:183:9: replace Store::restore_plan -> io::Result<Vec<RestoreAction>> with Ok(vec![])

*** mutation diff:
--- core/src/store.rs
+++ replace Store::restore_plan -> io::Result<Vec<RestoreAction>> with Ok(vec![])
@@ -175,33 +175,17 @@
             });
         }
         out.sort_by(|a, b| a.id.cmp(&b.id));
         Ok(out)
     }
 
     /// What going back to `target` would do to the filesystem.
     pub fn restore_plan(&self, target: Target) -> io::Result<Vec<RestoreAction>> {
-        let dir = match target {
-            Target::Snapshot => self.snapshot_dir(),
-            Target::Backup(id) => self.backups_dir().join(&id.0),
-        };
-        let manifest = read_manifest(&dir.join("manifest.json"))?;
-        manifest
-            .files
-            .into_iter()
-            .map(|e| match e.stored {
-                Some(name) => Ok(RestoreAction::Write {
-                    bytes: fs::read(dir.join("files").join(name))?,
-                    path: e.path,
-                    mode: e.mode,
-                }),
-                None => Ok(RestoreAction::Delete { path: e.path }),
-            })
-            .collect()
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Two ceilings, both binding, oldest first. Fifty guards against a long history, fifty
     /// megabytes against one enormous config, and each alone misses what the other catches.
     /// The snapshot is not counted and not reachable: counting it would let a large one evict
     /// the whole history, or make it the suspect when the budget is reached.
     pub fn sweep(&self, max_backups: usize, max_bytes: u64) -> io::Result<()> {
         let listed = self.backups()?; // oldest first, and sweeps torn writes on the way

---- restoring_an_unreadable_backup_refuses_rather_than_half_doing_it stdout ----

thread 'restoring_an_unreadable_backup_refuses_rather_than_half_doing_it' (16803518) panicked at core/tests/store.rs:148:5:
assertion failed: store.restore_plan(Target::Backup("20250101T000000.000Z".into())).is_err()

---- a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it stdout ----

thread 'a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it' (16803517) panicked at core/tests/store.rs:98:5:
assertion failed: matches!(&plan[..], [RestoreAction::Delete { path }] if path == &target)

---- restoring_returns_the_original_bytes_rather_than_writing_them stdout ----

thread 'restoring_returns_the_original_bytes_rather_than_writing_them' (16803519) panicked at core/tests/store.rs:68:18:
unexpected plan: []

failures:
    a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it
    restoring_an_unreadable_backup_refuses_rather_than_half_doing_it
    restoring_returns_the_original_bytes_rather_than_writing_them
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.45s

*** result: Failure(101)
