*** core/src/store.rs:207:9: replace Store::sweep -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/store.rs
+++ replace Store::sweep -> io::Result<()> with Ok(())
@@ -199,34 +199,17 @@
             .collect()
     }
 
     /// Two ceilings, both binding, oldest first. Fifty guards against a long history, fifty
     /// megabytes against one enormous config, and each alone misses what the other catches.
     /// The snapshot is not counted and not reachable: counting it would let a large one evict
     /// the whole history, or make it the suspect when the budget is reached.
     pub fn sweep(&self, max_backups: usize, max_bytes: u64) -> io::Result<()> {
-        let listed = self.backups()?; // oldest first, and sweeps torn writes on the way
-        let mut sizes: Vec<(BackupId, u64)> = Vec::new();
-        for summary in &listed {
-            let dir = self.backups_dir().join(summary.id.as_str());
-            sizes.push((summary.id.clone(), directory_size(&dir)?));
-        }
-
-        let mut total: u64 = sizes.iter().map(|(_, n)| *n).sum();
-        let mut count = sizes.len();
-        for (id, size) in sizes {
-            if count <= max_backups && total <= max_bytes {
-                break;
-            }
-            fs::remove_dir_all(self.backups_dir().join(id.as_str()))?;
-            total = total.saturating_sub(size);
-            count -= 1;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn snapshot_dir(&self) -> PathBuf {
         self.root.join("snapshot")
     }
 
     fn backups_dir(&self) -> PathBuf {
         self.root.join("backups")

---- the_sweep_removes_the_oldest_first stdout ----

thread 'the_sweep_removes_the_oldest_first' (16803557) panicked at core/tests/store.rs:207:5:
assertion `left == right` failed: newest kept, oldest gone
  left: ["p0", "p1", "p2", "p3", "p4"]
 right: ["p3", "p4"]

---- the_byte_ceiling_binds_as_well_as_the_count stdout ----

thread 'the_byte_ceiling_binds_as_well_as_the_count' (16803554) panicked at core/tests/store.rs:236:5:
the byte ceiling bound first

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16803555) panicked at core/tests/store.rs:178:5:
assertion `left == right` failed
  left: 60
 right: 3

failures:
    the_byte_ceiling_binds_as_well_as_the_count
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.74s

*** result: Failure(101)
