*** core/src/store.rs:222:19: replace -= with /= in Store::sweep

*** mutation diff:
--- core/src/store.rs
+++ replace -= with /= in Store::sweep
@@ -214,17 +214,17 @@
         let mut total: u64 = sizes.iter().map(|(_, n)| *n).sum();
         let mut count = sizes.len();
         for (id, size) in sizes {
             if count <= max_backups && total <= max_bytes {
                 break;
             }
             fs::remove_dir_all(self.backups_dir().join(id.as_str()))?;
             total = total.saturating_sub(size);
-            count -= 1;
+            count /= /* ~ changed by cargo-mutants ~ */ 1;
         }
         Ok(())
     }
 
     fn snapshot_dir(&self) -> PathBuf {
         self.root.join("snapshot")
     }

---- the_sweep_removes_the_oldest_first stdout ----

thread 'the_sweep_removes_the_oldest_first' (16808074) panicked at core/tests/store.rs:207:5:
assertion `left == right` failed: newest kept, oldest gone
  left: []
 right: ["p3", "p4"]

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16808072) panicked at core/tests/store.rs:178:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.05s

*** result: Failure(101)
