*** core/src/store.rs:232:9: replace Store::backups_dir -> PathBuf with Default::default()

*** mutation diff:
--- core/src/store.rs
+++ replace Store::backups_dir -> PathBuf with Default::default()
@@ -224,17 +224,17 @@
         Ok(())
     }
 
     fn snapshot_dir(&self) -> PathBuf {
         self.root.join("snapshot")
     }
 
     fn backups_dir(&self) -> PathBuf {
-        self.root.join("backups")
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Copies first, manifest last by atomic rename: one point of commit rather than a transaction
 /// spanning the store.
 fn write_group(dir: &Path, files: &[Captured], at: SystemTime, profile: &str) -> io::Result<()> {
     create_dir_closed(dir)?;
     create_dir_closed(&dir.join("files"))?;

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16812062) panicked at core/tests/store.rs:37:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted stdout ----

thread 'a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted' (16812063) panicked at core/tests/store.rs:134:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_without_a_manifest_is_swept_in_silence stdout ----

thread 'a_backup_without_a_manifest_is_swept_in_silence' (16812064) panicked at core/tests/store.rs:117:5:
assertion `left == right` failed: the torn one is not listed
  left: 0
 right: 1

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted
    a_backup_without_a_manifest_is_swept_in_silence
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_store_is_ours_so_it_is_created_closed
    the_sweep_removes_the_oldest_first

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.85s

*** result: Failure(101)
