*** core/src/store.rs:276:25: replace > with == in read_manifest

*** mutation diff:
--- core/src/store.rs
+++ replace > with == in read_manifest
@@ -268,17 +268,17 @@
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
     write_atomically(&dir.join("manifest.json"), &bytes, FILE_MODE)
 }
 
 fn read_manifest(path: &Path) -> io::Result<Manifest> {
     let bytes = fs::read(path)?;
     let manifest: Manifest = serde_json::from_slice(&bytes)
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-    if manifest.version > MANIFEST_VERSION {
+    if manifest.version == /* ~ changed by cargo-mutants ~ */ MANIFEST_VERSION {
         // A version from the future is kept and marked, never reinterpreted by guesswork.
         return Err(io::Error::new(
             io::ErrorKind::InvalidData,
             format!(
                 "manifest version {} is newer than this build reads",
                 manifest.version
             ),
         ));

---- a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it stdout ----

thread 'a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it' (16812555) panicked at core/tests/store.rs:96:55:
plan: Custom { kind: InvalidData, error: "manifest version 1 is newer than this build reads" }

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16812552) panicked at core/tests/store.rs:39:5:
assertion `left == right` failed
  left: ""
 right: "zai"

---- restoring_returns_the_original_bytes_rather_than_writing_them stdout ----

thread 'restoring_returns_the_original_bytes_rather_than_writing_them' (16812557) panicked at core/tests/store.rs:56:55:
plan: Custom { kind: InvalidData, error: "manifest version 1 is newer than this build reads" }

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it
    restoring_returns_the_original_bytes_rather_than_writing_them
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.65s

*** result: Failure(101)
