*** core/src/store.rs:311:15: replace += with -= in directory_size

*** mutation diff:
--- core/src/store.rs
+++ replace += with -= in directory_size
@@ -303,17 +303,17 @@
     Ok(())
 }
 
 fn directory_size(dir: &Path) -> io::Result<u64> {
     let mut total = 0;
     for entry in fs::read_dir(dir)? {
         let entry = entry?;
         let meta = entry.metadata()?;
-        total += if meta.is_dir() {
+        total -= /* ~ changed by cargo-mutants ~ */ if meta.is_dir() {
             directory_size(&entry.path())?
         } else {
             meta.len()
         };
     }
     Ok(total)
 }

---- the_byte_ceiling_binds_as_well_as_the_count stdout ----

thread 'the_byte_ceiling_binds_as_well_as_the_count' (16820492) panicked at core/src/store.rs:311:9:
attempt to subtract with overflow

---- the_sweep_removes_the_oldest_first stdout ----

thread 'the_sweep_removes_the_oldest_first' (16820495) panicked at core/src/store.rs:311:9:
attempt to subtract with overflow

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16820493) panicked at core/src/store.rs:311:9:
attempt to subtract with overflow

failures:
    the_byte_ceiling_binds_as_well_as_the_count
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.30s

*** result: Failure(101)
