*** core/src/store.rs:321:5: replace file_name -> String with String::new()

*** mutation diff:
--- core/src/store.rs
+++ replace file_name -> String with String::new()
@@ -313,12 +313,10 @@
         } else {
             meta.len()
         };
     }
     Ok(total)
 }
 
 fn file_name(path: &Path) -> String {
-    path.file_name()
-        .map(|n| n.to_string_lossy().into_owned())
-        .unwrap_or_default()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16820709) panicked at core/tests/store.rs:38:5:
assertion `left == right` failed
  left: BackupId("")
 right: BackupId("20260827T213720.123Z")

---- the_sweep_removes_the_oldest_first stdout ----

thread 'the_sweep_removes_the_oldest_first' (16820718) panicked at core/tests/store.rs:199:38:
sweep: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- the_byte_ceiling_binds_as_well_as_the_count stdout ----

thread 'the_byte_ceiling_binds_as_well_as_the_count' (16820715) panicked at core/tests/store.rs:234:27:
sweep: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    the_byte_ceiling_binds_as_well_as_the_count
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.54s

*** result: Failure(101)
