--- core/src/fingerprint.rs
+++ replace State::read -> State with Default::default()
@@ -36,21 +36,17 @@
 }
 
 const VERSION: u32 = 1;
 
 impl State {
     pub fn read(path: &Path) -> State {
         // A state file that is missing or unreadable means tapkey owns nothing it can prove,
         // which is the safe reading: it reports no drift rather than inventing some.
-        std::fs::read(path)
-            .ok()
-            .and_then(|b| serde_json::from_slice::<State>(&b).ok())
-            .filter(|s| s.version <= VERSION)
-            .unwrap_or_default()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn write(
         path: &Path,
         profile: &str,
         owned: BTreeMap<String, BTreeMap<String, String>>,
     ) -> io::Result<()> {
         let state = State {
