--- core/src/fingerprint.rs
+++ replace <= with > in State::read
@@ -39,17 +39,17 @@
 
 impl State {
     pub fn read(path: &Path) -> State {
         // A state file that is missing or unreadable means tapkey owns nothing it can prove,
         // which is the safe reading: it reports no drift rather than inventing some.
         std::fs::read(path)
             .ok()
             .and_then(|b| serde_json::from_slice::<State>(&b).ok())
-            .filter(|s| s.version <= VERSION)
+            .filter(|s| s.version > /* ~ changed by cargo-mutants ~ */ VERSION)
             .unwrap_or_default()
     }
 
     pub fn write(
         path: &Path,
         profile: &str,
         owned: BTreeMap<String, BTreeMap<String, String>>,
     ) -> io::Result<()> {
