--- core/src/fingerprint.rs
+++ replace State::drifted -> bool with false
@@ -62,14 +62,11 @@
             .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
         crate::atomic::write_atomically(path, &bytes, 0o600)
     }
 
     /// Whether `value` differs from what tapkey recorded writing. Unknown slots never drift:
     /// reporting drift against something we never owned would make the signal meaningless on
     /// a machine where nothing has been switched yet.
     pub fn drifted(&self, tool: &str, slot: &str, value: Option<&str>) -> bool {
-        match self.owned.get(tool).and_then(|s| s.get(slot)) {
-            Some(recorded) => value.map(hash).as_deref() != Some(recorded.as_str()),
-            None => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
