--- core/src/lock.rs
+++ replace take -> Result<(), Busy> with Ok(())
@@ -37,25 +37,17 @@
 }
 
 /// Somebody else is writing. Not an error in the file system sense — a fact about timing.
 #[derive(Debug)]
 pub struct Busy(pub String);
 
 #[cfg(unix)]
 fn take(file: &File) -> Result<(), Busy> {
-    use std::os::unix::io::AsRawFd;
-    // SAFETY: the descriptor is owned by `file` and outlives the call.
-    // Exclusive and non-blocking. A mutation run reports the `|` as survivable, and it is:
-    // the two flags share no bits, so exclusive-or has the same value here.
-    let taken = unsafe { libc::flock(file.as_raw_fd(), libc::LOCK_EX | libc::LOCK_NB) };
-    if taken == 0 {
-        return Ok(());
-    }
-    Err(Busy(io::Error::last_os_error().to_string()))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(unix))]
 fn take(_file: &File) -> Result<(), Busy> {
     // Windows has LockFileEx and no runner yet to prove it against. Named rather than silently
     // succeeding, so the gap is collected along with the rest of the Windows seam.
     Ok(())
 }
