*** core/src/adapters/claude.rs:128:9: delete match arm "project local" in scope_path

*** mutation diff:
--- core/src/adapters/claude.rs
+++ delete match arm "project local" in scope_path
@@ -120,17 +120,17 @@
         observable: false,
         wins: false,
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
     match scope {
         "managed" => Some(env.managed().to_path_buf()),
-        "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
+         /* ~ changed by cargo-mutants ~ */
         "project" => Some(env.project()?.join(".claude").join("settings.json")),
         "user" => Some(env.home().join(".claude").join("settings.json")),
         _ => None,
     }
 }
 
 fn read_settings(path: &Path) -> Result<Option<Document>, crate::json::Error> {
     match std::fs::read(path) {

---- project_local_outranks_the_shared_project_file stdout ----

thread 'project_local_outranks_the_shared_project_file' (16550787) panicked at core/tests/effective_state.rs:68:5:
assertion `left == right` failed
  left: String("https://shared.test")
 right: String("https://local.test")

failures:
    project_local_outranks_the_shared_project_file

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
