*** core/src/adapters/claude.rs:136:5: replace read_settings -> Result<Option<Document>, crate::json::Error> with Ok(None)

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace read_settings -> Result<Option<Document>, crate::json::Error> with Ok(None)
@@ -128,21 +128,17 @@
         "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
         "project" => Some(env.project()?.join(".claude").join("settings.json")),
         "user" => Some(env.home().join(".claude").join("settings.json")),
         _ => None,
     }
 }
 
 fn read_settings(path: &Path) -> Result<Option<Document>, crate::json::Error> {
-    match std::fs::read(path) {
-        Ok(bytes) => Document::parse(&bytes).map(Some),
-        // A file that is not there is not an error: installing Claude Code creates none.
-        Err(_) => Ok(None),
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Paths are reported as the person would type them, so a chain reads like their filesystem.
 fn display_path(path: &Path, env: &Env) -> String {
     match path.strip_prefix(env.home()) {
         Ok(rest) => format!("~/{}", rest.display()),
         Err(_) => path.display().to_string(),
     }

---- reports_the_endpoint_a_user_settings_file_sets stdout ----

thread 'reports_the_endpoint_a_user_settings_file_sets' (16552655) panicked at core/tests/effective_state.rs:23:5:
assertion `left == right` failed
  left: Null
 right: String("https://api.a6api.com")

---- a_file_that_exists_but_is_silent_does_not_win stdout ----

thread 'a_file_that_exists_but_is_silent_does_not_win' (16552648) panicked at core/tests/effective_state.rs:205:28:

---- a_link_names_the_file_the_way_a_person_would_write_it stdout ----

thread 'a_link_names_the_file_the_way_a_person_would_write_it' (16552649) panicked at core/tests/effective_state.rs:205:28:

failures:
    a_duplicate_key_refuses_the_whole_read
    a_file_that_exists_but_is_silent_does_not_win
    a_link_names_the_file_the_way_a_person_would_write_it
    a_project_config_outranks_the_user_file_and_the_chain_names_both
    a_settings_file_beats_a_shell_export
    managed_settings_outrank_everything_on_disk
    project_local_outranks_the_shared_project_file
    reports_the_endpoint_a_user_settings_file_sets
    the_chain_is_ordered_by_precedence_even_when_scopes_are_absent

test result: FAILED. 3 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
