*** core/src/adapters/claude.rs:145:5: replace display_path -> String with String::new()

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace display_path -> String with String::new()
@@ -137,20 +137,17 @@
         Ok(bytes) => Document::parse(&bytes).map(Some),
         // A file that is not there is not an error: installing Claude Code creates none.
         Err(_) => Ok(None),
     }
 }
 
 /// Paths are reported as the person would type them, so a chain reads like their filesystem.
 fn display_path(path: &Path, env: &Env) -> String {
-    match path.strip_prefix(env.home()) {
-        Ok(rest) => format!("~/{}", rest.display()),
-        Err(_) => path.display().to_string(),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The highest-precedence entry that actually carries a value wins. An unobservable scope can
 /// never be said to win: we do not know what is there, and claiming otherwise would be intent
 /// dressed as observation.
 fn settle(chain: &mut [Link]) {
     if let Some(link) = chain.iter_mut().find(|l| l.observable && l.value.is_some()) {
         link.wins = true;

---- a_link_names_the_file_the_way_a_person_would_write_it stdout ----

thread 'a_link_names_the_file_the_way_a_person_would_write_it' (16553170) panicked at core/tests/effective_state.rs:257:5:
assertion `left == right` failed
  left: String("")
 right: String("~/.claude/settings.json")

failures:
    a_link_names_the_file_the_way_a_person_would_write_it

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
