*** core/src/adapters/claude.rs:161:5: replace winning_value -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace winning_value -> Option<String> with Some("xyzzy".into())
@@ -153,10 +153,10 @@
 /// dressed as observation.
 fn settle(chain: &mut [Link]) {
     if let Some(link) = chain.iter_mut().find(|l| l.observable && l.value.is_some()) {
         link.wins = true;
     }
 }
 
 fn winning_value(chain: &[Link]) -> Option<String> {
-    chain.iter().find(|l| l.wins).and_then(|l| l.value.clone())
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }

---- a_shell_export_wins_when_no_file_has_an_opinion stdout ----

thread 'a_shell_export_wins_when_no_file_has_an_opinion' (16554986) panicked at core/tests/effective_state.rs:119:5:
assertion `left == right` failed
  left: String("xyzzy")
 right: String("https://shell.test")

---- a_file_that_exists_but_is_silent_does_not_win stdout ----

thread 'a_file_that_exists_but_is_silent_does_not_win' (16554982) panicked at core/tests/effective_state.rs:244:5:
assertion `left == right` failed
  left: String("xyzzy")
 right: String("https://shell.test")

---- reports_the_endpoint_a_user_settings_file_sets stdout ----

thread 'reports_the_endpoint_a_user_settings_file_sets' (16554989) panicked at core/tests/effective_state.rs:23:5:
assertion `left == right` failed
  left: String("xyzzy")
 right: String("https://api.a6api.com")

failures:
    a_file_that_exists_but_is_silent_does_not_win
    a_project_config_outranks_the_user_file_and_the_chain_names_both
    a_settings_file_beats_a_shell_export
    a_shell_export_wins_when_no_file_has_an_opinion
    managed_settings_outrank_everything_on_disk
    project_local_outranks_the_shared_project_file
    reports_the_endpoint_a_user_settings_file_sets

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
