*** core/src/adapters/claude.rs:229:9: delete match arm "managed" in scope_path

*** mutation diff:
--- core/src/adapters/claude.rs
+++ delete match arm "managed" in scope_path
@@ -221,17 +221,17 @@
     match source {
         Source::Unseen { scope, why } => unseen(scope, why, ""),
         _ => unreachable!("only an Unseen source becomes an unseen link"),
     }
 }
 
 fn scope_path(env: &Env, scope: &str) -> Option<PathBuf> {
     match scope {
-        "managed" => Some(env.managed().to_path_buf()),
+         /* ~ changed by cargo-mutants ~ */
         "project local" => Some(env.project()?.join(".claude").join("settings.local.json")),
         "project" => Some(env.project()?.join(".claude").join("settings.json")),
         "user" => Some(env.home().join(".claude").join("settings.json")),
         _ => None,
     }
 }
 
 /// Paths are reported as the person would type them, so a chain reads like their filesystem.

---- managed_settings_outrank_everything_on_disk stdout ----

thread 'managed_settings_outrank_everything_on_disk' (16570457) panicked at core/tests/effective_state.rs:84:5:
assertion `left == right` failed
  left: String("https://local.test")
 right: String("https://managed.test")

failures:
    managed_settings_outrank_everything_on_disk

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
