*** core/src/adapters/claude.rs:239:5: replace display_path -> String with "xyzzy".into()

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace display_path -> String with "xyzzy".into()
@@ -231,20 +231,17 @@
         "project" => Some(env.project()?.join(".claude").join("settings.json")),
         "user" => Some(env.home().join(".claude").join("settings.json")),
         _ => None,
     }
 }
 
 /// Paths are reported as the person would type them, so a chain reads like their filesystem.
 fn display_path(path: &Path, env: &Env) -> String {
-    match path.strip_prefix(env.home()) {
-        Ok(rest) => format!("~/{}", rest.display()),
-        Err(_) => path.display().to_string(),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The highest-precedence entry that actually carries a value wins. Being consulted is not the
 /// same condition as having an opinion, and an unobservable scope can never be said to win: we
 /// do not know what is there, and claiming otherwise would be intent dressed as observation.
 fn settle(chain: &mut [Link]) {
     if let Some(link) = chain.iter_mut().find(|l| l.observable && l.value.is_some()) {
         link.wins = true;

---- a_link_names_the_file_the_way_a_person_would_write_it stdout ----

thread 'a_link_names_the_file_the_way_a_person_would_write_it' (16573788) panicked at core/tests/effective_state.rs:257:5:
assertion `left == right` failed
  left: String("xyzzy")
 right: String("~/.claude/settings.json")

failures:
    a_link_names_the_file_the_way_a_person_would_write_it

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
