*** core/src/adapters/claude.rs:251:64: replace && with || in settle

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace && with || in settle
@@ -243,17 +243,17 @@
         Err(_) => path.display().to_string(),
     }
 }
 
 /// The highest-precedence entry that actually carries a value wins. Being consulted is not the
 /// same condition as having an opinion, and an unobservable scope can never be said to win: we
 /// do not know what is there, and claiming otherwise would be intent dressed as observation.
 fn settle(chain: &mut [Link]) {
-    if let Some(link) = chain.iter_mut().find(|l| l.observable && l.value.is_some()) {
+    if let Some(link) = chain.iter_mut().find(|l| l.observable || /* ~ changed by cargo-mutants ~ */ l.value.is_some()) {
         link.wins = true;
     }
 }
 
 fn winning_value(chain: &[Link]) -> Option<String> {
     chain.iter().find(|l| l.wins).and_then(|l| l.value.clone())
 }

---- anthropic_default_model_is_the_last_word_not_the_first stdout ----

thread 'anthropic_default_model_is_the_last_word_not_the_first' (17571945) panicked at core/tests/effective_slots.rs:73:5:
assertion `left == right` failed
  left: Null
 right: String("sonnet")

---- anthropic_model_outranks_the_model_key_even_in_managed_settings stdout ----

thread 'anthropic_model_outranks_the_model_key_even_in_managed_settings' (17571946) panicked at core/tests/effective_slots.rs:48:5:
assertion `left == right` failed
  left: Null
 right: String("deepseek/v3.2")

---- the_model_key_decides_when_no_variable_is_set stdout ----

thread 'the_model_key_decides_when_no_variable_is_set' (17571950) panicked at core/tests/effective_slots.rs:58:5:
assertion `left == right` failed
  left: Null
 right: String("sonnet")

failures:
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_model_key_decides_when_no_variable_is_set
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
