*** core/src/adapters/claude.rs:257:5: replace winning_value -> Option<String> with Some(String::new())

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace winning_value -> Option<String> with Some(String::new())
@@ -249,17 +249,17 @@
 /// do not know what is there, and claiming otherwise would be intent dressed as observation.
 fn settle(chain: &mut [Link]) {
     if let Some(link) = chain.iter_mut().find(|l| l.observable && l.value.is_some()) {
         link.wins = true;
     }
 }
 
 fn winning_value(chain: &[Link]) -> Option<String> {
-    chain.iter().find(|l| l.wins).and_then(|l| l.value.clone())
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 // -------------------------------------------------------------------------------------------
 // Writing
 // -------------------------------------------------------------------------------------------
 
 use crate::json::Error as JsonError;
 use crate::profile::ToolAssignment;

---- the_model_key_decides_when_no_variable_is_set stdout ----

thread 'the_model_key_decides_when_no_variable_is_set' (17574787) panicked at core/tests/effective_slots.rs:58:5:
assertion `left == right` failed
  left: String("")
 right: String("sonnet")

---- anthropic_model_outranks_the_model_key_even_in_managed_settings stdout ----

thread 'anthropic_model_outranks_the_model_key_even_in_managed_settings' (17574783) panicked at core/tests/effective_slots.rs:48:5:
assertion `left == right` failed
  left: String("")
 right: String("deepseek/v3.2")

---- the_subagent_and_pin_slots_are_read stdout ----

thread 'the_subagent_and_pin_slots_are_read' (17574788) panicked at core/tests/effective_slots.rs:113:5:
assertion `left == right` failed
  left: String("")
 right: String("sub/model")

failures:
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 2 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
