*** core/src/adapters/claude.rs:307:26: replace == with != in plan_switch

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace == with != in plan_switch
@@ -299,17 +299,17 @@
         match assignment.slots.get(*slot).and_then(|v| v.as_ref()) {
             Some(model) => {
                 doc.set_string(&["env", var], model)?;
                 if *has_companion {
                     // Without it the tool's own picker keeps announcing Opus 5 over somebody
                     // else's model, which is making another interface lie.
                     doc.set_string(&["env", &format!("{var}_NAME")], model)?;
                 }
-                if *slot == "utility" && doc.get_string(&["env", DEPRECATED_UTILITY]).is_some() {
+                if *slot != /* ~ changed by cargo-mutants ~ */ "utility" && doc.get_string(&["env", DEPRECATED_UTILITY]).is_some() {
                     doc.set_string(&["env", DEPRECATED_UTILITY], model)?;
                 }
             }
             None => {
                 clear(&mut doc, env, var)?;
                 if *has_companion {
                     clear(&mut doc, env, &format!("{var}_NAME"))?;
                 }

---- the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present stdout ----

thread 'the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present' (17577610) panicked at core/tests/switching.rs:95:5:
{"env":{"ANTHROPIC_SMALL_FAST_MODEL":"glm-5.3","ANTHROPIC_BASE_URL":"https://api.z.ai/api/anthropic","ANTHROPIC_MODEL":"glm-5.3","ANTHROPIC_DEFAULT_HAIKU_MODEL":"glm-4.6-air"}}

failures:
    the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
