*** core/src/adapters/claude.rs:307:39: replace && with || in plan_switch

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace && with || in plan_switch
@@ -299,17 +299,17 @@
         match assignment.slots.get(*slot).and_then(|v| v.as_ref()) {
             Some(model) => {
                 doc.set_string(&["env", var], model)?;
                 if *has_companion {
                     // Without it the tool's own picker keeps announcing Opus 5 over somebody
                     // else's model, which is making another interface lie.
                     doc.set_string(&["env", &format!("{var}_NAME")], model)?;
                 }
-                if *slot == "utility" && doc.get_string(&["env", DEPRECATED_UTILITY]).is_some() {
+                if *slot == "utility" || /* ~ changed by cargo-mutants ~ */ doc.get_string(&["env", DEPRECATED_UTILITY]).is_some() {
                     doc.set_string(&["env", DEPRECATED_UTILITY], model)?;
                 }
             }
             None => {
                 clear(&mut doc, env, var)?;
                 if *has_companion {
                     clear(&mut doc, env, &format!("{var}_NAME"))?;
                 }

---- the_deprecated_variable_is_not_created_where_it_was_absent stdout ----

thread 'the_deprecated_variable_is_not_created_where_it_was_absent' (17577546) panicked at core/tests/switching.rs:113:5:
an unconditional write leaves tapkey's fingerprints where nobody asked for them

failures:
    the_deprecated_variable_is_not_created_where_it_was_absent

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.89s

*** result: Failure(101)
