*** core/src/adapters/claude.rs:76:5: replace resolve_env_var -> Result<Vec<Link>, crate::json::Error> with Ok(vec![])

*** mutation diff:
--- core/src/adapters/claude.rs
+++ replace resolve_env_var -> Result<Vec<Link>, crate::json::Error> with Ok(vec![])
@@ -68,53 +68,17 @@
 }
 
 /// Build the precedence chain for one environment variable.
 ///
 /// Every scope consulted appears, including the ones that had no opinion: "this file was read
 /// and said nothing" is part of the answer to *which file decided this*. A file that does not
 /// exist is left out, because it was never consulted.
 fn resolve_env_var(env: &Env, name: &str) -> Result<Vec<Link>, crate::json::Error> {
-    let mut chain = Vec::new();
-    for scope in PRECEDENCE.iter().chain(std::iter::once(&CLOUD)) {
-        match *scope {
-            Scope::File { name: scope_name } => {
-                let Some(path) = scope_path(env, scope_name) else {
-                    continue;
-                };
-                let Some(doc) = read_settings(&path)? else {
-                    continue;
-                };
-                chain.push(Link {
-                    source: display_path(&path, env),
-                    scope: scope_name,
-                    value: doc.get_string(&["env", name]).map(str::to_owned),
-                    observable: true,
-                    wins: false,
-                });
-            }
-            Scope::Unobservable { name: n, why } => chain.push(unobservable(n, why)),
-            Scope::Shell => chain.push(Link {
-                source: "login shell".to_string(),
-                scope: "shell",
-                // A withheld credential and an unset variable both read as no value here. The
-                // difference is a credential concern, reported as an attention rather than by
-                // pretending to know a value we deliberately did not read.
-                value: match env.shell_var(name) {
-                    Some(ShellVar::Value(v)) => Some(v.clone()),
-                    Some(ShellVar::SetButWithheld) | None => None,
-                },
-                observable: true,
-                wins: false,
-            }),
-        }
-    }
-
-    settle(&mut chain);
-    Ok(chain)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn unobservable(scope: &'static str, source: &str) -> Link {
     Link {
         source: source.to_string(),
         scope,
         value: None,
         observable: false,

---- a_shell_export_wins_when_no_file_has_an_opinion stdout ----

thread 'a_shell_export_wins_when_no_file_has_an_opinion' (16547995) panicked at core/tests/effective_state.rs:119:5:
assertion `left == right` failed
  left: Null
 right: String("https://shell.test")

---- a_settings_file_beats_a_shell_export stdout ----

thread 'a_settings_file_beats_a_shell_export' (16547994) panicked at core/tests/effective_state.rs:103:5:
assertion `left == right` failed
  left: Null
 right: String("https://file.test")

---- reports_the_endpoint_a_user_settings_file_sets stdout ----

thread 'reports_the_endpoint_a_user_settings_file_sets' (16547998) panicked at core/tests/effective_state.rs:23:5:
assertion `left == right` failed
  left: Null
 right: String("https://api.a6api.com")

failures:
    a_duplicate_key_refuses_the_whole_read
    a_file_that_exists_but_is_silent_does_not_win
    a_link_names_the_file_the_way_a_person_would_write_it
    a_project_config_outranks_the_user_file_and_the_chain_names_both
    a_settings_file_beats_a_shell_export
    a_shell_export_wins_when_no_file_has_an_opinion
    managed_settings_outrank_everything_on_disk
    project_local_outranks_the_shared_project_file
    reports_the_endpoint_a_user_settings_file_sets
    scopes_that_cannot_be_observed_are_named_rather_than_omitted
    the_chain_is_ordered_by_precedence_even_when_scopes_are_absent
    the_shell_link_says_how_it_was_obtained

test result: FAILED. 0 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
