*** core/src/fingerprint.rs:18:5: replace hash -> String with "xyzzy".into()

*** mutation diff:
--- core/src/fingerprint.rs
+++ replace hash -> String with "xyzzy".into()
@@ -10,22 +10,17 @@
 use std::io;
 use std::path::Path;
 
 /// FNV-1a, 64-bit. Not a cryptographic hash and not asked to be one: the question is whether a
 /// value changed, the comparison is against a value we wrote ourselves, and there is no
 /// adversary choosing inputs. It is deterministic across builds and platforms, which
 /// `DefaultHasher` does not promise, and that matters for something written to disk.
 pub fn hash(value: &str) -> String {
-    let mut h: u64 = 0xcbf2_9ce4_8422_2325;
-    for byte in value.as_bytes() {
-        h ^= *byte as u64;
-        h = h.wrapping_mul(0x0000_0100_0000_01b3);
-    }
-    format!("fnv1a64:{h:016x}")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// What tapkey owns right now, and what it put there.
 #[derive(Debug, Default, Serialize, Deserialize)]
 pub struct State {
     pub version: u32,
     #[serde(default)]
     pub profile: String,

---- hashes_match_the_published_vectors stdout ----

thread 'hashes_match_the_published_vectors' (17622630) panicked at core/tests/fingerprints.rs:17:9:
assertion `left == right` failed: for ""
  left: "xyzzy"
 right: "fnv1a64:cbf29ce484222325"

---- near_identical_values_hash_differently stdout ----

thread 'near_identical_values_hash_differently' (17622631) panicked at core/tests/fingerprints.rs:25:5:
assertion `left != right` failed
  left: "xyzzy"
 right: "xyzzy"

failures:
    hashes_match_the_published_vectors
    near_identical_values_hash_differently

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
