*** core/src/fingerprint.rs:20:11: replace ^= with |= in hash

*** mutation diff:
--- core/src/fingerprint.rs
+++ replace ^= with |= in hash
@@ -12,17 +12,17 @@
 
 /// FNV-1a, 64-bit. Not a cryptographic hash and not asked to be one: the question is whether a
 /// value changed, the comparison is against a value we wrote ourselves, and there is no
 /// adversary choosing inputs. It is deterministic across builds and platforms, which
 /// `DefaultHasher` does not promise, and that matters for something written to disk.
 pub fn hash(value: &str) -> String {
     let mut h: u64 = 0xcbf2_9ce4_8422_2325;
     for byte in value.as_bytes() {
-        h ^= *byte as u64;
+        h |= /* ~ changed by cargo-mutants ~ */ *byte as u64;
         h = h.wrapping_mul(0x0000_0100_0000_01b3);
     }
     format!("fnv1a64:{h:016x}")
 }
 
 /// What tapkey owns right now, and what it put there.
 #[derive(Debug, Default, Serialize, Deserialize)]
 pub struct State {

---- near_identical_values_hash_differently stdout ----

thread 'near_identical_values_hash_differently' (17621348) panicked at core/tests/fingerprints.rs:26:5:
assertion `left != right` failed
  left: "fnv1a64:d79b789b91127ff5"
 right: "fnv1a64:d79b789b91127ff5"

---- hashes_match_the_published_vectors stdout ----

thread 'hashes_match_the_published_vectors' (17621347) panicked at core/tests/fingerprints.rs:17:9:
assertion `left == right` failed: for "a"
  left: "fnv1a64:af63fd4c8602249f"
 right: "fnv1a64:af63dc4c8601ec8c"

failures:
    hashes_match_the_published_vectors
    near_identical_values_hash_differently

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
