*** core/src/fingerprint.rs:70:9: replace State::drifted -> bool with true

*** mutation diff:
--- core/src/fingerprint.rs
+++ replace State::drifted -> bool with true
@@ -62,14 +62,11 @@
             .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
         crate::atomic::write_atomically(path, &bytes, 0o600)
     }
 
     /// Whether `value` differs from what tapkey recorded writing. Unknown slots never drift:
     /// reporting drift against something we never owned would make the signal meaningless on
     /// a machine where nothing has been switched yet.
     pub fn drifted(&self, tool: &str, slot: &str, value: Option<&str>) -> bool {
-        match self.owned.get(tool).and_then(|s| s.get(slot)) {
-            Some(recorded) => value.map(hash).as_deref() != Some(recorded.as_str()),
-            None => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

---- an_unknown_slot_never_drifts stdout ----

thread 'an_unknown_slot_never_drifts' (17626474) panicked at core/tests/fingerprints.rs:33:5:
assertion failed: !state.drifted("claude", "main", Some("anything"))

---- a_state_file_that_is_not_there_reports_no_drift stdout ----

thread 'a_state_file_that_is_not_there_reports_no_drift' (17626473) panicked at core/tests/fingerprints.rs:39:5:
assertion failed: !state.drifted("claude", "main", Some("anything"))

failures:
    a_state_file_that_is_not_there_reports_no_drift
    an_unknown_slot_never_drifts

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
