*** core/src/fs.rs:105:9: replace <impl FileSystem for FailOnce>::remove -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for FailOnce>::remove -> io::Result<()> with Ok(())
@@ -97,21 +97,17 @@
         self.attempted.push(path.to_path_buf());
         if self.should_fail() {
             return Err(io::Error::other("injected write failure"));
         }
         self.real.write(path, bytes, mode)
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
-        self.attempted.push(path.to_path_buf());
-        if self.should_fail() {
-            return Err(io::Error::other("injected removal failure"));
-        }
-        self.real.remove(path)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         self.real.read(path)
     }
 
     fn mode(&self, path: &Path) -> Option<u32> {
         self.real.mode(path)

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17060264) panicked at core/tests/transaction.rs:87:5:
it did not exist before, so it must not exist after

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17060263) panicked at core/tests/transaction.rs:170:10:
the second action fails: ()

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17060255) panicked at core/tests/transaction.rs:102:10:
the second action fails: ()

failures:
    a_delete_is_undone_by_putting_the_file_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
