*** core/src/fs.rs:113:9: replace <impl FileSystem for FailOnce>::read -> io::Result<Option<Vec<u8>>> with Ok(None)

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for FailOnce>::read -> io::Result<Option<Vec<u8>>> with Ok(None)
@@ -105,15 +105,15 @@
         self.attempted.push(path.to_path_buf());
         if self.should_fail() {
             return Err(io::Error::other("injected removal failure"));
         }
         self.real.remove(path)
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
-        self.real.read(path)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn mode(&self, path: &Path) -> Option<u32> {
         self.real.mode(path)
     }
 }

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17060627) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17060635) panicked at core/tests/transaction.rs:172:38:
stat: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- a_failure_on_the_second_of_three_files_puts_the_first_one_back stdout ----

thread 'a_failure_on_the_second_of_three_files_puts_the_first_one_back' (17060628) panicked at core/tests/transaction.rs:57:34:
a: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
