*** core/src/fs.rs:27:9: replace <impl FileSystem for RealFs>::remove -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for RealFs>::remove -> io::Result<()> with Ok(())
@@ -19,20 +19,17 @@
 pub struct RealFs;
 
 impl FileSystem for RealFs {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
         write_atomically(path, bytes, mode)
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
-        match std::fs::remove_file(path) {
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
-            other => other,
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),
             Err(e) => Err(e),
         }

---- a_removal_that_fails_for_any_other_reason_is_still_an_error stdout ----

thread 'a_removal_that_fails_for_any_other_reason_is_still_an_error' (17038920) panicked at core/tests/transaction.rs:207:5:
a directory is not a file that was already gone

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17038926) panicked at core/tests/transaction.rs:87:5:
it did not exist before, so it must not exist after

failures:
    a_removal_that_fails_for_any_other_reason_is_still_an_error
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
