*** core/src/fs.rs:28:23: replace match guard e.kind() == io::ErrorKind::NotFound with false in <impl FileSystem for RealFs>::remove

*** mutation diff:
--- core/src/fs.rs
+++ replace match guard e.kind() == io::ErrorKind::NotFound with false in <impl FileSystem for RealFs>::remove
@@ -20,17 +20,17 @@
 
 impl FileSystem for RealFs {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
         write_atomically(path, bytes, mode)
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
         match std::fs::remove_file(path) {
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
+            Err(e) if false /* ~ changed by cargo-mutants ~ */ => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),

---- removing_a_file_that_is_not_there_is_not_a_failure stdout ----

thread 'removing_a_file_that_is_not_there_is_not_a_failure' (17037921) panicked at core/tests/transaction.rs:198:5:
assertion failed: fs.remove(&dir.path().join("never-existed")).is_ok()

failures:
    removing_a_file_that_is_not_there_is_not_a_failure

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
