*** core/src/fs.rs:28:32: replace == with != in <impl FileSystem for RealFs>::remove

*** mutation diff:
--- core/src/fs.rs
+++ replace == with != in <impl FileSystem for RealFs>::remove
@@ -20,17 +20,17 @@
 
 impl FileSystem for RealFs {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
         write_atomically(path, bytes, mode)
     }
 
     fn remove(&mut self, path: &Path) -> io::Result<()> {
         match std::fs::remove_file(path) {
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
+            Err(e) if e.kind() != /* ~ changed by cargo-mutants ~ */ io::ErrorKind::NotFound => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),

---- a_removal_that_fails_for_any_other_reason_is_still_an_error stdout ----

thread 'a_removal_that_fails_for_any_other_reason_is_still_an_error' (17040715) panicked at core/tests/transaction.rs:207:5:
a directory is not a file that was already gone

---- removing_a_file_that_is_not_there_is_not_a_failure stdout ----

thread 'removing_a_file_that_is_not_there_is_not_a_failure' (17040719) panicked at core/tests/transaction.rs:198:5:
assertion failed: fs.remove(&dir.path().join("never-existed")).is_ok()

failures:
    a_removal_that_fails_for_any_other_reason_is_still_an_error
    removing_a_file_that_is_not_there_is_not_a_failure

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
