*** core/src/fs.rs:36:23: replace match guard e.kind() == io::ErrorKind::NotFound with false in <impl FileSystem for RealFs>::read

*** mutation diff:
--- core/src/fs.rs
+++ replace match guard e.kind() == io::ErrorKind::NotFound with false in <impl FileSystem for RealFs>::read
@@ -28,17 +28,17 @@
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(()),
             other => other,
         }
     }
 
     fn read(&self, path: &Path) -> io::Result<Option<Vec<u8>>> {
         match std::fs::read(path) {
             Ok(bytes) => Ok(Some(bytes)),
-            Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),
+            Err(e) if false /* ~ changed by cargo-mutants ~ */ => Ok(None),
             Err(e) => Err(e),
         }
     }
 
     #[cfg(unix)]
     fn mode(&self, path: &Path) -> Option<u32> {
         use std::os::unix::fs::PermissionsExt;
         std::fs::metadata(path)

---- capturing_records_contents_and_absence_alike stdout ----

thread 'capturing_records_contents_and_absence_alike' (17047016) panicked at core/tests/transaction.rs:118:10:
capture: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- every_write_lands_when_nothing_fails stdout ----

thread 'every_write_lands_when_nothing_fails' (17047017) panicked at core/tests/transaction.rs:28:10:
apply: RolledBack { failed_at: "", reason: "could not read the files to be changed: No such file or directory (os error 2)", restored: 0 }

failures:
    capturing_records_contents_and_absence_alike
    every_write_lands_when_nothing_fails

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
