*** core/src/fs.rs:43:9: replace <impl FileSystem for RealFs>::mode -> Option<u32> with None

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for RealFs>::mode -> Option<u32> with None
@@ -35,20 +35,17 @@
             Ok(bytes) => Ok(Some(bytes)),
             Err(e) if e.kind() == io::ErrorKind::NotFound => Ok(None),
             Err(e) => Err(e),
         }
     }
 
     #[cfg(unix)]
     fn mode(&self, path: &Path) -> Option<u32> {
-        use std::os::unix::fs::PermissionsExt;
-        std::fs::metadata(path)
-            .ok()
-            .map(|m| m.permissions().mode() & 0o7777)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(not(unix))]
     fn mode(&self, _path: &Path) -> Option<u32> {
         None
     }
 }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17048547) panicked at core/tests/transaction.rs:173:5:
assertion `left == right` failed: 0o600 here would be tapkey tightening a file it does not own
  left: 384
 right: 420

failures:
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
