*** core/src/fs.rs:46:45: replace & with ^ in <impl FileSystem for RealFs>::mode

*** mutation diff:
--- core/src/fs.rs
+++ replace & with ^ in <impl FileSystem for RealFs>::mode
@@ -38,17 +38,17 @@
         }
     }
 
     #[cfg(unix)]
     fn mode(&self, path: &Path) -> Option<u32> {
         use std::os::unix::fs::PermissionsExt;
         std::fs::metadata(path)
             .ok()
-            .map(|m| m.permissions().mode() & 0o7777)
+            .map(|m| m.permissions().mode() ^ /* ~ changed by cargo-mutants ~ */ 0o7777)
     }
 
     #[cfg(not(unix))]
     fn mode(&self, _path: &Path) -> Option<u32> {
         None
     }
 }

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17052129) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 13, kind: PermissionDenied, message: "Permission denied" }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17052137) panicked at core/tests/transaction.rs:173:5:
assertion `left == right` failed: 0o600 here would be tapkey tightening a file it does not own
  left: 73
 right: 420

failures:
    a_delete_is_undone_by_putting_the_file_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
