*** core/src/fs.rs:51:9: replace <impl FileSystem for RealFs>::mode -> Option<u32> with Some(0)

*** mutation diff:
--- core/src/fs.rs
+++ replace <impl FileSystem for RealFs>::mode -> Option<u32> with Some(0)
@@ -43,17 +43,17 @@
         use std::os::unix::fs::PermissionsExt;
         std::fs::metadata(path)
             .ok()
             .map(|m| m.permissions().mode() & 0o7777)
     }
 
     #[cfg(not(unix))]
     fn mode(&self, _path: &Path) -> Option<u32> {
-        None
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Fails exactly one operation — the one after `successes` have gone through — and behaves
 /// normally before and after it.
 ///
 /// Failing everything from that point on was the first shape, and it was wrong: the rollback
 /// writes through the same filesystem, so a permanently broken one meant nothing could be put

*** result: Success
