*** core/src/fs.rs:81:9: replace FailOnce::should_fail -> bool with true

*** mutation diff:
--- core/src/fs.rs
+++ replace FailOnce::should_fail -> bool with true
@@ -73,27 +73,17 @@
             real: RealFs,
             countdown: Some(successes),
             attempted: Vec::new(),
         }
     }
 
     /// True once the injected failure has been delivered, so nothing further is refused.
     fn should_fail(&mut self) -> bool {
-        match self.countdown {
-            Some(0) => {
-                self.countdown = None;
-                true
-            }
-            Some(n) => {
-                self.countdown = Some(n - 1);
-                false
-            }
-            None => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FileSystem for FailOnce {
     fn write(&mut self, path: &Path, bytes: &[u8], mode: u32) -> io::Result<()> {
         self.attempted.push(path.to_path_buf());
         if self.should_fail() {
             return Err(io::Error::other("injected write failure"));

---- a_failure_on_the_second_of_three_files_puts_the_first_one_back stdout ----

thread 'a_failure_on_the_second_of_three_files_puts_the_first_one_back' (17055320) panicked at core/tests/transaction.rs:68:5:
assertion `left == right` failed: the report names the file that stopped it
  left: "/var/folders/6n/q9s0qd4d5b92jqqf9kk_0kdm0000gn/T/tapkey-test-tx-rollback-65193-1/a"
 right: "/var/folders/6n/q9s0qd4d5b92jqqf9kk_0kdm0000gn/T/tapkey-test-tx-rollback-65193-1/b"

failures:
    a_failure_on_the_second_of_three_files_puts_the_first_one_back

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
