*** core/src/instant.rs:17:29: replace / with % in format_utc

*** mutation diff:
--- core/src/instant.rs
+++ replace / with % in format_utc
@@ -9,17 +9,17 @@
 use std::time::{SystemTime, UNIX_EPOCH};
 
 /// `YYYYMMDDTHHMMSS.mmmZ`, always UTC.
 pub fn format_utc(t: SystemTime) -> String {
     let ms = t
         .duration_since(UNIX_EPOCH)
         .map(|d| d.as_millis())
         .unwrap_or(0);
-    let total_seconds = (ms / 1000) as i64;
+    let total_seconds = (ms % /* ~ changed by cargo-mutants ~ */ 1000) as i64;
     let millis = (ms % 1000) as u32;
 
     // Clamped above, so the calendar never sees a day before the epoch.
     let days = (total_seconds.div_euclid(86_400)) as u64;
     let secs_of_day = total_seconds.rem_euclid(86_400);
     let (year, month, day) = civil_from_days(days);
 
     format!(

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16726029) panicked at core/tests/instants.rs:36:9:
assertion `left == right` failed: at 1787866640123 ms
  left: "19700101T000203.123Z"
 right: "20260827T213720.123Z"

---- names_sort_in_the_order_the_instants_happened stdout ----

thread 'names_sort_in_the_order_the_instants_happened' (16726030) panicked at core/tests/instants.rs:69:5:
["19700101T000000.000Z", "19700101T000000.000Z", "19700101T000000.000Z", "19700101T001639.999Z"]

failures:
    formats_known_instants_compactly_and_in_utc
    names_sort_in_the_order_the_instants_happened

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
