*** core/src/instant.rs:44:48: replace - with / in civil_from_days

*** mutation diff:
--- core/src/instant.rs
+++ replace - with / in civil_from_days
@@ -36,16 +36,16 @@
 /// once every four years, and the wrong backup would then be the one evicted.
 ///
 /// The original handles days before the epoch; `format_utc` clamps there, so that branch would
 /// be unreachable code, and unreachable code that a mutation run flags is worse than absent.
 fn civil_from_days(days: u64) -> (i64, u32, u32) {
     let z = days + 719_468;
     let era = z / 146_097;
     let doe = z - era * 146_097; // [0, 146096]
-    let yoe = (doe - doe / 1460 + doe / 36_524 - doe / 146_096) / 365; // [0, 399]
+    let yoe = (doe - doe / 1460 + doe / 36_524 / /* ~ changed by cargo-mutants ~ */ doe / 146_096) / 365; // [0, 399]
     let y = yoe as i64 + era as i64 * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100); // [0, 365]
     let mp = (5 * doy + 2) / 153; // [0, 11], March-based
     let d = (doy - (153 * mp + 2) / 5 + 1) as u32; // [1, 31]
     let m = if mp < 10 { mp + 3 } else { mp - 9 } as u32; // [1, 12]
     (if m <= 2 { y + 1 } else { y }, m, d)
 }

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16747832) panicked at core/src/instant.rs:44:35:
attempt to divide by zero

failures:
    formats_known_instants_compactly_and_in_utc

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
