*** core/src/instant.rs:45:24: replace + with * in civil_from_days

*** mutation diff:
--- core/src/instant.rs
+++ replace + with * in civil_from_days
@@ -37,15 +37,15 @@
 ///
 /// The original handles days before the epoch; `format_utc` clamps there, so that branch would
 /// be unreachable code, and unreachable code that a mutation run flags is worse than absent.
 fn civil_from_days(days: u64) -> (i64, u32, u32) {
     let z = days + 719_468;
     let era = z / 146_097;
     let doe = z - era * 146_097; // [0, 146096]
     let yoe = (doe - doe / 1460 + doe / 36_524 - doe / 146_096) / 365; // [0, 399]
-    let y = yoe as i64 + era as i64 * 400;
+    let y = yoe as i64 * /* ~ changed by cargo-mutants ~ */ era as i64 * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100); // [0, 365]
     let mp = (5 * doy + 2) / 153; // [0, 11], March-based
     let d = (doy - (153 * mp + 2) / 5 + 1) as u32; // [1, 31]
     let m = if mp < 10 { mp + 3 } else { mp - 9 } as u32; // [1, 12]
     (if m <= 2 { y + 1 } else { y }, m, d)
 }

---- names_sort_in_the_order_the_instants_happened stdout ----

thread 'names_sort_in_the_order_the_instants_happened' (16756907) panicked at core/tests/instants.rs:69:5:
["460001231T235959.999Z", "460010101T000000.000Z", "460010229T000000.000Z", "520010101T000000.000Z"]

---- the_epoch_itself_is_the_first_possible_name stdout ----

thread 'the_epoch_itself_is_the_first_possible_name' (16756908) panicked at core/tests/instants.rs:46:5:
assertion `left == right` failed
  left: "5904010101T000000.000Z"
 right: "19700101T000000.000Z"

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16756906) panicked at core/tests/instants.rs:36:9:
assertion `left == right` failed: at 1787866640123 ms
  left: "520000827T213720.123Z"
 right: "20260827T213720.123Z"

failures:
    formats_known_instants_compactly_and_in_utc
    names_sort_in_the_order_the_instants_happened
    the_epoch_itself_is_the_first_possible_name

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
