*** core/src/instant.rs:48:30: replace + with * in civil_from_days

*** mutation diff:
--- core/src/instant.rs
+++ replace + with * in civil_from_days
@@ -40,12 +40,12 @@
 fn civil_from_days(days: u64) -> (i64, u32, u32) {
     let z = days + 719_468;
     let era = z / 146_097;
     let doe = z - era * 146_097; // [0, 146096]
     let yoe = (doe - doe / 1460 + doe / 36_524 - doe / 146_096) / 365; // [0, 399]
     let y = yoe as i64 + era as i64 * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100); // [0, 365]
     let mp = (5 * doy + 2) / 153; // [0, 11], March-based
-    let d = (doy - (153 * mp + 2) / 5 + 1) as u32; // [1, 31]
+    let d = (doy - (153 * mp * /* ~ changed by cargo-mutants ~ */ 2) / 5 + 1) as u32; // [1, 31]
     let m = if mp < 10 { mp + 3 } else { mp - 9 } as u32; // [1, 12]
     (if m <= 2 { y + 1 } else { y }, m, d)
 }

---- the_epoch_itself_is_the_first_possible_name stdout ----

thread 'the_epoch_itself_is_the_first_possible_name' (16778412) panicked at core/src/instant.rs:48:14:
attempt to subtract with overflow

---- a_name_carries_no_character_windows_forbids stdout ----

thread 'a_name_carries_no_character_windows_forbids' (16778409) panicked at core/src/instant.rs:48:14:
attempt to subtract with overflow

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16778410) panicked at core/src/instant.rs:48:14:
attempt to subtract with overflow

failures:
    a_name_carries_no_character_windows_forbids
    formats_known_instants_compactly_and_in_utc
    names_sort_in_the_order_the_instants_happened
    the_epoch_itself_is_the_first_possible_name

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
