*** core/src/instant.rs:49:19: replace < with == in civil_from_days

*** mutation diff:
--- core/src/instant.rs
+++ replace < with == in civil_from_days
@@ -41,11 +41,11 @@
     let z = days + 719_468;
     let era = z / 146_097;
     let doe = z - era * 146_097; // [0, 146096]
     let yoe = (doe - doe / 1460 + doe / 36_524 - doe / 146_096) / 365; // [0, 399]
     let y = yoe as i64 + era as i64 * 400;
     let doy = doe - (365 * yoe + yoe / 4 - yoe / 100); // [0, 365]
     let mp = (5 * doy + 2) / 153; // [0, 11], March-based
     let d = (doy - (153 * mp + 2) / 5 + 1) as u32; // [1, 31]
-    let m = if mp < 10 { mp + 3 } else { mp - 9 } as u32; // [1, 12]
+    let m = if mp == /* ~ changed by cargo-mutants ~ */ 10 { mp + 3 } else { mp - 9 } as u32; // [1, 12]
     (if m <= 2 { y + 1 } else { y }, m, d)
 }

---- the_epoch_itself_is_the_first_possible_name stdout ----

thread 'the_epoch_itself_is_the_first_possible_name' (16780623) panicked at core/tests/instants.rs:46:5:
assertion `left == right` failed
  left: "19691301T000000.000Z"
 right: "19700101T000000.000Z"

---- names_sort_in_the_order_the_instants_happened stdout ----

thread 'names_sort_in_the_order_the_instants_happened' (16780622) panicked at core/tests/instants.rs:69:5:
["20231301T000000.000Z", "20240031T235959.999Z", "20240229T000000.000Z", "20261301T000000.000Z"]

---- formats_known_instants_compactly_and_in_utc stdout ----

thread 'formats_known_instants_compactly_and_in_utc' (16780621) panicked at core/src/instant.rs:49:78:
attempt to subtract with overflow

failures:
    a_name_carries_no_character_windows_forbids
    formats_known_instants_compactly_and_in_utc
    names_sort_in_the_order_the_instants_happened
    the_epoch_itself_is_the_first_possible_name

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
