*** core/src/json.rs:103:9: replace Document::remove -> Result<(), Error> with Ok(())

*** mutation diff:
--- core/src/json.rs
+++ replace Document::remove -> Result<(), Error> with Ok(())
@@ -95,38 +95,17 @@
         let (range, replacement) = self.plan_set(path, value)?;
         self.splice(range, &replacement)
     }
 
     /// Remove the key at `path`, taking the separator and whitespace its insertion added.
     /// Anything less and adding then removing the same key would leave a trail, so idempotence
     /// would hold only by luck. A path that is not there is a no-op, not a failure.
     pub fn remove(&mut self, path: &[&str]) -> Result<(), Error> {
-        let Some((parent, m)) = parent_and_member(&self.root, path) else {
-            return Ok(());
-        };
-        let Node::Object { members, span } = parent else {
-            return Ok(());
-        };
-        let index = members
-            .iter()
-            .position(|x| x.span == m.span)
-            .expect("the member came from these members");
-
-        let range = if members.len() == 1 {
-            // The only member: take everything between the braces, leaving `{}` as authored.
-            span.start + 1..span.end - 1
-        } else if index + 1 < members.len() {
-            // Not the last: swallow forward to the next member's start, comma included.
-            m.span.start..members[index + 1].span.start
-        } else {
-            // The last: swallow backwards to the previous member's end.
-            members[index - 1].span.end..m.span.end
-        };
-        self.splice(range, b"")
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The document's current bytes.
     pub fn to_bytes(&self) -> Vec<u8> {
         self.bytes.clone()
     }
 
     fn splice(&mut self, range: Range<usize>, replacement: &[u8]) -> Result<(), Error> {

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17382108) panicked at core/tests/json_document.rs:332:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\"\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\"\n  }\n}\n"

---- removing_the_first_of_several_keys_takes_its_trailing_comma stdout ----

thread 'removing_the_first_of_several_keys_takes_its_trailing_comma' (17382119) panicked at core/tests/json_document.rs:353:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 34, 49, 34, 44, 34, 98, 34, 58, 34, 50, 34, 125]
 right: [123, 34, 98, 34, 58, 34, 50, 34, 125]

---- removing_the_only_key_leaves_an_empty_object stdout ----

thread 'removing_the_only_key_leaves_an_empty_object' (17382120) panicked at core/tests/json_document.rs:344:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 125, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 125, 125]

failures:
    adding_then_removing_a_key_leaves_the_file_byte_identical
    removing_the_first_of_several_keys_takes_its_trailing_comma
    removing_the_only_key_leaves_an_empty_object

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
