*** core/src/json.rs:104:9: replace Document::to_bytes -> Vec<u8> with vec![]

*** mutation diff:
--- core/src/json.rs
+++ replace Document::to_bytes -> Vec<u8> with vec![]
@@ -96,28 +96,17 @@
             _ => Err(Error::NotAString {
                 path: path.join("."),
             }),
         }
     }
 
     /// The document's bytes with every pending splice applied.
     pub fn to_bytes(&self) -> Vec<u8> {
-        let mut ordered: Vec<&Splice> = self.splices.iter().collect();
-        ordered.sort_by_key(|s| s.range.start);
-
-        let mut out = Vec::with_capacity(self.original.len());
-        let mut cursor = 0usize;
-        for splice in ordered {
-            out.extend_from_slice(&self.original[cursor..splice.range.start]);
-            out.extend_from_slice(&splice.replacement);
-            cursor = splice.range.end;
-        }
-        out.extend_from_slice(&self.original[cursor..]);
-        out
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn record(&mut self, range: Range<usize>, replacement: Vec<u8>) {
         // Setting the same place twice replaces the earlier intent rather than stacking on it.
         self.splices.retain(|s| s.range != range);
         self.splices.push(Splice { range, replacement });
     }
 }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16486114) panicked at core/tests/json_document.rs:79:5:
assertion `left == right` failed
  left: []
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 98, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

---- a_path_that_is_not_there_is_reported_rather_than_created stdout ----

thread 'a_path_that_is_not_there_is_reported_rather_than_created' (16486116) panicked at core/tests/json_document.rs:201:5:
assertion `left == right` failed: and nothing moved
  left: []
 right: [123, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16486120) panicked at core/tests/json_document.rs:146:5:
assertion `left == right` failed
  left: []
 right: [123, 34, 116, 114, 105, 99, 107, 121, 34, 58, 34, 125, 32, 44, 32, 123, 32, 92, 34, 32, 93, 34, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 108, 105, 103, 104, 116, 34, 125]

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 5 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
