*** core/src/json.rs:117:29: replace < with <= in Document::remove

*** mutation diff:
--- core/src/json.rs
+++ replace < with <= in Document::remove
@@ -109,17 +109,17 @@
         let index = members
             .iter()
             .position(|x| x.span == m.span)
             .expect("the member came from these members");
 
         let range = if members.len() == 1 {
             // The only member: take everything between the braces, leaving `{}` as authored.
             span.start + 1..span.end - 1
-        } else if index + 1 < members.len() {
+        } else if index + 1 <= /* ~ changed by cargo-mutants ~ */ members.len() {
             // Not the last: swallow forward to the next member's start, comma included.
             m.span.start..members[index + 1].span.start
         } else {
             // The last: swallow backwards to the previous member's end.
             members[index - 1].span.end..m.span.end
         };
         self.splice(range, b"")
     }

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17391803) panicked at core/src/json.rs:119:34:
index out of bounds: the len is 2 but the index is 2

failures:
    adding_then_removing_a_key_leaves_the_file_byte_identical

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
