*** core/src/json.rs:120:41: replace != with == in Document::record

*** mutation diff:
--- core/src/json.rs
+++ replace != with == in Document::record
@@ -112,17 +112,17 @@
             cursor = splice.range.end;
         }
         out.extend_from_slice(&self.original[cursor..]);
         out
     }
 
     fn record(&mut self, range: Range<usize>, replacement: Vec<u8>) {
         // Setting the same place twice replaces the earlier intent rather than stacking on it.
-        self.splices.retain(|s| s.range != range);
+        self.splices.retain(|s| s.range == /* ~ changed by cargo-mutants ~ */ range);
         self.splices.push(Splice { range, replacement });
     }
 }
 
 fn resolve<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Node> {
     let Some((head, rest)) = path.split_first() else {
         return Some(node);
     };

---- setting_one_key_twice_keeps_only_the_last_value stdout ----

thread 'setting_one_key_twice_keeps_only_the_last_value' (16487571) panicked at core/src/json.rs:110:49:
slice index starts at 15 but ends at 9

failures:
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
