*** core/src/json.rs:133:9: replace Document::splice -> Result<(), Error> with Ok(())

*** mutation diff:
--- core/src/json.rs
+++ replace Document::splice -> Result<(), Error> with Ok(())
@@ -125,23 +125,17 @@
     }
 
     /// The document's current bytes.
     pub fn to_bytes(&self) -> Vec<u8> {
         self.bytes.clone()
     }
 
     fn splice(&mut self, range: Range<usize>, replacement: &[u8]) -> Result<(), Error> {
-        let mut next = Vec::with_capacity(self.bytes.len() + replacement.len());
-        next.extend_from_slice(&self.bytes[..range.start]);
-        next.extend_from_slice(replacement);
-        next.extend_from_slice(&self.bytes[range.end..]);
-        self.root = parse_root(&next)?;
-        self.bytes = next;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Where to splice, and what to put there, for one set.
     fn plan_set(&self, path: &[&str], value: &str) -> Result<(Range<usize>, Vec<u8>), Error> {
         // The whole path is already there: replace the value in place.
         if let Some(existing) = member(&self.root, path) {
             return Ok((existing.value.span(), encode_string(value)));
         }

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17401878) panicked at core/tests/json_document.rs:287:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 32, 34, 49, 34, 125]
 right: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 32, 34, 98, 34, 58, 32, 34, 50, 34, 125]

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17401875) panicked at core/tests/json_document.rs:210:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 34, 120, 34, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (17401879) panicked at core/tests/json_document.rs:91:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 97, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 77, 79, 68, 69, 76, 34, 58, 34, 98, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

failures:
    a_control_character_in_a_written_value_is_escaped
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    an_empty_object_receives_its_first_key
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure

test result: FAILED. 12 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
