*** core/src/json.rs:139:5: replace encode_string -> Vec<u8> with vec![1]

*** mutation diff:
--- core/src/json.rs
+++ replace encode_string -> Vec<u8> with vec![1]
@@ -131,36 +131,17 @@
     };
     let member = members.iter().find(|m| m.key == *head)?;
     resolve(&member.value, rest)
 }
 
 /// Only what the format requires: a value tapkey writes must not arrive in the file more
 /// escaped than the user's own values are.
 fn encode_string(value: &str) -> Vec<u8> {
-    let mut out = Vec::with_capacity(value.len() + 2);
-    out.push(b'"');
-    for ch in value.chars() {
-        match ch {
-            '"' => out.extend_from_slice(b"\\\""),
-            '\\' => out.extend_from_slice(b"\\\\"),
-            '\n' => out.extend_from_slice(b"\\n"),
-            '\r' => out.extend_from_slice(b"\\r"),
-            '\t' => out.extend_from_slice(b"\\t"),
-            c if (c as u32) < 0x20 => {
-                out.extend_from_slice(format!("\\u{:04x}", c as u32).as_bytes())
-            }
-            c => {
-                let mut buf = [0u8; 4];
-                out.extend_from_slice(c.encode_utf8(&mut buf).as_bytes())
-            }
-        }
-    }
-    out.push(b'"');
-    out
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }
 
 struct Parser<'a> {
     b: &'a [u8],
     i: usize,
 }
 
 impl<'a> Parser<'a> {

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16489330) panicked at core/tests/json_document.rs:162:5:
assertion `left == right` failed
  left: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \u{1}\n}"
 right: "{\n  \"permissions\": { \"allow\": [\"Bash(ls:*)\", \"Read\", { \"tool\": \"Edit\", \"paths\": [1, 2.5, -3e2] }], \"deny\": [] },\n  \"theme\": \"light\"\n}"

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16489323) panicked at core/tests/json_document.rs:183:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 1, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16489331) panicked at core/tests/json_document.rs:146:5:
assertion `left == right` failed
  left: [123, 34, 116, 114, 105, 99, 107, 121, 34, 58, 34, 125, 32, 44, 32, 123, 32, 92, 34, 32, 93, 34, 44, 34, 116, 104, 101, 109, 101, 34, 58, 1, 125]
 right: [123, 34, 116, 114, 105, 99, 107, 121, 34, 58, 34, 125, 32, 44, 32, 123, 32, 92, 34, 32, 93, 34, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 108, 105, 103, 104, 116, 34, 125]

failures:
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    setting_the_same_value_twice_is_byte_identical
    strings_holding_escapes_survive_untouched

test result: FAILED. 7 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
