*** core/src/json.rs:148:29: replace < with <= in encode_string

*** mutation diff:
--- core/src/json.rs
+++ replace < with <= in encode_string
@@ -140,17 +140,17 @@
     out.push(b'"');
     for ch in value.chars() {
         match ch {
             '"' => out.extend_from_slice(b"\\\""),
             '\\' => out.extend_from_slice(b"\\\\"),
             '\n' => out.extend_from_slice(b"\\n"),
             '\r' => out.extend_from_slice(b"\\r"),
             '\t' => out.extend_from_slice(b"\\t"),
-            c if (c as u32) < 0x20 => {
+            c if (c as u32) <= /* ~ changed by cargo-mutants ~ */ 0x20 => {
                 out.extend_from_slice(format!("\\u{:04x}", c as u32).as_bytes())
             }
             c => {
                 let mut buf = [0u8; 4];
                 out.extend_from_slice(c.encode_utf8(&mut buf).as_bytes())
             }
         }
     }

---- non_ascii_passes_through_as_utf8_rather_than_being_escaped stdout ----

thread 'non_ascii_passes_through_as_utf8_rather_than_being_escaped' (16491234) panicked at core/tests/json_document.rs:88:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 34, 208, 188, 208, 190, 208, 180, 208, 181, 208, 187, 209, 140, 92, 117, 48, 48, 50, 48, 194, 171, 208, 177, 209, 139, 209, 129, 209, 130, 209, 128, 208, 176, 209, 143, 194, 187, 34, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 208, 188, 208, 190, 208, 180, 208, 181, 208, 187, 209, 140, 32, 194, 171, 208, 177, 209, 139, 209, 129, 209, 130, 209, 128, 208, 176, 209, 143, 194, 187, 34, 125]

failures:
    non_ascii_passes_through_as_utf8_rather_than_being_escaped

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
