*** core/src/json.rs:154:21: replace < with == in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace < with == in Document::plan_set
@@ -146,17 +146,17 @@
             return Ok((existing.value.span(), encode_string(value)));
         }
 
         // Walk as far as the file goes, then build what is missing as one nested literal.
         // The full path having been ruled out above, this loop always breaks before `depth`
         // reaches the end — which is why a mutation widening the bound survives it.
         let mut node = &self.root;
         let mut depth = 0;
-        while depth < path.len() {
+        while depth == /* ~ changed by cargo-mutants ~ */ path.len() {
             let Node::Object { members, .. } = node else {
                 return Err(Error::NotAnObject {
                     path: path[..depth].join("."),
                 });
             };
             match members.iter().find(|m| m.key == path[depth]) {
                 Some(m) => {
                     node = &m.value;

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17403164) panicked at core/tests/json_document.rs:273:40:
set: DuplicateKey { offset: 32, key: "env" }

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17403168) panicked at core/tests/json_document.rs:261:40:
set: DuplicateKey { offset: 47, key: "env" }

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17403170) panicked at core/tests/json_document.rs:325:44:
set: DuplicateKey { offset: 33, key: "env" }

failures:
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 28 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
