*** core/src/json.rs:183:32: replace + with * in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ replace + with * in Document::plan_set
@@ -175,17 +175,17 @@
             &self.bytes,
             members,
             span,
             document_step(&self.bytes, &self.root),
         );
         let literal = style.nested(&path[depth..], value);
         let at = match members.last() {
             Some(last) => last.span.end,
-            None => span.start + 1,
+            None => span.start * /* ~ changed by cargo-mutants ~ */ 1,
         };
         let mut out = Vec::new();
         if !members.is_empty() {
             out.push(b',');
         }
         out.extend_from_slice(&literal);
         if members.is_empty() {
             out.extend_from_slice(style.close.as_bytes());

---- an_empty_object_receives_its_first_key stdout ----

thread 'an_empty_object_receives_its_first_key' (17410060) panicked at core/tests/json_document.rs:294:40:
set: Syntax { offset: 19, message: "a comma or a closing brace was expected" }

failures:
    an_empty_object_receives_its_first_key

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
