*** core/src/json.rs:186:12: delete ! in Document::plan_set

*** mutation diff:
--- core/src/json.rs
+++ delete ! in Document::plan_set
@@ -178,17 +178,17 @@
             document_step(&self.bytes, &self.root),
         );
         let literal = style.nested(&path[depth..], value);
         let at = match members.last() {
             Some(last) => last.span.end,
             None => span.start + 1,
         };
         let mut out = Vec::new();
-        if !members.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */members.is_empty() {
             out.push(b',');
         }
         out.extend_from_slice(&literal);
         if members.is_empty() {
             out.extend_from_slice(style.close.as_bytes());
         }
         Ok((at..at, out))
     }

---- a_nested_object_created_in_a_minified_file_stays_inline stdout ----

thread 'a_nested_object_created_in_a_minified_file_stays_inline' (17411124) panicked at core/tests/json_document.rs:418:10:
set: Syntax { offset: 15, message: "a comma or a closing brace was expected" }

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17411122) panicked at core/tests/json_document.rs:310:10:
set: Syntax { offset: 22, message: "a comma or a closing brace was expected" }

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17411119) panicked at core/tests/json_document.rs:285:33:
set: Syntax { offset: 10, message: "a comma or a closing brace was expected" }

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 23 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
