*** core/src/json.rs:206:16: replace += with *= in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::object
@@ -198,17 +198,17 @@
                 })
             }
             None => Err(self.error("a value was expected")),
         }
     }
 
     fn object(&mut self) -> Result<Node, Error> {
         let start = self.i;
-        self.i += 1; // '{'
+        self.i *= /* ~ changed by cargo-mutants ~ */ 1; // '{'
         let mut members = Vec::new();
         loop {
             self.skip_whitespace();
             match self.b.get(self.i) {
                 Some(b'}') => {
                     self.i += 1;
                     return Ok(Node::Object {
                         members,

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (16492722) panicked at core/tests/json_document.rs:47:44:
parse: Syntax { offset: 3, message: "a key or a closing brace was expected" }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16492723) panicked at core/tests/json_document.rs:179:55:
parse: Syntax { offset: 0, message: "a key or a closing brace was expected" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16492725) panicked at core/tests/json_document.rs:75:89:
parse: Syntax { offset: 0, message: "a key or a closing brace was expected" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
