*** core/src/json.rs:216:43: replace + with - in Style::of

*** mutation diff:
--- core/src/json.rs
+++ replace + with - in Style::of
@@ -208,17 +208,17 @@
 }
 
 impl Style {
     fn of(bytes: &[u8], members: &[Member], span: &Range<usize>, step: String) -> Style {
         let text = |r: Range<usize>| String::from_utf8_lossy(&bytes[r]).into_owned();
 
         if let Some(first) = members.first() {
             let colon = text(first.key_span.end..first.value.span().start);
-            let opening = text(span.start + 1..first.span.start);
+            let opening = text(span.start - /* ~ changed by cargo-mutants ~ */ 1..first.span.start);
             // Two members show exactly what goes between them; one member can only be
             // inferred from. A file that writes `"a": 1` would write `, "b": 2`, and a
             // minified one would not.
             let lead = match members.get(1) {
                 Some(second) => text(first.span.end + 1..second.span.start),
                 None if !opening.is_empty() => opening.clone(),
                 None if colon.ends_with(' ') => " ".to_string(),
                 None => String::new(),

---- a_nested_object_created_in_a_minified_file_stays_inline stdout ----

thread 'a_nested_object_created_in_a_minified_file_stays_inline' (17412035) panicked at core/src/json.rs:216:32:
attempt to subtract with overflow

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17412032) panicked at core/tests/json_document.rs:273:40:
set: Syntax { offset: 16, message: "a key or a closing brace was expected" }

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17412030) panicked at core/src/json.rs:216:32:
attempt to subtract with overflow

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical

test result: FAILED. 25 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
