*** core/src/json.rs:218:17: delete match arm Some(b'"') in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ delete match arm Some(b'"') in Parser<'a>::object
@@ -210,17 +210,17 @@
             match self.b.get(self.i) {
                 Some(b'}') => {
                     self.i += 1;
                     return Ok(Node::Object {
                         members,
                         span: start..self.i,
                     });
                 }
-                Some(b'"') => {}
+                 /* ~ changed by cargo-mutants ~ */
                 _ => return Err(self.error("a key or a closing brace was expected")),
             }
             let key_start = self.i;
             let key = self.string()?;
             let key_span = key_start..self.i;
 
             self.skip_whitespace();
             if self.b.get(self.i) != Some(&b':') {

---- arrays_are_preserved_including_nested_ones stdout ----

thread 'arrays_are_preserved_including_nested_ones' (16493474) panicked at core/tests/json_document.rs:157:43:
parse: Syntax { offset: 4, message: "a key or a closing brace was expected" }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16493467) panicked at core/tests/json_document.rs:179:55:
parse: Syntax { offset: 1, message: "a key or a closing brace was expected" }

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16493475) panicked at core/tests/json_document.rs:142:43:
parse: Syntax { offset: 1, message: "a key or a closing brace was expected" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
