*** core/src/json.rs:221:53: replace + with * in Style::of

*** mutation diff:
--- core/src/json.rs
+++ replace + with * in Style::of
@@ -213,17 +213,17 @@
 
         if let Some(first) = members.first() {
             let colon = text(first.key_span.end..first.value.span().start);
             let opening = text(span.start + 1..first.span.start);
             // Two members show exactly what goes between them; one member can only be
             // inferred from. A file that writes `"a": 1` would write `, "b": 2`, and a
             // minified one would not.
             let lead = match members.get(1) {
-                Some(second) => text(first.span.end + 1..second.span.start),
+                Some(second) => text(first.span.end * /* ~ changed by cargo-mutants ~ */ 1..second.span.start),
                 None if !opening.is_empty() => opening.clone(),
                 None if colon.ends_with(' ') => " ".to_string(),
                 None => String::new(),
             };
             return Style {
                 lead,
                 colon,
                 // Only an object with no members needs a closing lead; this one has some.

---- a_new_key_joins_its_siblings_in_their_own_style_and_goes_last stdout ----

thread 'a_new_key_joins_its_siblings_in_their_own_style_and_goes_last' (17419054) panicked at core/tests/json_document.rs:261:40:
set: Syntax { offset: 40, message: "a key or a closing brace was expected" }

failures:
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
