*** core/src/json.rs:223:25: replace match guard colon.ends_with(' ') with true in Style::of

*** mutation diff:
--- core/src/json.rs
+++ replace match guard colon.ends_with(' ') with true in Style::of
@@ -215,17 +215,17 @@
             let colon = text(first.key_span.end..first.value.span().start);
             let opening = text(span.start + 1..first.span.start);
             // Two members show exactly what goes between them; one member can only be
             // inferred from. A file that writes `"a": 1` would write `, "b": 2`, and a
             // minified one would not.
             let lead = match members.get(1) {
                 Some(second) => text(first.span.end + 1..second.span.start),
                 None if !opening.is_empty() => opening.clone(),
-                None if colon.ends_with(' ') => " ".to_string(),
+                None if true /* ~ changed by cargo-mutants ~ */ => " ".to_string(),
                 None => String::new(),
             };
             return Style {
                 lead,
                 colon,
                 // Only an object with no members needs a closing lead; this one has some.
                 close: String::new(),
                 step,

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17415997) panicked at core/tests/json_document.rs:275:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 44, 32, 34, 66, 34, 58, 34, 50, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 44, 34, 66, 34, 58, 34, 50, 34, 125, 44, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 125]

---- a_nested_object_created_in_a_minified_file_stays_inline stdout ----

thread 'a_nested_object_created_in_a_minified_file_stays_inline' (17416000) panicked at core/tests/json_document.rs:420:5:
assertion `left == right` failed
  left: [123, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 44, 32, 34, 101, 110, 118, 34, 58, 123, 32, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 66, 65, 83, 69, 95, 85, 82, 76, 34, 58, 34, 104, 116, 116, 112, 115, 58, 47, 47, 120, 46, 116, 101, 115, 116, 34, 32, 125, 125]
 right: [123, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 44, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 66, 65, 83, 69, 95, 85, 82, 76, 34, 58, 34, 104, 116, 116, 112, 115, 58, 47, 47, 120, 46, 116, 101, 115, 116, 34, 125, 125]

failures:
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_nested_object_created_in_a_minified_file_stays_inline

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
