*** core/src/json.rs:258:9: replace Style::nested -> Vec<u8> with vec![]

*** mutation diff:
--- core/src/json.rs
+++ replace Style::nested -> Vec<u8> with vec![]
@@ -250,20 +250,17 @@
                 close: String::new(),
                 step,
             }
         }
     }
 
     /// `"a": {"b": {"c": value}}`, laid out the way this file lays things out.
     fn nested(&self, path: &[&str], value: &str) -> Vec<u8> {
-        let mut out = Vec::new();
-        out.extend_from_slice(self.lead.as_bytes());
-        self.build(path, value, &self.lead, &mut out);
-        out
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn build(&self, path: &[&str], value: &str, lead: &str, out: &mut Vec<u8>) {
         let (head, rest) = path
             .split_first()
             .expect("a path with at least one segment");
         out.extend_from_slice(&encode_string(head));
         out.extend_from_slice(self.colon.as_bytes());

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17420878) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\",\n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17420882) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
  left: "{\n  \"theme\": \"dark\",\n}\n"
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17420879) panicked at core/tests/json_document.rs:287:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 125]
 right: [123, 34, 97, 34, 58, 32, 34, 49, 34, 44, 32, 34, 98, 34, 58, 32, 34, 50, 34, 125]

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 23 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
