*** core/src/json.rs:265:9: replace Style::build with ()

*** mutation diff:
--- core/src/json.rs
+++ replace Style::build with ()
@@ -257,35 +257,17 @@
     fn nested(&self, path: &[&str], value: &str) -> Vec<u8> {
         let mut out = Vec::new();
         out.extend_from_slice(self.lead.as_bytes());
         self.build(path, value, &self.lead, &mut out);
         out
     }
 
     fn build(&self, path: &[&str], value: &str, lead: &str, out: &mut Vec<u8>) {
-        let (head, rest) = path
-            .split_first()
-            .expect("a path with at least one segment");
-        out.extend_from_slice(&encode_string(head));
-        out.extend_from_slice(self.colon.as_bytes());
-        if rest.is_empty() {
-            out.extend_from_slice(&encode_string(value));
-            return;
-        }
-        let inner = if lead.contains('\n') {
-            format!("{lead}{}", self.step)
-        } else {
-            lead.to_string()
-        };
-        out.push(b'{');
-        out.extend_from_slice(inner.as_bytes());
-        self.build(rest, value, &inner, out);
-        out.extend_from_slice(lead.as_bytes());
-        out.push(b'}');
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The whitespace run immediately before `offset`, back to the start of its line.
 fn indentation_before(bytes: &[u8], offset: usize) -> String {
     let line_start = bytes[..offset]
         .iter()
         .rposition(|b| *b == b'\n')

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17424015) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
  left: "{\n  \"theme\": \"dark\",\n  \n}\n"
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17424011) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\",\n    \n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

---- a_nested_object_created_in_a_minified_file_stays_inline stdout ----

thread 'a_nested_object_created_in_a_minified_file_stays_inline' (17424017) panicked at core/tests/json_document.rs:420:5:
assertion `left == right` failed
  left: [123, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 44, 125]
 right: [123, 34, 116, 104, 101, 109, 101, 34, 58, 34, 100, 97, 114, 107, 34, 44, 34, 101, 110, 118, 34, 58, 123, 34, 65, 78, 84, 72, 82, 79, 80, 73, 67, 95, 66, 65, 83, 69, 95, 85, 82, 76, 34, 58, 34, 104, 116, 116, 112, 115, 58, 47, 47, 120, 46, 116, 101, 115, 116, 34, 125, 125]

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 23 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
