*** core/src/json.rs:283:9: replace Parser<'a>::string -> Result<String, Error> with Ok(String::new())

*** mutation diff:
--- core/src/json.rs
+++ replace Parser<'a>::string -> Result<String, Error> with Ok(String::new())
@@ -275,73 +275,17 @@
                 Some(b',') => self.i += 1,
                 Some(b']') => {}
                 _ => return Err(self.error("a comma or a closing bracket was expected")),
             }
         }
     }
 
     fn string(&mut self) -> Result<String, Error> {
-        if self.b.get(self.i) != Some(&b'"') {
-            return Err(self.error("a string was expected"));
-        }
-        self.i += 1;
-        let mut out = String::new();
-        loop {
-            match self.b.get(self.i) {
-                None => return Err(self.error("an unterminated string")),
-                Some(b'"') => {
-                    self.i += 1;
-                    return Ok(out);
-                }
-                Some(b'\\') => {
-                    self.i += 1;
-                    let escaped = *self.b.get(self.i).ok_or_else(|| self.error("a truncated escape"))?;
-                    self.i += 1;
-                    match escaped {
-                        b'"' => out.push('"'),
-                        b'\\' => out.push('\\'),
-                        b'/' => out.push('/'),
-                        b'b' => out.push('\u{8}'),
-                        b'f' => out.push('\u{c}'),
-                        b'n' => out.push('\n'),
-                        b'r' => out.push('\r'),
-                        b't' => out.push('\t'),
-                        b'u' => {
-                            let hex = self
-                                .b
-                                .get(self.i..self.i + 4)
-                                .ok_or_else(|| self.error("a truncated \\u escape"))?;
-                            let code = u32::from_str_radix(
-                                std::str::from_utf8(hex).map_err(|_| self.error("a bad \\u escape"))?,
-                                16,
-                            )
-                            .map_err(|_| self.error("a bad \\u escape"))?;
-                            self.i += 4;
-                            // A lone surrogate is kept as the replacement character: the key it
-                            // names still matches, and tapkey never writes this value back.
-                            out.push(char::from_u32(code).unwrap_or('\u{FFFD}'));
-                        }
-                        _ => return Err(self.error("an unknown escape")),
-                    }
-                }
-                Some(&byte) => {
-                    let start = self.i;
-                    while matches!(self.b.get(self.i), Some(&c) if c != b'"' && c != b'\\') {
-                        self.i += 1;
-                    }
-                    let raw = &self.b[start..self.i];
-                    out.push_str(std::str::from_utf8(raw).map_err(|_| Error::Syntax {
-                        offset: start,
-                        message: "a string holds bytes that are not UTF-8".to_string(),
-                    })?);
-                    let _ = byte;
-                }
-            }
-        }
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn scalar(&mut self) -> Result<(), Error> {
         let start = self.i;
         while matches!(
             self.b.get(self.i),
             Some(c) if !matches!(c, b',' | b'}' | b']' | b' ' | b'\t' | b'\n' | b'\r')
         ) {

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (16501301) panicked at core/tests/json_document.rs:179:55:
parse: Syntax { offset: 1, message: "a colon was expected after a key" }

---- a_missing_trailing_newline_is_not_added stdout ----

thread 'a_missing_trailing_newline_is_not_added' (16501304) panicked at core/tests/json_document.rs:66:61:
parse: Syntax { offset: 1, message: "a colon was expected after a key" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (16501303) panicked at core/tests/json_document.rs:75:89:
parse: Syntax { offset: 1, message: "a colon was expected after a key" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    a_path_that_is_not_there_is_reported_rather_than_created
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value

test result: FAILED. 4 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
