*** core/src/json.rs:289:5: replace indentation_before -> String with "xyzzy".into()

*** mutation diff:
--- core/src/json.rs
+++ replace indentation_before -> String with "xyzzy".into()
@@ -281,27 +281,17 @@
         self.build(rest, value, &inner, out);
         out.extend_from_slice(lead.as_bytes());
         out.push(b'}');
     }
 }
 
 /// The whitespace run immediately before `offset`, back to the start of its line.
 fn indentation_before(bytes: &[u8], offset: usize) -> String {
-    let line_start = bytes[..offset]
-        .iter()
-        .rposition(|b| *b == b'\n')
-        .map(|i| i + 1)
-        .unwrap_or(0);
-    let indent: Vec<u8> = bytes[line_start..offset]
-        .iter()
-        .take_while(|b| **b == b' ' || **b == b'\t')
-        .copied()
-        .collect();
-    String::from_utf8_lossy(&indent).into_owned()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// One level of indentation, taken from the document's own first level rather than from the
 /// object being edited: a nested object's indentation is several steps, and dividing it by the
 /// depth would be guessing. Two spaces when the file offers no example, which is what Claude
 /// Code writes anyway.
 fn document_step(bytes: &[u8], root: &Node) -> String {
     let Node::Object { members, span } = root else {

---- an_empty_object_receives_its_first_key stdout ----

thread 'an_empty_object_receives_its_first_key' (17425969) panicked at core/tests/json_document.rs:294:40:
set: Syntax { offset: 13, message: "a key or a closing brace was expected" }

failures:
    an_empty_object_receives_its_first_key

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
