*** core/src/json.rs:296:28: replace += with *= in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::string
@@ -288,17 +288,17 @@
         loop {
             match self.b.get(self.i) {
                 None => return Err(self.error("an unterminated string")),
                 Some(b'"') => {
                     self.i += 1;
                     return Ok(out);
                 }
                 Some(b'\\') => {
-                    self.i += 1;
+                    self.i *= /* ~ changed by cargo-mutants ~ */ 1;
                     let escaped = *self.b.get(self.i).ok_or_else(|| self.error("a truncated escape"))?;
                     self.i += 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),

---- braces_and_commas_inside_a_string_are_not_structure stdout ----

thread 'braces_and_commas_inside_a_string_are_not_structure' (16504206) panicked at core/tests/json_document.rs:142:43:
parse: Syntax { offset: 20, message: "a comma or a closing brace was expected" }

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (16504214) panicked at core/tests/json_document.rs:129:43:
parse: Syntax { offset: 32, message: "a comma or a closing brace was expected" }

failures:
    braces_and_commas_inside_a_string_are_not_structure
    strings_holding_escapes_survive_untouched

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
