*** core/src/json.rs:296:37: replace || with && in indentation_before

*** mutation diff:
--- core/src/json.rs
+++ replace || with && in indentation_before
@@ -288,17 +288,17 @@
 fn indentation_before(bytes: &[u8], offset: usize) -> String {
     let line_start = bytes[..offset]
         .iter()
         .rposition(|b| *b == b'\n')
         .map(|i| i + 1)
         .unwrap_or(0);
     let indent: Vec<u8> = bytes[line_start..offset]
         .iter()
-        .take_while(|b| **b == b' ' || **b == b'\t')
+        .take_while(|b| **b == b' ' && /* ~ changed by cargo-mutants ~ */ **b == b'\t')
         .copied()
         .collect();
     String::from_utf8_lossy(&indent).into_owned()
 }
 
 /// One level of indentation, taken from the document's own first level rather than from the
 /// object being edited: a nested object's indentation is several steps, and dividing it by the
 /// depth would be guessing. Two spaces when the file offers no example, which is what Claude

---- an_empty_object_receives_its_first_key stdout ----

thread 'an_empty_object_receives_its_first_key' (17429920) panicked at core/tests/json_document.rs:296:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n  \"A\": \"1\"\n}\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\"\n  }\n}\n"

failures:
    an_empty_object_receives_its_first_key

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
