*** core/src/json.rs:302:25: delete match arm b'/' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b'/' in Parser<'a>::string
@@ -294,17 +294,17 @@
                 }
                 Some(b'\\') => {
                     self.i += 1;
                     let escaped = *self.b.get(self.i).ok_or_else(|| self.error("a truncated escape"))?;
                     self.i += 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
-                        b'/' => out.push('/'),
+                         /* ~ changed by cargo-mutants ~ */
                         b'b' => out.push('\u{8}'),
                         b'f' => out.push('\u{c}'),
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),
                         b't' => out.push('\t'),
                         b'u' => {
                             let hex = self
                                 .b

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (16505654) panicked at core/tests/json_document.rs:129:43:
parse: Syntax { offset: 80, message: "an unknown escape" }

failures:
    strings_holding_escapes_survive_untouched

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
