*** core/src/json.rs:304:25: delete match arm b'f' in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ delete match arm b'f' in Parser<'a>::string
@@ -296,17 +296,17 @@
                     self.i += 1;
                     let escaped = *self.b.get(self.i).ok_or_else(|| self.error("a truncated escape"))?;
                     self.i += 1;
                     match escaped {
                         b'"' => out.push('"'),
                         b'\\' => out.push('\\'),
                         b'/' => out.push('/'),
                         b'b' => out.push('\u{8}'),
-                        b'f' => out.push('\u{c}'),
+                         /* ~ changed by cargo-mutants ~ */
                         b'n' => out.push('\n'),
                         b'r' => out.push('\r'),
                         b't' => out.push('\t'),
                         b'u' => {
                             let hex = self
                                 .b
                                 .get(self.i..self.i + 4)
                                 .ok_or_else(|| self.error("a truncated \\u escape"))?;

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (16506360) panicked at core/tests/json_document.rs:129:43:
parse: Syntax { offset: 91, message: "an unknown escape" }

failures:
    strings_holding_escapes_survive_untouched

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
