*** core/src/json.rs:307:5: replace document_step -> String with String::new()

*** mutation diff:
--- core/src/json.rs
+++ replace document_step -> String with String::new()
@@ -299,27 +299,17 @@
     String::from_utf8_lossy(&indent).into_owned()
 }
 
 /// One level of indentation, taken from the document's own first level rather than from the
 /// object being edited: a nested object's indentation is several steps, and dividing it by the
 /// depth would be guessing. Two spaces when the file offers no example, which is what Claude
 /// Code writes anyway.
 fn document_step(bytes: &[u8], root: &Node) -> String {
-    let Node::Object { members, span } = root else {
-        return "  ".to_string();
-    };
-    let Some(first) = members.first() else {
-        return "  ".to_string();
-    };
-    let opening = String::from_utf8_lossy(&bytes[span.start + 1..first.span.start]);
-    match opening.rsplit('\n').next() {
-        Some(indent) if opening.contains('\n') && !indent.is_empty() => indent.to_string(),
-        _ => "  ".to_string(),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_root(bytes: &[u8]) -> Result<Node, Error> {
     let start = if bytes.starts_with(b"\xEF\xBB\xBF") {
         3
     } else {
         0
     };

---- a_tab_indented_file_gets_tab_indented_insertions stdout ----

thread 'a_tab_indented_file_gets_tab_indented_insertions' (17432806) panicked at core/tests/json_document.rs:385:5:
assertion `left == right` failed
  left: "{\n\t\"theme\": \"dark\",\n\t\"env\": {\n\t\"A\": \"1\"\n\t}\n}\n"
 right: "{\n\t\"theme\": \"dark\",\n\t\"env\": {\n\t\t\"A\": \"1\"\n\t}\n}\n"

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17432802) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
  left: "{\n  \"theme\": \"dark\",\n  \"env\": {\n  \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17432798) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\",\n    \"env\": {\n    \"A\": \"1\"\n    }\n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

failures:
    a_four_space_file_gets_four_space_insertions
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_tab_indented_file_gets_tab_indented_insertions
    an_empty_object_receives_its_first_key

test result: FAILED. 28 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
