*** core/src/json.rs:307:5: replace document_step -> String with "xyzzy".into()

*** mutation diff:
--- core/src/json.rs
+++ replace document_step -> String with "xyzzy".into()
@@ -299,27 +299,17 @@
     String::from_utf8_lossy(&indent).into_owned()
 }
 
 /// One level of indentation, taken from the document's own first level rather than from the
 /// object being edited: a nested object's indentation is several steps, and dividing it by the
 /// depth would be guessing. Two spaces when the file offers no example, which is what Claude
 /// Code writes anyway.
 fn document_step(bytes: &[u8], root: &Node) -> String {
-    let Node::Object { members, span } = root else {
-        return "  ".to_string();
-    };
-    let Some(first) = members.first() else {
-        return "  ".to_string();
-    };
-    let opening = String::from_utf8_lossy(&bytes[span.start + 1..first.span.start]);
-    match opening.rsplit('\n').next() {
-        Some(indent) if opening.contains('\n') && !indent.is_empty() => indent.to_string(),
-        _ => "  ".to_string(),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_root(bytes: &[u8]) -> Result<Node, Error> {
     let start = if bytes.starts_with(b"\xEF\xBB\xBF") {
         3
     } else {
         0
     };

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17433870) panicked at core/tests/json_document.rs:370:40:
set: Syntax { offset: 40, message: "a key or a closing brace was expected" }

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17433874) panicked at core/tests/json_document.rs:310:10:
set: Syntax { offset: 34, message: "a key or a closing brace was expected" }

---- a_tab_indented_file_gets_tab_indented_insertions stdout ----

thread 'a_tab_indented_file_gets_tab_indented_insertions' (17433878) panicked at core/tests/json_document.rs:383:40:
set: Syntax { offset: 31, message: "a key or a closing brace was expected" }

failures:
    a_four_space_file_gets_four_space_insertions
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_tab_indented_file_gets_tab_indented_insertions
    an_empty_object_receives_its_first_key

test result: FAILED. 28 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
