*** core/src/json.rs:313:61: replace + with - in document_step

*** mutation diff:
--- core/src/json.rs
+++ replace + with - in document_step
@@ -305,17 +305,17 @@
 /// Code writes anyway.
 fn document_step(bytes: &[u8], root: &Node) -> String {
     let Node::Object { members, span } = root else {
         return "  ".to_string();
     };
     let Some(first) = members.first() else {
         return "  ".to_string();
     };
-    let opening = String::from_utf8_lossy(&bytes[span.start + 1..first.span.start]);
+    let opening = String::from_utf8_lossy(&bytes[span.start - /* ~ changed by cargo-mutants ~ */ 1..first.span.start]);
     match opening.rsplit('\n').next() {
         Some(indent) if opening.contains('\n') && !indent.is_empty() => indent.to_string(),
         _ => "  ".to_string(),
     }
 }
 
 fn parse_root(bytes: &[u8]) -> Result<Node, Error> {
     let start = if bytes.starts_with(b"\xEF\xBB\xBF") {

---- a_nested_object_created_in_a_minified_file_stays_inline stdout ----

thread 'a_nested_object_created_in_a_minified_file_stays_inline' (17435073) panicked at core/src/json.rs:313:50:
attempt to subtract with overflow

---- a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too stdout ----

thread 'a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too' (17435068) panicked at core/src/json.rs:313:50:
attempt to subtract with overflow

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17435071) panicked at core/src/json.rs:313:50:
attempt to subtract with overflow

failures:
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical
    an_empty_object_receives_its_first_key

test result: FAILED. 23 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
