*** core/src/json.rs:315:25: replace match guard opening.contains('\n') && !indent.is_empty() with false in document_step

*** mutation diff:
--- core/src/json.rs
+++ replace match guard opening.contains('\n') && !indent.is_empty() with false in document_step
@@ -307,17 +307,17 @@
     let Node::Object { members, span } = root else {
         return "  ".to_string();
     };
     let Some(first) = members.first() else {
         return "  ".to_string();
     };
     let opening = String::from_utf8_lossy(&bytes[span.start + 1..first.span.start]);
     match opening.rsplit('\n').next() {
-        Some(indent) if opening.contains('\n') && !indent.is_empty() => indent.to_string(),
+        Some(indent) if false /* ~ changed by cargo-mutants ~ */ => indent.to_string(),
         _ => "  ".to_string(),
     }
 }
 
 fn parse_root(bytes: &[u8]) -> Result<Node, Error> {
     let start = if bytes.starts_with(b"\xEF\xBB\xBF") {
         3
     } else {

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17436181) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\",\n    \"env\": {\n      \"A\": \"1\"\n    }\n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

---- a_tab_indented_file_gets_tab_indented_insertions stdout ----

thread 'a_tab_indented_file_gets_tab_indented_insertions' (17436189) panicked at core/tests/json_document.rs:385:5:
assertion `left == right` failed
  left: "{\n\t\"theme\": \"dark\",\n\t\"env\": {\n\t  \"A\": \"1\"\n\t}\n}\n"
 right: "{\n\t\"theme\": \"dark\",\n\t\"env\": {\n\t\t\"A\": \"1\"\n\t}\n}\n"

failures:
    a_four_space_file_gets_four_space_insertions
    a_tab_indented_file_gets_tab_indented_insertions

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
