*** core/src/json.rs:345:5: replace member -> Option<&'a Member> with None

*** mutation diff:
--- core/src/json.rs
+++ replace member -> Option<&'a Member> with None
@@ -337,22 +337,17 @@
     fn span(&self) -> Range<usize> {
         match self {
             Node::Object { span, .. } | Node::Opaque { span, .. } => span.clone(),
         }
     }
 }
 
 fn member<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Member> {
-    let (last, parents) = path.split_last()?;
-    let parent = resolve(node, parents)?;
-    let Node::Object { members, .. } = parent else {
-        return None;
-    };
-    members.iter().find(|m| m.key == *last)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parent_and_member<'a>(node: &'a Node, path: &[&str]) -> Option<(&'a Node, &'a Member)> {
     let (last, parents) = path.split_last()?;
     let parent = resolve(node, parents)?;
     let Node::Object { members, .. } = parent else {
         return None;
     };

---- a_byte_order_mark_survives stdout ----

thread 'a_byte_order_mark_survives' (17442168) panicked at core/tests/json_document.rs:52:41:
set: NotAnObject { path: "theme" }

---- a_missing_trailing_newline_is_not_added stdout ----

thread 'a_missing_trailing_newline_is_not_added' (17442176) panicked at core/tests/json_document.rs:75:41:
set: NotAnObject { path: "theme" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (17442173) panicked at core/tests/json_document.rs:89:10:
set: NotAnObject { path: "env.ANTHROPIC_MODEL" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_minified_file_stays_minified
    a_missing_trailing_newline_is_not_added
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure
    carriage_returns_survive
    non_ascii_passes_through_as_utf8_rather_than_being_escaped
    replaces_a_nested_value_and_leaves_every_other_byte_alone
    replaces_a_top_level_string_and_changes_nothing_else
    setting_one_key_twice_keeps_only_the_last_value
    setting_the_same_value_twice_is_byte_identical

test result: FAILED. 18 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
