*** core/src/json.rs:354:5: replace parent_and_member -> Option<(&'a Node, &'a Member)> with None

*** mutation diff:
--- core/src/json.rs
+++ replace parent_and_member -> Option<(&'a Node, &'a Member)> with None
@@ -346,22 +346,17 @@
     let parent = resolve(node, parents)?;
     let Node::Object { members, .. } = parent else {
         return None;
     };
     members.iter().find(|m| m.key == *last)
 }
 
 fn parent_and_member<'a>(node: &'a Node, path: &[&str]) -> Option<(&'a Node, &'a Member)> {
-    let (last, parents) = path.split_last()?;
-    let parent = resolve(node, parents)?;
-    let Node::Object { members, .. } = parent else {
-        return None;
-    };
-    members.iter().find(|m| m.key == *last).map(|m| (parent, m))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn resolve<'a>(node: &'a Node, path: &[&str]) -> Option<&'a Node> {
     let Some((head, rest)) = path.split_first() else {
         return Some(node);
     };
     let Node::Object { members, .. } = node else {
         return None;

---- adding_then_removing_a_key_leaves_the_file_byte_identical stdout ----

thread 'adding_then_removing_a_key_leaves_the_file_byte_identical' (17443908) panicked at core/tests/json_document.rs:332:5:
assertion `left == right` failed
  left: "{\n  \"env\": {\n    \"A\": \"1\",\n    \"B\": \"2\"\n  }\n}\n"
 right: "{\n  \"env\": {\n    \"A\": \"1\"\n  }\n}\n"

---- removing_the_first_of_several_keys_takes_its_trailing_comma stdout ----

thread 'removing_the_first_of_several_keys_takes_its_trailing_comma' (17443918) panicked at core/tests/json_document.rs:353:5:
assertion `left == right` failed
  left: [123, 34, 97, 34, 58, 34, 49, 34, 44, 34, 98, 34, 58, 34, 50, 34, 125]
 right: [123, 34, 98, 34, 58, 34, 50, 34, 125]

---- removing_the_only_key_leaves_an_empty_object stdout ----

thread 'removing_the_only_key_leaves_an_empty_object' (17443920) panicked at core/tests/json_document.rs:344:5:
assertion `left == right` failed
  left: [123, 34, 101, 110, 118, 34, 58, 123, 34, 65, 34, 58, 34, 49, 34, 125, 125]
 right: [123, 34, 101, 110, 118, 34, 58, 123, 125, 125]

failures:
    adding_then_removing_a_key_leaves_the_file_byte_identical
    removing_the_first_of_several_keys_takes_its_trailing_comma
    removing_the_only_key_leaves_an_empty_object

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
