*** core/src/json.rs:376:5: replace encode_string -> Vec<u8> with vec![]

*** mutation diff:
--- core/src/json.rs
+++ replace encode_string -> Vec<u8> with vec![]
@@ -368,36 +368,17 @@
     };
     let member = members.iter().find(|m| m.key == *head)?;
     resolve(&member.value, rest)
 }
 
 /// Only what the format requires: a value tapkey writes must not arrive in the file more
 /// escaped than the user's own values are.
 fn encode_string(value: &str) -> Vec<u8> {
-    let mut out = Vec::with_capacity(value.len() + 2);
-    out.push(b'"');
-    for ch in value.chars() {
-        match ch {
-            '"' => out.extend_from_slice(b"\\\""),
-            '\\' => out.extend_from_slice(b"\\\\"),
-            '\n' => out.extend_from_slice(b"\\n"),
-            '\r' => out.extend_from_slice(b"\\r"),
-            '\t' => out.extend_from_slice(b"\\t"),
-            c if (c as u32) < 0x20 => {
-                out.extend_from_slice(format!("\\u{:04x}", c as u32).as_bytes())
-            }
-            c => {
-                let mut buf = [0u8; 4];
-                out.extend_from_slice(c.encode_utf8(&mut buf).as_bytes())
-            }
-        }
-    }
-    out.push(b'"');
-    out
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 struct Parser<'a> {
     b: &'a [u8],
     i: usize,
 }
 
 impl<'a> Parser<'a> {

---- a_minified_object_stays_on_one_line_when_a_key_is_added stdout ----

thread 'a_minified_object_stays_on_one_line_when_a_key_is_added' (17447997) panicked at core/tests/json_document.rs:273:40:
set: Syntax { offset: 16, message: "a key or a closing brace was expected" }

---- a_missing_trailing_newline_is_not_added stdout ----

thread 'a_missing_trailing_newline_is_not_added' (17447999) panicked at core/tests/json_document.rs:75:41:
set: Syntax { offset: 10, message: "a value was expected" }

---- a_minified_file_stays_minified stdout ----

thread 'a_minified_file_stays_minified' (17447996) panicked at core/tests/json_document.rs:89:10:
set: Syntax { offset: 26, message: "a value was expected" }

failures:
    a_byte_order_mark_survives
    a_control_character_in_a_written_value_is_escaped
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_missing_trailing_newline_is_not_added
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    adding_then_removing_a_key_leaves_the_file_byte_identical

test result: FAILED. 9 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
