*** core/src/json.rs:385:18: replace match guard (c as u32) < 0x20 with false in encode_string

*** mutation diff:
--- core/src/json.rs
+++ replace match guard (c as u32) < 0x20 with false in encode_string
@@ -377,17 +377,17 @@
     out.push(b'"');
     for ch in value.chars() {
         match ch {
             '"' => out.extend_from_slice(b"\\\""),
             '\\' => out.extend_from_slice(b"\\\\"),
             '\n' => out.extend_from_slice(b"\\n"),
             '\r' => out.extend_from_slice(b"\\r"),
             '\t' => out.extend_from_slice(b"\\t"),
-            c if (c as u32) < 0x20 => {
+            c if false /* ~ changed by cargo-mutants ~ */ => {
                 out.extend_from_slice(format!("\\u{:04x}", c as u32).as_bytes())
             }
             c => {
                 let mut buf = [0u8; 4];
                 out.extend_from_slice(c.encode_utf8(&mut buf).as_bytes())
             }
         }
     }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17452013) panicked at core/tests/json_document.rs:210:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 1, 116, 119, 111, 34, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

failures:
    a_control_character_in_a_written_value_is_escaped

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
