*** core/src/json.rs:385:29: replace < with > in encode_string

*** mutation diff:
--- core/src/json.rs
+++ replace < with > in encode_string
@@ -377,17 +377,17 @@
     out.push(b'"');
     for ch in value.chars() {
         match ch {
             '"' => out.extend_from_slice(b"\\\""),
             '\\' => out.extend_from_slice(b"\\\\"),
             '\n' => out.extend_from_slice(b"\\n"),
             '\r' => out.extend_from_slice(b"\\r"),
             '\t' => out.extend_from_slice(b"\\t"),
-            c if (c as u32) < 0x20 => {
+            c if (c as u32) > /* ~ changed by cargo-mutants ~ */ 0x20 => {
                 out.extend_from_slice(format!("\\u{:04x}", c as u32).as_bytes())
             }
             c => {
                 let mut buf = [0u8; 4];
                 out.extend_from_slice(c.encode_utf8(&mut buf).as_bytes())
             }
         }
     }

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17453349) panicked at core/tests/json_document.rs:210:5:
assertion `left == right` failed
  left: [123, 34, 110, 111, 116, 101, 34, 58, 34, 92, 117, 48, 48, 54, 102, 92, 117, 48, 48, 54, 101, 92, 117, 48, 48, 54, 53, 1, 92, 117, 48, 48, 55, 52, 92, 117, 48, 48, 55, 55, 92, 117, 48, 48, 54, 102, 34, 125]
 right: [123, 34, 110, 111, 116, 101, 34, 58, 34, 111, 110, 101, 92, 117, 48, 48, 48, 49, 116, 119, 111, 34, 125]

---- a_missing_intermediate_object_is_created_in_the_files_own_style stdout ----

thread 'a_missing_intermediate_object_is_created_in_the_files_own_style' (17453355) panicked at core/tests/json_document.rs:312:5:
assertion `left == right` failed
 right: "{\n  \"theme\": \"dark\",\n  \"env\": {\n    \"ANTHROPIC_BASE_URL\": \"https://x.test\"\n  }\n}\n"

---- a_four_space_file_gets_four_space_insertions stdout ----

thread 'a_four_space_file_gets_four_space_insertions' (17453351) panicked at core/tests/json_document.rs:372:5:
assertion `left == right` failed
  left: "{\n    \"theme\": \"dark\",\n    \"\\u0065\\u006e\\u0076\": {\n        \"\\u0041\": \"\\u0031\"\n    }\n}\n"
 right: "{\n    \"theme\": \"dark\",\n    \"env\": {\n        \"A\": \"1\"\n    }\n}\n"

failures:
    a_control_character_in_a_written_value_is_escaped
    a_four_space_file_gets_four_space_insertions
    a_key_and_value_separated_by_a_space_gets_a_sibling_with_one_too
    a_minified_file_stays_minified
    a_minified_object_stays_on_one_line_when_a_key_is_added
    a_missing_intermediate_object_is_created_in_the_files_own_style
    a_nested_object_created_in_a_minified_file_stays_inline
    a_new_key_joins_its_siblings_in_their_own_style_and_goes_last
    a_tab_indented_file_gets_tab_indented_insertions
    an_empty_object_receives_its_first_key
    arrays_are_preserved_including_nested_ones
    braces_and_commas_inside_a_string_are_not_structure

test result: FAILED. 14 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
