*** core/src/json.rs:449:28: replace += with -= in Parser<'a>::object

*** mutation diff:
--- core/src/json.rs
+++ replace += with -= in Parser<'a>::object
@@ -441,17 +441,17 @@
     fn object(&mut self) -> Result<Node, Error> {
         let start = self.i;
         self.i += 1; // '{'
         let mut members = Vec::new();
         loop {
             self.skip_whitespace();
             match self.b.get(self.i) {
                 Some(b'}') => {
-                    self.i += 1;
+                    self.i -= /* ~ changed by cargo-mutants ~ */ 1;
                     return Ok(Node::Object {
                         members,
                         span: start..self.i,
                     });
                 }
                 Some(b'"') => {}
                 _ => return Err(self.error("a key or a closing brace was expected")),
             }

---- the_main_model_comes_from_the_environment_variable stdout ----

thread 'the_main_model_comes_from_the_environment_variable' (17461449) panicked at core/tests/effective_slots.rs:16:10:
tools

---- the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent stdout ----

thread 'the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent' (17461453) panicked at core/tests/effective_slots.rs:16:10:
tools

---- a_link_names_the_key_it_read_not_only_the_file stdout ----

thread 'a_link_names_the_key_it_read_not_only_the_file' (17461444) panicked at core/tests/effective_slots.rs:16:10:
tools

failures:
    a_link_names_the_key_it_read_not_only_the_file
    advisor_fallback_and_model_overrides_are_observed_not_owned
    anthropic_default_model_is_the_last_word_not_the_first
    anthropic_model_outranks_the_model_key_even_in_managed_settings
    the_deprecated_small_fast_variable_still_wins_the_utility_slot
    the_main_model_comes_from_the_environment_variable
    the_main_slots_unobservable_scopes_are_in_the_right_order
    the_model_key_decides_when_no_variable_is_set
    the_subagent_and_pin_slots_are_read
    the_utility_slot_falls_to_the_current_variable_when_the_deprecated_one_is_absent

test result: FAILED. 0 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
