*** core/src/json.rs:511:17: delete match arm None in Parser<'a>::array

*** mutation diff:
--- core/src/json.rs
+++ delete match arm None in Parser<'a>::array
@@ -503,17 +503,17 @@
                     return Ok(Node::Opaque {
                         span: start..self.i,
                         text: None,
                     });
                 }
                 // Reaching the end mid-array is caught by `value()` below in any case; this
                 // arm exists for the better message, which is why a mutation run reports it as
                 // survivable. Verified: with it removed, every truncated form still refuses.
-                None => return Err(self.error("an unterminated array")),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
             self.value()?;
             self.skip_whitespace();
             match self.b.get(self.i) {
                 Some(b',') => self.i += 1,
                 Some(b']') => {}
                 _ => return Err(self.error("a comma or a closing bracket was expected")),

*** result: Success
