*** core/src/json.rs:564:36: replace += with *= in Parser<'a>::string

*** mutation diff:
--- core/src/json.rs
+++ replace += with *= in Parser<'a>::string
@@ -556,17 +556,17 @@
                                 .get(self.i..self.i + 4)
                                 .ok_or_else(|| self.error("a truncated \\u escape"))?;
                             let code = u32::from_str_radix(
                                 std::str::from_utf8(hex)
                                     .map_err(|_| self.error("a bad \\u escape"))?,
                                 16,
                             )
                             .map_err(|_| self.error("a bad \\u escape"))?;
-                            self.i += 4;
+                            self.i *= /* ~ changed by cargo-mutants ~ */ 4;
                             // A lone surrogate is kept as the replacement character: the key it
                             // names still matches, and tapkey never writes this value back.
                             out.push(char::from_u32(code).unwrap_or('\u{FFFD}'));
                         }
                         _ => return Err(self.error("an unknown escape")),
                     }
                 }
                 Some(&byte) => {

---- a_control_character_in_a_written_value_is_escaped stdout ----

thread 'a_control_character_in_a_written_value_is_escaped' (17503385) panicked at core/tests/json_document.rs:208:46:
set: Syntax { offset: 56, message: "an unterminated string" }

---- strings_holding_escapes_survive_untouched stdout ----

thread 'strings_holding_escapes_survive_untouched' (17503414) panicked at core/tests/json_document.rs:152:43:
parse: Syntax { offset: 244, message: "an unterminated string" }

failures:
    a_control_character_in_a_written_value_is_escaped
    strings_holding_escapes_survive_untouched

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
