*** core/src/lib.rs:112:30: replace && with || in switch

*** mutation diff:
--- core/src/lib.rs
+++ replace && with || in switch
@@ -104,17 +104,17 @@
     let mut disk = fs::RealFs;
     let captured = match transaction.capture(&disk, "claude") {
         Ok(c) => c,
         Err(e) => return refuse("permission_denied", e.to_string()),
     };
 
     // The floor under every restore goes down before the first change, over every managed
     // file rather than only the touched ones: full restoration is its job.
-    if !store.has_snapshot() && store.take_snapshot(&captured, env.now()).is_err() {
+    if !store.has_snapshot() || /* ~ changed by cargo-mutants ~ */ store.take_snapshot(&captured, env.now()).is_err() {
         return refuse(
             "permission_denied",
             "could not record the first-run snapshot".into(),
         );
     }
     if store
         .take_backup(&captured, &profile.name, env.now())
         .is_err()

---- a_switch_writes_the_endpoint_and_the_models_into_the_env_block stdout ----

thread 'a_switch_writes_the_endpoint_and_the_models_into_the_env_block' (17560801) panicked at core/tests/switching.rs:36:5:
assertion `left == right` failed: {"failure":{"detail":"could not record the first-run snapshot","kind":"permission_denied"},"ok":false}
  left: Null
 right: String("applied")

---- the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup stdout ----

thread 'the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup' (17560809) panicked at core/tests/switching.rs:194:5:
assertion failed: machine.store().join("snapshot").join("manifest.json").exists()

---- a_pin_carries_its_display_name stdout ----

thread 'a_pin_carries_its_display_name' (17560800) panicked at core/tests/switching.rs:134:5:
{}

failures:
    a_pin_carries_its_display_name
    a_switch_writes_the_endpoint_and_the_models_into_the_env_block
    no_assignment_removes_the_key_tapkey_wrote
    no_assignment_writes_an_empty_value_only_when_a_shell_export_exists
    the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup
    the_utility_slot_mirrors_into_the_deprecated_variable_when_it_is_present

test result: FAILED. 5 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
