*** core/src/lib.rs:112:8: delete ! in switch

*** mutation diff:
--- core/src/lib.rs
+++ delete ! in switch
@@ -104,17 +104,17 @@
     let mut disk = fs::RealFs;
     let captured = match transaction.capture(&disk, "claude") {
         Ok(c) => c,
         Err(e) => return refuse("permission_denied", e.to_string()),
     };
 
     // The floor under every restore goes down before the first change, over every managed
     // file rather than only the touched ones: full restoration is its job.
-    if !store.has_snapshot() && store.take_snapshot(&captured, env.now()).is_err() {
+    if  /* ~ changed by cargo-mutants ~ */store.has_snapshot() && store.take_snapshot(&captured, env.now()).is_err() {
         return refuse(
             "permission_denied",
             "could not record the first-run snapshot".into(),
         );
     }
     if store
         .take_backup(&captured, &profile.name, env.now())
         .is_err()

---- the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup stdout ----

thread 'the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup' (17564327) panicked at core/tests/switching.rs:194:5:
assertion failed: machine.store().join("snapshot").join("manifest.json").exists()

failures:
    the_first_switch_takes_a_snapshot_and_every_switch_takes_a_backup

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
