*** core/src/lib.rs:38:5: replace handle_with -> String with String::new()

*** mutation diff:
--- core/src/lib.rs
+++ replace handle_with -> String with String::new()
@@ -30,25 +30,17 @@
     handle_with(&Env::real(), request)
 }
 
 /// The same call, told what world it is acting in rather than going and finding one.
 ///
 /// This is the seam the tests and the fixture harness use. See ADR-0016: the public surface is
 /// still one string in and one string out.
 pub fn handle_with(env: &Env, request: &str) -> String {
-    let response = dispatch(env, request);
-    serde_json::to_string(&response).unwrap_or_else(|e| {
-        // Serialising our own response cannot fail on well-formed data, but a panic here would
-        // take the host application down, so it degrades to a refusal instead.
-        format!(
-            r#"{{"ok":false,"failure":{{"kind":"internal","detail":{:?}}}}}"#,
-            e.to_string()
-        )
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn dispatch(env: &Env, request: &str) -> Response {
     let envelope: Envelope = match serde_json::from_str(request) {
         Ok(e) => e,
         Err(e) => return refuse("malformed_request", e.to_string()),
     };
     if envelope.version != SCHEMA_VERSION {

---- tests::the_public_entry_point_answers_with_json_even_when_the_request_is_nonsense stdout ----

thread 'tests::the_public_entry_point_answers_with_json_even_when_the_request_is_nonsense' (17555472) panicked at core/src/lib.rs:162:68:
a JSON response: Error("EOF while parsing a value", line: 1, column: 0)

---- tests::an_unknown_schema_version_is_refused_rather_than_guessed_at stdout ----

thread 'tests::an_unknown_schema_version_is_refused_rather_than_guessed_at' (17555471) panicked at core/src/lib.rs:177:9:

failures:
    tests::an_unknown_schema_version_is_refused_rather_than_guessed_at
    tests::the_public_entry_point_answers_with_json_even_when_the_request_is_nonsense

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
