*** core/src/lib.rs:49:25: replace != with == in dispatch

*** mutation diff:
--- core/src/lib.rs
+++ replace != with == in dispatch
@@ -41,17 +41,17 @@
     })
 }
 
 fn dispatch(env: &Env, request: &str) -> Response {
     let envelope: Envelope = match serde_json::from_str(request) {
         Ok(e) => e,
         Err(e) => return refuse("malformed_request", e.to_string()),
     };
-    if envelope.version != SCHEMA_VERSION {
+    if envelope.version == /* ~ changed by cargo-mutants ~ */ SCHEMA_VERSION {
         return refuse(
             "unknown_version",
             format!("this core speaks version {SCHEMA_VERSION}"),
         );
     }
     match envelope.request {
         Request::EffectiveState {} => match adapters::claude::effective_state(env) {
             Ok(tool) => Response::Ok {

---- tests::an_unknown_schema_version_is_refused_rather_than_guessed_at stdout ----

thread 'tests::an_unknown_schema_version_is_refused_rather_than_guessed_at' (16545133) panicked at core/src/lib.rs:98:9:

failures:
    tests::an_unknown_schema_version_is_refused_rather_than_guessed_at

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
