*** core/src/store.rs:149:16: delete ! in Store::backups

*** mutation diff:
--- core/src/store.rs
+++ delete ! in Store::backups
@@ -141,17 +141,17 @@
     /// Every readable backup, oldest first, sweeping away any interrupted write it finds.
     pub fn backups(&self) -> io::Result<Vec<BackupSummary>> {
         let mut out = Vec::new();
         let Ok(entries) = fs::read_dir(self.backups_dir()) else {
             return Ok(out);
         };
         for entry in entries {
             let path = entry?.path();
-            if !path.is_dir() {
+            if  /* ~ changed by cargo-mutants ~ */path.is_dir() {
                 continue;
             }
             let manifest_path = path.join("manifest.json");
             if !manifest_path.exists() {
                 // No manifest means the write never committed. Ours, not theirs.
                 fs::remove_dir_all(&path)?;
                 continue;
             }

---- a_manifest_from_the_future_is_unrestorable_rather_than_guessed_at stdout ----

thread 'a_manifest_from_the_future_is_unrestorable_rather_than_guessed_at' (16832658) panicked at core/tests/store.rs:313:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted stdout ----

thread 'a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted' (16832655) panicked at core/tests/store.rs:134:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16832654) panicked at core/tests/store.rs:37:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_backup_we_cannot_read_is_kept_and_marked_rather_than_deleted
    a_backup_without_a_manifest_is_swept_in_silence
    a_manifest_from_the_future_is_unrestorable_rather_than_guessed_at
    a_missing_snapshot_is_distinguishable_from_a_first_run
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.04s

*** result: Failure(101)
