*** core/src/store.rs:217:22: replace <= with > in Store::sweep

*** mutation diff:
--- core/src/store.rs
+++ replace <= with > in Store::sweep
@@ -209,17 +209,17 @@
         for summary in &listed {
             let dir = self.backups_dir().join(summary.id.as_str());
             sizes.push((summary.id.clone(), directory_size(&dir)?));
         }
 
         let mut total: u64 = sizes.iter().map(|(_, n)| *n).sum();
         let mut count = sizes.len();
         for (id, size) in sizes {
-            if count <= max_backups && total <= max_bytes {
+            if count > /* ~ changed by cargo-mutants ~ */ max_backups && total <= max_bytes {
                 break;
             }
             fs::remove_dir_all(self.backups_dir().join(id.as_str()))?;
             total = total.saturating_sub(size);
             count -= 1;
         }
         Ok(())
     }

---- the_sweep_removes_the_oldest_first stdout ----

thread 'the_sweep_removes_the_oldest_first' (16836571) panicked at core/tests/store.rs:207:5:
assertion `left == right` failed: newest kept, oldest gone
  left: ["p0", "p1", "p2", "p3", "p4"]
 right: ["p3", "p4"]

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16836569) panicked at core/tests/store.rs:178:5:
assertion `left == right` failed
  left: 60
 right: 3

failures:
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_sweep_removes_the_oldest_first

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.54s

*** result: Failure(101)
