*** core/src/store.rs:228:9: replace Store::snapshot_dir -> PathBuf with Default::default()

*** mutation diff:
--- core/src/store.rs
+++ replace Store::snapshot_dir -> PathBuf with Default::default()
@@ -220,17 +220,17 @@
             fs::remove_dir_all(self.backups_dir().join(id.as_str()))?;
             total = total.saturating_sub(size);
             count -= 1;
         }
         Ok(())
     }
 
     fn snapshot_dir(&self) -> PathBuf {
-        self.root.join("snapshot")
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn backups_dir(&self) -> PathBuf {
         self.root.join("backups")
     }
 }
 
 /// Copies first, manifest last by atomic rename: one point of commit rather than a transaction

---- the_snapshot_lives_apart_and_the_sweep_cannot_reach_it stdout ----

thread 'the_snapshot_lives_apart_and_the_sweep_cannot_reach_it' (16840530) panicked at core/tests/store.rs:165:10:
snapshot: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- a_missing_snapshot_is_distinguishable_from_a_first_run stdout ----

thread 'a_missing_snapshot_is_distinguishable_from_a_first_run' (16840526) panicked at core/tests/store.rs:291:10:
snapshot: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    a_missing_snapshot_is_distinguishable_from_a_first_run
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.83s

*** result: Failure(101)
