*** core/src/store.rs:239:5: replace write_group -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/store.rs
+++ replace write_group -> io::Result<()> with Ok(())
@@ -231,47 +231,17 @@
     fn backups_dir(&self) -> PathBuf {
         self.root.join("backups")
     }
 }
 
 /// Copies first, manifest last by atomic rename: one point of commit rather than a transaction
 /// spanning the store.
 fn write_group(dir: &Path, files: &[Captured], at: SystemTime, profile: &str) -> io::Result<()> {
-    create_dir_closed(dir)?;
-    create_dir_closed(&dir.join("files"))?;
-
-    let mut entries = Vec::new();
-    for (n, file) in files.iter().enumerate() {
-        let stored = match &file.content {
-            Some(bytes) => {
-                let name = format!("{:02}", n + 1);
-                write_atomically(&dir.join("files").join(&name), bytes, FILE_MODE)?;
-                Some(name)
-            }
-            None => None,
-        };
-        entries.push(Entry {
-            path: file.path.clone(),
-            tool: file.tool.clone(),
-            size: file.content.as_ref().map(|b| b.len() as u64).unwrap_or(0),
-            mode: file.mode,
-            stored,
-        });
-    }
-
-    let manifest = Manifest {
-        version: MANIFEST_VERSION,
-        instant: format_utc(at),
-        profile: profile.to_string(),
-        files: entries,
-    };
-    let bytes = serde_json::to_vec_pretty(&manifest)
-        .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-    write_atomically(&dir.join("manifest.json"), &bytes, FILE_MODE)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_manifest(path: &Path) -> io::Result<Manifest> {
     let bytes = fs::read(path)?;
     let manifest: Manifest = serde_json::from_slice(&bytes)
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
     if manifest.version > MANIFEST_VERSION {
         // A version from the future is kept and marked, never reinterpreted by guesswork.

---- a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it stdout ----

thread 'a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it' (16843535) panicked at core/tests/store.rs:96:55:
plan: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16843532) panicked at core/tests/store.rs:37:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_missing_snapshot_is_distinguishable_from_a_first_run stdout ----

thread 'a_missing_snapshot_is_distinguishable_from_a_first_run' (16843537) panicked at core/tests/store.rs:287:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_backup_without_a_manifest_is_swept_in_silence
    a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it
    a_missing_snapshot_is_distinguishable_from_a_first_run
    restoring_returns_the_original_bytes_rather_than_writing_them
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_store_is_ours_so_it_is_created_closed
    the_sweep_removes_the_oldest_first

test result: FAILED. 4 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
