*** core/src/store.rs:276:25: replace > with < in read_manifest

*** mutation diff:
--- core/src/store.rs
+++ replace > with < in read_manifest
@@ -268,17 +268,17 @@
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
     write_atomically(&dir.join("manifest.json"), &bytes, FILE_MODE)
 }
 
 fn read_manifest(path: &Path) -> io::Result<Manifest> {
     let bytes = fs::read(path)?;
     let manifest: Manifest = serde_json::from_slice(&bytes)
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-    if manifest.version > MANIFEST_VERSION {
+    if manifest.version < /* ~ changed by cargo-mutants ~ */ MANIFEST_VERSION {
         // A version from the future is kept and marked, never reinterpreted by guesswork.
         return Err(io::Error::new(
             io::ErrorKind::InvalidData,
             format!(
                 "manifest version {} is newer than this build reads",
                 manifest.version
             ),
         ));

---- a_manifest_from_the_future_is_unrestorable_rather_than_guessed_at stdout ----

thread 'a_manifest_from_the_future_is_unrestorable_rather_than_guessed_at' (16844732) panicked at core/tests/store.rs:314:5:
assertion failed: !listed[0].restorable

failures:
    a_manifest_from_the_future_is_unrestorable_rather_than_guessed_at

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.30s

*** result: Failure(101)
