*** core/src/store.rs:290:5: replace create_dir_closed -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/store.rs
+++ replace create_dir_closed -> io::Result<()> with Ok(())
@@ -282,18 +282,17 @@
                 manifest.version
             ),
         ));
     }
     Ok(manifest)
 }
 
 fn create_dir_closed(path: &Path) -> io::Result<()> {
-    fs::create_dir_all(path)?;
-    set_dir_mode(path)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(unix)]
 fn set_dir_mode(path: &Path) -> io::Result<()> {
     use std::os::unix::fs::PermissionsExt;
     fs::set_permissions(path, fs::Permissions::from_mode(DIR_MODE))
 }

---- a_backup_holds_whole_copies_and_can_be_listed stdout ----

thread 'a_backup_holds_whole_copies_and_can_be_listed' (16844818) panicked at core/tests/store.rs:34:10:
backup: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- the_byte_ceiling_binds_as_well_as_the_count stdout ----

thread 'the_byte_ceiling_binds_as_well_as_the_count' (16844826) panicked at core/tests/store.rs:231:14:
backup: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- restoring_returns_the_original_bytes_rather_than_writing_them stdout ----

thread 'restoring_returns_the_original_bytes_rather_than_writing_them' (16844825) panicked at core/tests/store.rs:54:10:
backup: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    a_backup_holds_whole_copies_and_can_be_listed
    a_backup_without_a_manifest_is_swept_in_silence
    a_file_that_did_not_exist_is_recorded_absent_and_restoring_deletes_it
    a_missing_snapshot_is_distinguishable_from_a_first_run
    restoring_returns_the_original_bytes_rather_than_writing_them
    the_byte_ceiling_binds_as_well_as_the_count
    the_snapshot_lives_apart_and_the_sweep_cannot_reach_it
    the_store_is_ours_so_it_is_created_closed
    the_sweep_removes_the_oldest_first

test result: FAILED. 3 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
