*** core/src/store.rs:296:5: replace set_dir_mode -> io::Result<()> with Ok(())

*** mutation diff:
--- core/src/store.rs
+++ replace set_dir_mode -> io::Result<()> with Ok(())
@@ -288,18 +288,17 @@
 
 fn create_dir_closed(path: &Path) -> io::Result<()> {
     fs::create_dir_all(path)?;
     set_dir_mode(path)
 }
 
 #[cfg(unix)]
 fn set_dir_mode(path: &Path) -> io::Result<()> {
-    use std::os::unix::fs::PermissionsExt;
-    fs::set_permissions(path, fs::Permissions::from_mode(DIR_MODE))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(unix))]
 fn set_dir_mode(_path: &Path) -> io::Result<()> {
     // Windows has no equivalent; revisited with the Windows platform seam.
     Ok(())
 }

---- the_store_is_ours_so_it_is_created_closed stdout ----

thread 'the_store_is_ours_so_it_is_created_closed' (16848330) panicked at core/tests/store.rs:256:5:
assertion `left == right` failed
  left: 493
 right: 448

failures:
    the_store_is_ours_so_it_is_created_closed

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.37s

*** result: Failure(101)
