*** core/src/store.rs:311:15: replace += with *= in directory_size

*** mutation diff:
--- core/src/store.rs
+++ replace += with *= in directory_size
@@ -303,17 +303,17 @@
     Ok(())
 }
 
 fn directory_size(dir: &Path) -> io::Result<u64> {
     let mut total = 0;
     for entry in fs::read_dir(dir)? {
         let entry = entry?;
         let meta = entry.metadata()?;
-        total += if meta.is_dir() {
+        total *= /* ~ changed by cargo-mutants ~ */ if meta.is_dir() {
             directory_size(&entry.path())?
         } else {
             meta.len()
         };
     }
     Ok(total)
 }

---- the_byte_ceiling_binds_as_well_as_the_count stdout ----

thread 'the_byte_ceiling_binds_as_well_as_the_count' (16849386) panicked at core/tests/store.rs:236:5:
the byte ceiling bound first

failures:
    the_byte_ceiling_binds_as_well_as_the_count

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.94s

*** result: Failure(101)
