*** core/src/transaction.rs:119:5: replace undo -> usize with 0

*** mutation diff:
--- core/src/transaction.rs
+++ replace undo -> usize with 0
@@ -111,20 +111,10 @@
 }
 
 /// Put back everything already changed. A file that did not exist before is removed rather
 /// than left behind: it would be a file the user never had and tapkey no longer tracks.
 ///
 /// An error here is deliberately not propagated. The transaction has already failed, and the
 /// only useful thing left is to put back as much as possible and say how much that was.
 fn undo(fs: &mut dyn FileSystem, done: &[Before]) -> usize {
-    let mut restored = 0;
-    for entry in done.iter().rev() {
-        let outcome = match &entry.content {
-            Some(bytes) => fs.write(&entry.path, bytes, entry.mode.unwrap_or(0o600)),
-            None => fs.remove(&entry.path),
-        };
-        if outcome.is_ok() {
-            restored += 1;
-        }
-    }
-    restored
+    0 /* ~ changed by cargo-mutants ~ */
 }

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17072564) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17072572) panicked at core/tests/transaction.rs:172:38:
stat: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17072573) panicked at core/tests/transaction.rs:87:5:
it did not exist before, so it must not exist after

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
