*** core/src/transaction.rs:126:22: replace += with -= in undo

*** mutation diff:
--- core/src/transaction.rs
+++ replace += with -= in undo
@@ -118,13 +118,13 @@
 fn undo(fs: &mut dyn FileSystem, done: &[Before]) -> usize {
     let mut restored = 0;
     for entry in done.iter().rev() {
         let outcome = match &entry.content {
             Some(bytes) => fs.write(&entry.path, bytes, entry.mode.unwrap_or(0o600)),
             None => fs.remove(&entry.path),
         };
         if outcome.is_ok() {
-            restored += 1;
+            restored -= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
     restored
 }

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17073658) panicked at core/src/transaction.rs:126:13:
attempt to subtract with overflow

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17073657) panicked at core/src/transaction.rs:126:13:
attempt to subtract with overflow

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17073649) panicked at core/src/transaction.rs:126:13:
attempt to subtract with overflow

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
