*** core/src/transaction.rs:126:22: replace += with *= in undo

*** mutation diff:
--- core/src/transaction.rs
+++ replace += with *= in undo
@@ -118,13 +118,13 @@
 fn undo(fs: &mut dyn FileSystem, done: &[Before]) -> usize {
     let mut restored = 0;
     for entry in done.iter().rev() {
         let outcome = match &entry.content {
             Some(bytes) => fs.write(&entry.path, bytes, entry.mode.unwrap_or(0o600)),
             None => fs.remove(&entry.path),
         };
         if outcome.is_ok() {
-            restored += 1;
+            restored *= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
     restored
 }

---- a_failure_on_the_second_of_three_files_puts_the_first_one_back stdout ----

thread 'a_failure_on_the_second_of_three_files_puts_the_first_one_back' (17073667) panicked at core/tests/transaction.rs:72:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_failure_on_the_second_of_three_files_puts_the_first_one_back

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
