*** core/src/transaction.rs:26:9: replace Action::path -> &PathBuf with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- core/src/transaction.rs
+++ replace Action::path -> &PathBuf with Box::leak(Box::new(Default::default()))
@@ -18,19 +18,17 @@
     },
     Delete {
         path: PathBuf,
     },
 }
 
 impl Action {
     pub fn path(&self) -> &PathBuf {
-        match self {
-            Action::Write { path, .. } | Action::Delete { path } => path,
-        }
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// What a failed switch reports. The core returns facts: which file stopped it, why, and how
 /// many were put back — the sentence belongs to whoever is speaking to the person.
 #[derive(Debug)]
 pub struct RolledBack {
     pub failed_at: PathBuf,

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17067864) panicked at core/tests/transaction.rs:104:34:
a: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17067872) panicked at core/tests/transaction.rs:172:38:
stat: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- capturing_records_contents_and_absence_alike stdout ----

thread 'capturing_records_contents_and_absence_alike' (17067869) panicked at core/tests/transaction.rs:121:5:
assertion `left == right` failed
  left: None
 right: Some([111, 114, 105, 103, 105, 110, 97, 108, 32, 97])

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    capturing_records_contents_and_absence_alike
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
