*** core/src/transaction.rs:60:9: replace Transaction::capture -> io::Result<Vec<Captured>> with Ok(vec![])

*** mutation diff:
--- core/src/transaction.rs
+++ replace Transaction::capture -> io::Result<Vec<Captured>> with Ok(vec![])
@@ -52,27 +52,17 @@
 
 impl Transaction {
     pub fn new(actions: Vec<Action>) -> Self {
         Transaction { actions }
     }
 
     /// Read every file this transaction would touch, as it stands now.
     pub fn capture(&self, fs: &dyn FileSystem, tool: &str) -> io::Result<Vec<Captured>> {
-        self.before(fs).map(|before| {
-            before
-                .into_iter()
-                .map(|b| Captured {
-                    path: b.path,
-                    tool: tool.to_string(),
-                    content: b.content,
-                    mode: b.mode,
-                })
-                .collect()
-        })
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Apply every action, or none of them.
     pub fn apply(&self, fs: &mut dyn FileSystem) -> Result<(), RolledBack> {
         let before = self.before(fs).map_err(|e| RolledBack {
             failed_at: PathBuf::new(),
             reason: format!("could not read the files to be changed: {e}"),
             restored: 0,

---- capturing_records_contents_and_absence_alike stdout ----

thread 'capturing_records_contents_and_absence_alike' (17068593) panicked at core/tests/transaction.rs:120:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    capturing_records_contents_and_absence_alike

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
