*** core/src/transaction.rs:75:9: replace Transaction::apply -> Result<(), RolledBack> with Ok(())

*** mutation diff:
--- core/src/transaction.rs
+++ replace Transaction::apply -> Result<(), RolledBack> with Ok(())
@@ -67,37 +67,17 @@
                     mode: b.mode,
                 })
                 .collect()
         })
     }
 
     /// Apply every action, or none of them.
     pub fn apply(&self, fs: &mut dyn FileSystem) -> Result<(), RolledBack> {
-        let before = self.before(fs).map_err(|e| RolledBack {
-            failed_at: PathBuf::new(),
-            reason: format!("could not read the files to be changed: {e}"),
-            restored: 0,
-        })?;
-
-        for (index, action) in self.actions.iter().enumerate() {
-            let result = match action {
-                Action::Write { path, bytes, mode } => fs.write(path, bytes, *mode),
-                Action::Delete { path } => fs.remove(path),
-            };
-            if let Err(e) = result {
-                let restored = undo(fs, &before[..index]);
-                return Err(RolledBack {
-                    failed_at: action.path().clone(),
-                    reason: e.to_string(),
-                    restored,
-                });
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn before(&self, fs: &dyn FileSystem) -> io::Result<Vec<Before>> {
         self.actions
             .iter()
             .map(|a| {
                 let path = a.path().clone();
                 Ok(Before {

---- a_rollback_that_cannot_finish_reports_how_far_it_got stdout ----

thread 'a_rollback_that_cannot_finish_reports_how_far_it_got' (17071535) panicked at core/tests/transaction.rs:149:10:
nothing can be written: ()

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17071531) panicked at core/tests/transaction.rs:102:10:
the second action fails: ()

---- rolling_back_removes_a_file_the_transaction_created stdout ----

thread 'rolling_back_removes_a_file_the_transaction_created' (17071540) panicked at core/tests/transaction.rs:85:10:
the second write fails: ()

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    a_rollback_that_cannot_finish_reports_how_far_it_got
    every_write_lands_when_nothing_fails
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
