*** core/src/transaction.rs:99:9: replace Transaction::before -> io::Result<Vec<Before>> with Ok(vec![])

*** mutation diff:
--- core/src/transaction.rs
+++ replace Transaction::before -> io::Result<Vec<Before>> with Ok(vec![])
@@ -91,27 +91,17 @@
                     restored,
                 });
             }
         }
         Ok(())
     }
 
     fn before(&self, fs: &dyn FileSystem) -> io::Result<Vec<Before>> {
-        self.actions
-            .iter()
-            .map(|a| {
-                let path = a.path().clone();
-                Ok(Before {
-                    content: fs.read(&path)?,
-                    mode: fs.mode(&path),
-                    path,
-                })
-            })
-            .collect()
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Put back everything already changed. A file that did not exist before is removed rather
 /// than left behind: it would be a file the user never had and tapkey no longer tracks.
 ///
 /// An error here is deliberately not propagated. The transaction has already failed, and the
 /// only useful thing left is to put back as much as possible and say how much that was.

---- capturing_records_contents_and_absence_alike stdout ----

thread 'capturing_records_contents_and_absence_alike' (17071568) panicked at core/tests/transaction.rs:120:5:
assertion `left == right` failed
  left: 0
 right: 2

---- rolling_back_a_delete_recreates_the_file_with_the_mode_it_had stdout ----

thread 'rolling_back_a_delete_recreates_the_file_with_the_mode_it_had' (17071571) panicked at core/src/transaction.rs:87:48:
range end index 1 out of range for slice of length 0

---- a_delete_is_undone_by_putting_the_file_back stdout ----

thread 'a_delete_is_undone_by_putting_the_file_back' (17071563) panicked at core/src/transaction.rs:87:48:
range end index 1 out of range for slice of length 0

failures:
    a_delete_is_undone_by_putting_the_file_back
    a_failure_on_the_second_of_three_files_puts_the_first_one_back
    capturing_records_contents_and_absence_alike
    rolling_back_a_delete_recreates_the_file_with_the_mode_it_had
    rolling_back_removes_a_file_the_transaction_created

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
